{"data":{"markdownRemark":{"html":"<ul>\n<li><a href=\"http://www.berkshirehathaway.com\">Warren Buffett</a>: historical lessons on buffettology. No need to go to school. This alone will teach you how to handle finances, relationships, ethics and avoiding stupid mistakes especially greed.</li>\n<li><a href=\"https://www.jpmorganchase.com/corporate/investor-relations/annual-report-proxy.htm\">Jamie Dimon</a>: is the CEO of JP Morgan Chase. He is leading one of the largest banks in the world and has a lot to share on banking, economy and policies.</li>\n<li><a href=\"https://www.oaktreecapital.com/insights/howard-marks-memos\">Howard Marks</a>: if Warren Buffett is for equity then Howard Marks is for fixed income. Both follow the same principles but are involved in managing different asset classes.</li>\n<li><a href=\"https://www.blackrock.com/corporate/investor-relations/larry-fink-chairmans-letter\">Larry Fink</a>: is the CEO of Blackrock, a largest active investing organization. Lot of wisdom in his letters.</li>\n<li><a href=\"http://1icz9g2sdfe31jz0lglwdu48.wpengine.netdna-cdn.com/wp-content/uploads/2012/09/Seth-Klarman-Baupost-Group-Letters.pdf\">Seth Klarman</a>: not much out there on Seth Klarman but this is the best resource I could find.</li>\n<li><a href=\"https://ir.aboutamazon.com/annual-reports\">Jeff Bezos</a>: Amazon. Period.</li>\n<li><a href=\"https://www.csisoftware.com/category/pres-letters/\">Mark Leonard</a>: is an underdog but one of the most fascinating CEOs out there who have acquired software businesses and managed to grow companies many x times. Buffett of software companies!</li>\n<li><a href=\"https://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=77768\">Clifford Asness</a>: a hedge fund manager behind a very well run firm, AQR Capital.</li>\n<li><a href=\"https://www.socialcapital.com/annual-letters/\">Chamath Palihapitiya</a>: used to be a VC, helped grow facebook but now following Buffett type partnership. A lot of insight on private market and how moonshot ideas will take over.</li>\n<li><a href=\"https://www.adventur.es/annual-letters/\">Brent Beshore</a>: not a fan of private equity genrally speaking, but Brent has good intentions and has a lot to share in his letters.</li>\n</ul>","frontmatter":{"date":null,"path":"/explore/shareholder-letters","title":"Shareholder Letters"},"fields":{"readingTime":{"text":"2 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}