{"data":{"markdownRemark":{"html":"<p>Work in progress.</p>\n<p>As I enter the fourth decade of my time on this planet, I am no longer planning the upcoming months or years but rather thinking in decades. This helps orient myself into working towards long-term outcomes, shifting the mindset towards mastery, staying humble and steering away from distractions. This also sets a sense of urgency on how to spend time because there are only handful of decades left. On personal level, it shapes the mindset by spending time with loved ones and deepening relationships.</p>\n<p>As I look forward, what did I learn from the last decade?</p>\n<h4>1. Ignorance</h4>\n<p>Many view ignorance as negative, but in my opinion, ignorance can serve well if used appropriately. This is mostly due to ego not in check. I have been rebellious my entire life. I didn't have a corporate job after college because I thought I could run a company. I also traveled to few places after graduating college. Not because I was smart, but I was ignorant about lot of things and lack of knowledge on how things operated in real world. Starting a company is hard, keeping it alive is even harder. The latter could only be learnt if one actually <em>does</em> it and <em>is</em> ignorant. If I already knew the limitations, I would have never tried in the first place. Being ignorant paid off for me! Learning to find strangers and working with them, bringing a project to life, and selling a product once it comes to life are the skills I would've never learned otherwise. Lastly, fear never crossed my mind because I was too busy being ignorant. Today, I somewhat despise ignorance but I am glad I got that window to live in such a way. Everyone gets a limited window in their lives to be ignorant and everyone should take advantage of that because it allows everyone to wander and explore.</p>\n<h4>2. Exploration</h4>\n<p>Growing up, I had areas of interest I wanted to pursue but nothing with a strong conviction. Naturally, I was drawn to stock investing from an early age. </p>\n<h4>3. Relationships</h4>\n<h4>4. Ambition</h4>\n<h4>5. Humor</h4>\n<h4>6. Health</h4>\n<h4>7. Mastery</h4>","frontmatter":{"date":"03 August, 2019","path":"/blog/thinking-in-decades","title":"Thinking In Decades"},"fields":{"readingTime":{"text":"2 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}