{"data":{"markdownRemark":{"html":"<h2>Work in Progress</h2>\n<details>\n  <summary><strong>Table of Contents</strong></summary>\n  <br>\n<ul>\n<li>Purpose</li>\n<li>Why write?</li>\n<li>\n<p>How to make writing less taxing?</p>\n<ul>\n<li>Simple sentences</li>\n<li>Pretending you are writing it to someone</li>\n<li>Do not edit</li>\n<li>Do not worry about the length</li>\n</ul>\n</li>\n<li>\n<p>Singular purpose</p>\n<ul>\n<li>Use titles to define your purpose</li>\n<li>Disadvantages of purpose</li>\n</ul>\n</li>\n<li>\n<p>Information gathering</p>\n<ul>\n<li>Use your imagination and experiences</li>\n<li>First principles approach</li>\n<li>Inversion</li>\n<li>Multi-disciplinary approach</li>\n<li>Short experiments</li>\n<li>\n<p>Read, research and take more notes</p>\n<ul>\n<li>Questions</li>\n<li>Books &#x26; publications</li>\n<li>A note on note taking</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Outlining</li>\n<li>First draft</li>\n<li>\n<p>Second draft</p>\n<ul>\n<li>Cutting</li>\n<li>Rewriting</li>\n<li>Avoid Clichés</li>\n<li>First person rules</li>\n<li>Avoiding passive voice</li>\n<li>Caution with adverbs</li>\n<li>\n<p>Punctuation</p>\n<ul>\n<li>Periods</li>\n<li>Commas</li>\n<li>Ellipsis</li>\n<li>Semicolons</li>\n<li>Colons</li>\n<li>Punctuation within quotation marks</li>\n<li>Punctuation within parentheses</li>\n<li>Dashes</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Final draft</p>\n<ul>\n<li>Resolutions</li>\n<li>Rhythm &#x26; Style</li>\n<li>Bibliography</li>\n</ul>\n</li>\n<li>\n<p>Getting better</p>\n<ul>\n<li>Use commonplace to dissect good writing</li>\n<li>Good writers and books</li>\n</ul>\n</li>\n<li>\n<p>Notes</p>\n</details>\n<br>\n</li>\n</ul>\n<hr>\n<h4>Purpose</h4>\n<p>The underlying motivation for the piece stemmed from reading a ton. I started reading a lot a few years ago which led to the fiddling with ideas. However, none of these ideas were concrete. I couldn't connect them to its origin and neither could I articulate them well. Writing became the next natural step of progression. Below are my notes compiled from observing others.</p>\n<h4>Why write?</h4>\n<p>Writing broadens your mind by turning abstraction such as intuition and ideas into concrete words. You are full of fuzzy ideas that are strongly supported by your intuition. However, intuition isn't a tool. It is a gut feeling. Intuition fuels your biased decision making process. Turning intuition into tools means understanding their origins, limitations and how they interact with other ideas.</p>\n<p>The tool available on hand is called writing. Why use such a tool? Writing is an investigative tool to explore your thinking.</p>\n<p>Turning ideas into words supported by logical thinking will crystallize your ideas. Writing allows you to think about ideas more rationally by deliberately questioning its origins and limitations. Writing extends memory and clarifies thinking which then can help you narrate well. Writing is another form of art which requires deep and clear thinking.</p>\n<p>Writing helps you win. How? The person who can best formulate ideas can communicate the best argument. Writing preserves truth. It allows you to have profound and original ideas at your fingertip. Writing helps you sharpen your capacity to think, debate from first principles approach, and present intelligently. Writing prevents you from falling prey to fads and ideologies. It removes distraction.</p>\n<p>The most complex hierarchies such as law, medicine, business, politics or academics require breaking down the complex theories into a simpler form. At this level of competency, you are required to communicate well by defending your strategy in business, economic policy in politics or thesis in academia research. Thus, well formulated thoughts become necessary and valuable to persuade your audience. </p>\n<p>Warren Buffett once said:</p>\n<blockquote>\n<p>Some of the things I think I think, I find don’t make any sense when I start trying to write them down. You ought to be able to explain why you’re taking the job you’re taking, why you’re making the investment you’re making, or whatever it may be. And if it can’t stand applying pencil to paper, you’d better think it through some more.</p>\n</blockquote>\n<p>Lastly, exposing writing to others will question your intent and thought process. There is no better way to get feedback. The more you write and share, the more feedback you'll receive creating a positive feedback loop. As the saying goes, the pen is mightier than the sword.</p>\n<h4>How to make writing less taxing?</h4>\n<p>Writing takes cognitive load which introduces writer's block. But it can be less taxing if you go after the incremental wins.</p>\n<ul>\n<li>\n<ol>\n<li>Use radically simple sentences and do not worry about grammatical syntax. The goal is to pen down whatever comes to your mind. For example, let's pick capitalism.</li>\n</ol>\n<p><em>\"Capitalism is a free market. Capitalism is an economic system. America is built on capitalism.\"</em></p>\n</li>\n<li>\n<ol start=\"2\">\n<li>Pretend you are writing a letter to someone either asking questions or explaining what you know. You should choose a person who you admire the most and pretend you are having a conversation with that person. This will bring forth your natural flow and tone. Writing this way will also raise several questions which will make it easy to gather information when you start researching more. For example:</li>\n</ol>\n<p><em>\"Dear Buffett &#x26; Munger, I want to explore what capitalism is and the implications of the economic system on our society today. I understand capitalism is not perfect but is it the only system that works the best out of all the options available? If that is true, then how is China prospering built on socialist economic system?\"</em> </p>\n<p><em>\"Let me explain you how did capitalism came about.\"</em></p>\n</li>\n<li>\n<ol start=\"3\">\n<li>Do not worry about polishing or editing your material just yet. Keep going!</li>\n</ol>\n</li>\n<li>\n<ol start=\"4\">\n<li>Do not worry about the length of your piece. The goal is to write down everything you know. Reading and research will come later.</li>\n</ol>\n</li>\n</ul>\n<h4>Singular purpose</h4>\n<p>You must define your purpose for writing. For example, I want to understand capitalism. This purpose becomes the center of the universe when exploring the topic. </p>\n<p>You should let go of sentences or ideas that has nothing to do with the topic. Vagueness causes confusion. To create a bond with a reader, you need to stay ultra-focused on your purpose otherwise it will break the bond. If you start diverging from the original topic, it is time to rethink about the purpose.</p>\n<p>For brevity, try to have one purpose for each sentence. But don't overkill on making your sentences so pure that they are boring or too dry to read. Narrative is as important as purpose to capture reader's attention. I'll address stylistic choices later for more fluid narrative. However, each sentence, paragraph and the essay should relentlessly focus on only one purpose.</p>\n<p><strong>Use ultra-focused titles to help you stay focused on your purpose.</strong> Titles are important. If anytime you feel diverged, titles can be a good reminder of your purpose. If you can't understand your topic, your reader will most likely feel the same. Using something like ”Systems, Free Society &#x26; Economy” can be dangerous because it does not allow a reader to understand the purpose of your writing. The title is so vague here. It is impossible to tell which type of systems or which free society. A better title could be ”Capitalism and its role in America.” This will draw readers who are interested in understanding capitalism and its role in American economy. It is clear and concise.</p>\n<p><strong>Disadvantages of purpose</strong> What are the limitations of purpose? This could be complicated because there are circumstances when you have to explore beyond the boundaries of your purpose. You might be exploring topic A and B. But the topic B does not fit into topic A. This creates uncertainty and does not allow for singular purpose. During this emotional roller coaster, you may feel your exploration on topic B is a wasted effort since it does not tie into topic A. These doubts must be resisted because now you have a better understanding of a topic from different viewpoints. Perhaps, a better alternative is to review your purpose again.</p>\n<h4>Information gathering</h4>\n<p>How to gather information on a topic you want to write about?</p>\n<ul>\n<li>\n<ol>\n<li>Use your experience and imagination to write. The latter is always great for story telling which captures the reader's attention. Use your experiences by sharing a story. Go back to a moment when you were star struck. Share those experiences with your readers if they are relevant to your topic.</li>\n</ol>\n</li>\n<li>\n<ol start=\"2\">\n<li>Use first principles approach to find the universal laws of your topic. Reasoning from first principles will get you the most basic and foundational facts. It will remove the impurity of assumptions and biases. The idea is to break down the complicated problems into basic elements and then reassemble them from the ground up. Therefore, as a writer, it should be your obligation to keep trying until  you get to the bottom of your topic.</li>\n</ol>\n</li>\n<li>\n<ol start=\"3\">\n<li>What is the inverse of topic you are exploring? Always invert because this will prevent you from being blind-sided with one-sided opinion. Great thinkers and writers do this really well! For example, inversion of <em>\"what are the advantages of capitalism?\"</em> can be <em>\"what are the disadvantages of capitalism?\"</em></li>\n</ol>\n</li>\n<li>\n<ol start=\"4\">\n<li>Use multi-disciplinary approach to find how the topic is relevant in other fields. This can be simply by googling, \"What is the relevance of X in the field ABC?\" For example, <em>\"How adaptive system such as survival of the fittest in biology and capitalism in economics are related to each other?\"</em></li>\n</ol>\n</li>\n<li>\n<ol start=\"5\">\n<li>Run short experiments and tests by stress testing a set of data to derive a conclusion from the study. Running a short study should give you a direction on where to take your research. You should gather data from credible resources. Keep in mind, you are not a data analyst so don't spiral yourself into analysis paralysis. This step is to ensure that you have done your homework. Relying on other academic research should also be sufficient.</li>\n</ol>\n</li>\n</ul>\n<p>By now, you may also feel you are running out of ideas. What do you do when ideas stop flowing?</p>\n<p>The simplest answer is to read more and research more. If you can't brain dump your ideas then there is nothing to share. In such a situation, don't pride yourself with \"know it all\" or coming up with excuses such as \"writer's block.\" Instead, go to a local library to research more. Ask your local librarian for book recommendations on the topic you are writing about. Ask yourself two key questions to continue exploring and researching further:</p>\n<ul>\n<li>\n<ol>\n<li>What are key <em>supporting points</em> for **your argument?</li>\n</ol>\n</li>\n<li>\n<ol start=\"2\">\n<li>What are key <em>inversion points</em> for your topic?</li>\n</ol>\n</li>\n</ul>\n<p>In our case on the topic of capitalism: </p>\n<ul>\n<li><strong>Supporting point</strong> — <strong>*</strong>State why capitalism is given such importance in western world?*</li>\n<li><strong>Supporting point</strong> — <em>Explore why capitalism is not working today for middle class.</em></li>\n<li><strong>Inversion point</strong> — <em>Predict how America would be different without capitalism.</em> <strong>Inversion point</strong></li>\n<li><strong>Supporting point</strong> — <em>Explore the biases found in 1% of wealthy population to continue supporting capitalism.</em></li>\n<li><strong>Inversion point</strong> — <strong>*</strong>State why China's system is prosperous today?*</li>\n</ul>\n<p>Once you state these key points, gather 5-10 publications and 5-10 books and start taking notes.</p>\n<ul>\n<li>\n<ol>\n<li>Book1 , Book 2, Book 3, etc.</li>\n<li>Notes1, Notes2, Notes3, etc.</li>\n</ol>\n</li>\n<li>\n<ol start=\"2\">\n<li>Publication 1, Publication2, etc.</li>\n<li>Notes1, Notes2, etc.</li>\n</ol>\n</li>\n</ul>\n<p><strong>A note on taking notes</strong> </p>\n<p>Highlighting is overrated. Instead, practice learning mindfully. How? Summarize each section of your publication or each chapter of your book. This step of exploring really enables you to apply rigor to understanding what you have just read. By doing this, you put your brain to work which will help you remember and expand your memory. Always read with a pen or pencil so you can take notes right away. Putting this aside will only make you push the can further down the road. These are all good mental hygiene practices.</p>\n<p>If you don't understand something, re-read those sentences again, but slowly and deeply. As you read, ask yourself: <em>What does the author mean here? What were his intentions? What is the key point the author is trying to convey?</em> Scribble away in margins as you answer these questions. This is called critical thinking by asking rigorous questions. Only by picking sentences, paragraphs, pages, and chapters apart you can learn how writer's intentions.</p>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"10 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}