{"data":{"markdownRemark":{"html":"<p>Recently at work, I've watched other developers use <code class=\"language-text\">console.log</code> a lot in code to find desired values given by certain functions. I am often still confused where to put <code class=\"language-text\">console.log</code>, and it is definitely not the only way to debug, so I've also begun to use the developer tools JavaScript debugger in Firefox and Chrome. These tools allow you to pause the execution of your code, and walk through it to help you find bugs.</p>\n<p>The debugger can do a lot, and it'd take a much longer post to walk through this tool's UI, so I'll mention four of the most commonly used debugging methods here.</p>\n<ul>\n<li>\n<p><strong>Step over code</strong></p>\n<ul>\n<li>Steps over a function that doesn't contain a bug and runs its code</li>\n</ul>\n</li>\n<li>\n<p><strong>Step into code</strong></p>\n<ul>\n<li>Steps inside a function and allows you to run each part separately</li>\n</ul>\n</li>\n<li>\n<p><strong>Step out of code</strong></p>\n<ul>\n<li>Steps out of a function you are inside, and runs its code</li>\n</ul>\n</li>\n<li><strong>Resume execution of code</strong></li>\n</ul>\n<p>Debugging is something developers have to be really good at. So don't be scared to do it! Or, be scared but do it anyway, you'll get better :)</p>\n<p>Check out the docs on the <a href=\"https://developer.mozilla.org/en-US/docs/Tools/Debugger\">Firefox</a> debugger and the <a href=\"https://developers.google.com/web/tools/chrome-devtools/javascript/reference#breakpoints\">Chrome</a> debugger. Lots of great info there to help you get started. Also check out <a href=\"https://peterlyons.com/js-debug\">this article</a> from Peter Lyons. He explains debugging of both front-end and back-end JavaScript code.</p>\n<p>Also, check <a href=\"https://daverupert.com/2018/05/my-struggle-with-testing-code/\">this</a> out - an honest post about how even experienced devs find it hard to debug.</p>","frontmatter":{"date":"01 July, 2018","path":"/explore/debugging","title":"Debugging"},"fields":{"readingTime":{"text":"2 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}