{"data":{"markdownRemark":{"html":"<h1>Work in Progress</h1>\n<h3>Who is a Product Manager?</h3>\n<p>A person who is responsible to set overall capability vision and direction, own the quality and delivery of products, ensure roadmap is prioritized to address market opportunities, and lead the product management discipline for the team. <em>Product Owner</em> is a role you play on a scrum team. <em>Product Manager</em> is the job.</p>\n<blockquote>\n<p>A good product takes chaos and creates order. — Brian Nogard</p>\n</blockquote>\n<p>How do you set yourself up for success as a product manager? To master the art of product management requires many years of practice. The only way to learn it is to actually do it. Become a knowledge sponge, talk to external and internal product managers, read everything about the topic, copy others before you try to find your own voice and do something unique. Doing something unique is most probable after achieving mastery.</p>\n<ul>\n<li>We are most interested in the “creation” of a new scientific principle or a new application of an old one, but we can be general here. One way of investigating the problem is to consider the great ideas of the past and see just how they were generated. Unfortunately, the method of generation is never clear even to the “generators” themselves.</li>\n</ul>\n<h2>Key Responsibilities</h2>\n<p>On a practical note, you are responsible for the following tasks on the team: running product review, maintaining/updating the product roadmap, and doing sprint planning. Here are two slides that help clarify your role vs the engineering manager.</p>\n<ul>\n<li>Understand the customer deeply — this means user studies, you have to go talk to the users every week and spend a lot of time with them to hear their pain, get inside their head. product managers know the market, the product, the product line and the competition extremely well and operate from a strong basis of knowledge and confidence. </li>\n<li>Be metrics driven , you should be using time series data to give you insight into what people are doing with the product and see if the changes you are making are improving things. If you haven’t instrumented the app and chosen a metric you want to improve, you are just guessing.</li>\n<li>The product manager is responsible for prioritizing the product roadmap and communicating it to the team. Not as a top down dictator, but as a consensus builder amongst all the stakeholders, breaking a tie when necessary.</li>\n<li>You need to be a communication hub, both when building consensus internally on priorities/roadmap, but also externally communicating changes to customers. Users need to see that the product is continually improving by hearing about it from you. Everyone internally needs to be on the same page when changes roll out. You are the point of contact for all things related to this product.</li>\n<li>Once you master all of that, you will need to develop product vision (conviction about where things are going in the future, make the hard calls about what to eliminate, etc) and strive to make something truly great. You can think about it not just as eliminating customer pain, but actually creating customer delight. In rare instances, you can wind up creating something that people actually love. (very few products attain this — nobody says they love Tide detergent, but people do say they love their Harley Davidson).</li>\n<li>Good product managers don’t get all of their time sucked up by the various organizations that must work together to deliver right product right time. They don’t take all the product team minutes, they don’t project manage the various functions, they are not gophers for engineering. They are not part of the product team; they manage the product team. Engineering teams don’t consider Good Product Managers a “marketing resource.” Good product managers are the marketing counterpart of the engineering manager. Good product managers crisply define the target, the “what” (as opposed to the how) and manage the delivery of the “what.” Bad product managers feel best about themselves when they figure out “how”. Good product managers communicate crisply to engineering in writing as well as verbally. Good product managers don’t give direction informally. Good product managers gather information informally.</li>\n<li>Good product managers create leveragable collateral, FAQs, presentations, white papers. Bad product managers complain that they spend all day answering questions for the sales force and are swamped. Good product managers anticipate the serious product flaws and build real solutions. Bad product managers put out fires all day. Good product managers take written positions on important issues (competitive silver bullets, tough architectural choices, tough product decisions, markets to attack or yield). Bad product managers voice their opinion verbally and lament that the “powers that be” won’t let it happen. Once bad product managers fail, they point out that they predicted they would fail.</li>\n<li>Good product managers know the market, the product, the product line and the competition extremely well and operate from a strong basis of knowledge and confidence. A good product manager is the CEO of the product. A good product manager takes full responsibility and measures themselves in terms of the success of the product. The are responsible for right product/right time and all that entails. A good product manager knows the context going in (the company, our revenue funding, competition, etc.), and they take responsibility for devising and executing a winning plan (no excuses).</li>\n<li>Bad product managers have lots of excuses. Not enough funding, the engineering manager is an idiot, Microsoft has 10 times as many engineers working on it, I’m overworked, I don’t get enough direction. Barksdale doesn’t make these kinds of excuses and neither should the CEO of a product.</li>\n<li>Good product managers focus the team on revenue and customers. Bad product managers focus team on how many features Microsoft is building. Good product managers define good products that can be executed with a strong effort. Bad product managers define good products that can’t be executed or let engineering build whatever they want (i.e. solve the hardest problem).</li>\n<li>Good product managers think in terms of delivering superior value to the market place during inbound planning and achieving market share and revenue goals during outbound. Bad product managers get very confused about the differences amongst delivering value, matching competitive features, pricing, and ubiquity. Good product managers decompose problems. Bad product managers combine all problems into one.</li>\n<li>Good product managers think about the story they want written by the press. Bad product managers think about covering every feature and being really technically accurate with the press. Good product managers ask the press questions. Bad product managers answer any press question. Good product managers assume press and analyst people are really smart. Bad product managers assume that press and analysts are dumb because they don’t understand the difference between “push” and “simulated push.”</li>\n<li>Good product managers err on the side of clarity vs. explaining the obvious. Bad product managers never explain the obvious. Good product managers define their job and their success. Bad product managers constantly want to be told what to do.</li>\n<li>Good product managers send their status reports in on time every week, because they are disciplined. Bad product managers forget to send in their status reports on time, because they don’t value discipline.</li>\n</ul>\n<p>At large technology companies like Google, product management can be a very stressful vocation. The truth is that you serve at the behest of your colleagues - you can't win without your team, and you certainly won't succeed without their backing. Given this, here's advice I share, and try to live by:</p>\n<ol>\n<li>Product managers wear three hats\nCongrats, as a product manager you get three jobs:\na) Project manager: keep the wheels on the bus, the trains running on time and over-communicating about status, documentation, strategy, vision, etc\nb) Product manager: the actual feature and requirements spec'ing, working with your x-functional team to get things built and shipped\nc) CEO: the buck stops with you no matter what the org chart says. When your product succeeds lavish praise on the team. If your product is struggling you don't blame sales or marketing - you help them get on track.</li>\n</ol>\n<p>Whether you're a greenhorn PM or a senior jedi master, you always wear these hats. It's just that your percentage of time allocated to each of the roles shifts away from A and towards C. Fresh out of school and you might be 35% project manager/60% product manager/5% CEO. It's important that the CEO # is never 0% -- even the newest PM hire should have something they approach this way. It builds accountability and a way of thinking that becomes essential to their development.</p>\n<ol start=\"2\">\n<li>Seek collaboration, not necessarily consensus\nIn their leadership of flat x-functional teams some PMs seek consensus, thinking this is the best way to get a team moving in the same direction. I believe this is wrong. Collaboration, communication and inclusion are essential - you'll die on the vine without your team. But it's not consensus you should seek. It's a mandate to lead in a particular direction. The backing to make the call.</li>\n</ol>\n<p>You acquire your mandate power via upper mgmt supporting your strategic plan, from your x-functional team leads feeling included and empowered, and from your team members knowing that they can contribute and have ownership over their areas, but at the same time have a strong PM who will make the tough decisions.</p>\n<ol start=\"3\">\n<li>\n<p>Give PMs goals, not projects\nProduct managers turns goals into projects with the help of their teams and entrepreneurship. At YouTube we try to give our PMs broad ownership and then work with them to ensure the projects they initiate fulfill the needs and measurable goals of the area and the company.</p>\n</li>\n<li>\n<p>Overwhelm them as a prioritization exercise\nToo much to do. That's the perpetual state of being a PM. But the benefit is you focus on the most meaningful actions and move from highest nail to highest nail. If you're leading a group of PMs the tricky thing is to make sure you're still positioning them for success. Gentle nudges, help in prioritizing, etc. But at the end of the day they need to develop this critical muscle where they learn to delegate and to pull resources towards them. The leveraged PM doesn't say \"I can't get it done,\" they prioritize and help identify the resources necessary for success.</p>\n</li>\n<li>\n<p>\"Not on my watch\"\nBe willing to stand up for what you believe, especially when you're representing your users. Hard decisions make great products. Your job is not to carve the safe route. Your job is to increase the probability that you'll be delighting millions of users in a sustainable fashion. Don't let others design your product for you.</p>\n</li>\n<li>\n<p>You are a caretaker of something bigger\nYour job is to take a product (and company) from one defined phase to the next. Then you will pass it on for another phase. The leader for the next phase might be you again or it could be someone else. Either way you should be handing off something which is sustainable. If your product was a winner solely because you carried the weight of the world on your shoulders then you're not doing your job. Build leverage, build an organization around you, find people who will be even better than you.</p>\n</li>\n</ol>\n<p>What are some product management tips that you've come across?</p>\n<ul>\n<li>People don't want to use your software. They want to lose weight, laugh, be entertained, get smarter, spend time with loved ones, go home on time, sleep adequately, eat good food, be happy.\nYour product is only as good as the experiences it enables people to have.</li>\n<li>Person will set overall capability vision and direction, own the quality and delivery of software products, ensure roadmap is prioritized to address market opportunities, and lead the product management discipline for the team.</li>\n<li>Product Owner is a role you play on a Scrum team. Product Manager is the job.</li>\n<li>The more experience one has building things, the less they separate ideation and implementation.</li>\n<li>Lemonis is famous for his People/Process/Product principle, where he analyzes businesses on the quality of people, excellence and relevance of product, and the best way to deliver the product.</li>\n<li>Ultimately, the best thing you can do to prepare for a career in Product Management is to build. Manage and “own” a project from inception through execution and operation. Create KPIs and measure your impact. Volunteer for stretch projects. f you have a gap in client knowledge, shadow a CSC or Product Consultant. Learn about our clients, what jobs they are trying to accomplish with our products, and what problems Morningstar is uniquely positioned to solve for them. Become an expert in Morningstar’s products.</li>\n<li>All things considered, the best way to validate your idea is to discuss it with everyone you can engage in a meaningful and constructive dialogue. People who tend to keep their ideas to themselves or not able to communicate are normally not bound to success.</li>\n<li>Questions are a product manager’s best tool. The best way to understand what’s going on or how to get better is to pose probing questions to the people you manage, and above all, to yourself. Pausing to infuse intention into every move at the outset, take a step back at key points along the way, or stop for a tune-up if you’re already further along the road is critical to leveling up as a leader — and questions are the keys that unlock the door to development.</li>\n<li>Design shrinks the gap between what a product does and why it exists. Good design builds on earlier ideas, just as in math or physics. Good design is using reason to make decisions and to solve problems. Every man-made object you use in real life is designed, from forks and desks to keyboards and grocery bags and are the culminations of many hours of thinking and many more hours of trial and error.</li>\n<li>A good product takes chaos and creates order. — Brian Nogard</li>\n<li>'Customers don't have needs, they just want to make progress within the system they belong.' Eye-opening statement from Alan Klement's book. - Jérémie Pottier @dzey</li>\n</ul>\n<p>What distinguishes the Top 1% of product managers from the Top 10%?\nThe top 10% of product managers excel at a few of these things. The top 1% excel at most or all of them:\nThink big - A 1% PM's thinking won't be constrained by the resources available to them today or today's market environment. They'll describe large disruptive opportunities, and develop concrete plans for how to take advantage of them.\nCommunicate - A 1% PM can make a case that is impossible to refute or ignore. They'll use data appropriately, when available, but they'll also tap into other biases, beliefs, and triggers that can convince the powers that be to part with headcount, money, or other resources and then get out of the way.\nSimplify - A 1% PM knows how to get 80% of the value out of any feature or project with 20% of the effort. They do so repeatedly, launching more and achieving compounding effects for the product or business.\nPrioritize - A 1% PM knows how to sequence projects. They balance quick wins vs. platform investments appropriately. They balance offense and defense projects appropriately. Offense projects are ones that grow the business. Defense projects are ones that protect and remove drag on the business (operations, reducing technical debt, fixing bugs, etc.).\nForecast and measure - A 1% PM is able to forecast the approximate benefit of a project, and can do so efficiently by applying past experience and leveraging comparable benchmarks. They also measure benefit once projects are launched, and factor those learnings into their future prioritization and forecasts.\nExecute - A 1% PM grinds it out. They do whatever is necessary to ship. They recognize no specific bounds to the scope of their role. As necessary, they recruit, they produce buttons, they do bizdev, they escalate, they tussle with internal counsel, they *.\nUnderstand technical trade-offs - A 1% PM does not need to have a CS degree. They do need to be able to roughly understand the technical complexity of the features they put on the backlog, without any costing input from devs. They should partner with devs to make the right technical trade-offs (i.e. compromise).\nUnderstand good design - A 1% PM doesn't have to be a designer, but they should appreciate great design and be able to distinguish it from good design. They should also be able to articulate the difference to their design counterparts, or at least articulate directions to pursue to go from good to great.\nWrite effective copy - A 1% PM should be able to write concise copy that gets the job done. They should understand that each additional word they write dilutes the value of the previous ones. They should spend time and energy trying to find the perfect words for key copy (button labels, nav, calls-to-action, etc.), not just words that will suffice.</p>\n<p>I'm not sure I've ever met a 1% PM, certainly not one that I identified as such prior to hiring. Instead of trying to hire one, you're better off trying to hire a 10% PM who strives to develop and improve along these dimensions.\nThis is a very interesting question. Let’s first understand what distinguishes the top 1% from the top 10% in any field. Let’s also acknowledge that the top 10% in any field are likely to be some of the top notch performers in that field. The margin of difference is likely small. Yet there must be that extra special “it” factor that separates the top 1% from the rest. As a result, the top 1% enjoy a well-earned exalted status. That is why we speak of Michael Jordan, Roger Federer, Serena Williams and such people in a different breath from their peers in the game.</p>\n<p>What is the special “it” factor?</p>\n<p>A few things come to mind. Most of the points below apply to team sports, and since building and launching a product is a team sport, this analogy might just work.</p>\n<p>Consistency\nThe top 1% athletes have been consistent performers at the top of their game for a very long period of time. Did they have bad days? Sure. Did they win all the time? Certainly not. The occasional failure notwithstanding these performers could be counted upon to deliver the goods a very high percentage of the time.</p>\n<p>What does consistency mean for the 1% PM?</p>\n<p>One might be tempted to say that if you delivered one hit product after another in one awesome company after another, that you would be a highly consistent 1% PM. Not really.</p>\n<p>Consistency is about performance, not about the outcome. The outcome is dependent on a lot of other things. For the 1% PM, it is about consistently excellent decision making and behaviors that contributes to successful outcomes. The 1% PM earns the trust of the team and the executive leadership and can be counted upon to take solid judgements and actions over a long period of time.</p>\n<p>Consistently solid decisions, for instance, about strategic direction, roadmap prioritization and tradeoffs, investment cases, etc. The quality of such decisions is reflected in revenue, usage and market share growth.</p>\n<p>Consistent behaviors that form the basis of those solid decisions, for instance, staying intimately connected with customers, users and the market at large, meeting deadlines and expectations for deliverables, always keeping a strategic perspective and clarity about what success means, communicating effectively and frequently, building strong relationships with all stakeholders, staying up to date with the technology stack and trends, to name a few.</p>\n<p>Consistent decision making and behavior is critical to the 1% PM building credibility and trust within her organization.</p>\n<p>Leadership\nIn a team sport like basketball, the top 1% players on the team emerge as the de-facto leaders. The team looks up to them. They lead by example. They provide the mentoring and coaching to the junior members of the team. They want everyone in the team to be successful. They do not let their egos come in the way of the goals of the team. If the team wins, they celebrate the team effort. If the team loses, the buck stops with them.</p>\n<p>Phil Jackson writes about Michael Jordan and Kobe Bryant in his book “Eleven Rings: The Soul of Success” :</p>\n<p>\"One of the biggest differences between the two stars from my perspective was Michael's superior skills as a leader,\" Jackson said. \"Though at times he could be hard on his teammates, Michael was masterful at controlling the emotional climate of the team with the power of his presence. Kobe had a long way to go before he could make that claim.”</p>\n<p>The 1% PM is looked upon as a leader in the organization. Some of the behaviors mentioned above contribute to this. In addition, the 1% PM has a very strong understanding of her product, technology and the financials. She is intimately familiar with the KPIs and metrics of success. As a result, she can represent the product team effectively in executive discussions. She has a seat at the table and frequently leads the conversations when important decisions about the product line are made.</p>\n<p>She communicates effectively across the team, but also with individuals, akin to shaking hands and kissing babies on the campaign trail, as they say. She does this genuinely and does not fake it. She negotiates, cajoles, resolves conflicts, and builds relationships, while ensuring everyone knows what ultimate success really means. The 1% PM demonstrates servant leadership because she knows that she will be successful when everyone around her is successful. Personal glory and decoration is less important to her for it’s own sake.</p>\n<p>Confidence\nThe top 1% players have supreme confidence in their ability to deliver and perform at the highest level, regardless of the high pressure stakes. When the team is down by 3 points with just a few seconds left on the clock, they want the ball in their hands. It does not mean they will win every game from that situation, but when the chips are down, they want to step up to the plate, soak the pressure and lead by action.</p>\n<p>The 1% PM exudes similar confidence. She is confident of holding her own in deep technical discussions with architects. She is confident of standing in front of a room of executives and articulating the product strategy, or making an investment case to help drive the strategy. When she visits upset and irate customers, she assures them confidently that the team has a plan in place to move the needle in the right direction. She knows she won’t be right all the time and doesn’t have to be. So her confidence is not one of arrogance. Rather, it comes from having the passion to make a difference to customers and to the organization.</p>\n<p>Confidence of the 1% PM comes from having a strong work ethic. Success is not guaranteed, but confidence eliminates fear of failure.</p>\n<p>All-Rounder\nWhen the game is over, we realize that the top 1% of the players made their impact felt in all aspects of the game - offensive rebounds, defensive rebounds, assists, high free throw shooting percentage, 3-point shots, steals, etc. They are all over the court, in fact they try and own the court.</p>\n<p>The 1% PM is also an all-rounder. In startups, in addition to being the product manager, if needed she can hack together some demo code, she goes on sales calls as the sales engineer and installs the product, she writes the datasheet and the whitepaper, and she holds the attention of 300 people on a webinar.</p>\n<p>In large companies, there are dedicated people in various functional roles. However, the 1% PM very much plays up and down the court. She meets regularly with sales engineers to understand insights from the field. She listens in on support calls. She works with marketing to understand the performance of lead generation campaigns and sales funnel analysis. She positions the value proposition and unique differentiators which form the basis of marketing messaging. She presents her product strategy and roadmap to industry analysts. She works with sales and channel teams to enable them to position and sell the product.</p>\n<p>The 1% PM plays an important role across the entire product lifecycle, way before the first line of code is written, all the way to launch, driving awareness and sales, and supporting customers.</p>\n<p>We may be tempted to say that this is fundamental for any product manager, but so many product managers are not able to cover the court, either due to lack of time, or due to lack of skills. The 1% PM knows how and where to spend her time and energy most effectively.</p>\n<p>Work Ethic\nThe top 1% players have a strong work ethic. They don't shirk. They practice hard. They don't rest on their laurels, and they don't rely on their natural talents. They don't wing it. They are perfectionists. They work on all aspects of their game.</p>\n<p>The top 1% PM also has a strong work ethic attention to detail. She does not make compromises. She puts in the necessary amount of practice before important presentations. She stays late with the team when needed. She gives equal attention to staff engineers and executives. She is always looking for learning opportunities and seeks mentors inside and outside the organization.</p>\n<p>Alignment of Vision\nThe 1% athlete is not self made. Even Michael Jordan has a coach, and he is aligned with the coach's vision for the team.</p>\n<p>The 1% PM is similarly aligned with the company vision. Her product strategy is aligned with the strategic direction and initiatives of the company. She leverages and extends the core competencies of the organization. She takes the effort to communicate and ensure understanding of the vision and strategy by everyone in the team.</p>\n<p>What do you think?</p>\n<p>The best way to get ahead of this is asking the right questions. I was lucky to find a great opportunity at my current company that had lots of processes in place for an incoming Product Manager but, in hindsight, have learned so much I wouldn’t have even thought to ask during my interview or in my first few months learning the role. In a role where so much is out of your control, having the answers to some of these questions can often be the bare minimum to meet a standard of competence.\nProduct Roadmap\nHow far in advance is the product roadmap planned?\nHow do ideas get on the roadmap?\nHow often does the roadmap change?\nHow much is the average budget for a new product feature?\nHow much time does an average feature take for release?\nHow are delays addressed for feature development?\nWhat is the company’s penchant for scope cuts vs. extended timelines?\nTechnical Expectations\nWhat is the relationship between a Product Manager and an Engineering team?\nHow often is code released? How many code repositories are used?\nHow is the testing evaluated by engineers? What role does a PM play?\nWhat systems are used to ensure successful release?\nWhat is the tech stack? What programs are used for applications? data? utilities? Devops? How much does a PM have to know in order to integrate well?\nBusiness Development\nWhat does product discovery look like?\nWho talks to the product’s users the most?\nHow often does a Product Manager talk to users?\nHow often does a Product Manager get involved in a sales deal?\nHow often does a Product Manager get involved in a go-to market strategy?\nHow are feature requests from users prioritized?\nAre there any groups of users that are prioritized over others?\nPeople Management\nWho does the Product Manager typically report to?\nHow often should a Product Manager check in with parties that they do not report to?\nHow long does it take for a Product Manager for onboard?\nHow is a PM measured when a feature completely fails?\nHow often does the growth of a feature play into the evaluation of a Product Manager?</p>\n<p>Product managers are the glue that bind the many functions that touch a product—engineering, design, customer success, sales, marketing, operations, finance, legal, and more. They not only own the decisions about what gets built but also influence every aspect of how it gets built and launched.</p>\n<p><a href=\"https://www.mckinsey.com/~/media/McKinsey/Industries/Technology%20Media%20and%20Telecommunications/High%20Tech/Our%20Insights/Product%20managers%20for%20the%20digital%20world/SVGZ-Product-managers-ex2.ashx\">https://www.mckinsey.com/~/media/McKinsey/Industries/Technology%20Media%20and%20Telecommunications/High%20Tech/Our%20Insights/Product%20managers%20for%20the%20digital%20world/SVGZ-Product-managers-ex2.ashx</a></p>\n<p>Before becoming the CEOs of Google, Microsoft, and Yahoo, Sundar Pichai, Satya Nadella, and Marissa Mayer were product managers, and they learned how to influence and lead teams by shepherding products from planning to development to launch and beyond. Such experience is also valuable beyond tech: PepsiCo CEO Indra Nooyi started her career in product management–like roles at Johnson &#x26; Johnson and Mettur Beardsell, a textile firm</p>\n<h2>Product Roadmap</h2>\n<h2>Technical Requirements</h2>\n<h2>Design Requirements</h2>\n<h2>Business Development</h2>\n<h2>People Management</h2>\n<h2>Resources</h2>\n<h3>Sources</h3>\n<ul>\n<li><a href=\"https://blog.coinbase.com/a-letter-to-a-new-product-manager-d5d96c228bf4\">A Letter To A New Product Manager by Brian Armstrong</a></li>\n<li><a href=\"https://a16z.com/2012/06/15/good-product-managerbad-product-manager/\">Good Product Manager/Bad Product Manager by Ben Horowitz</a></li>\n</ul>","frontmatter":{"date":"04 March, 2020","path":"/blog/on-product-management","title":"On Product Management"},"fields":{"readingTime":{"text":"25 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}