{"data":{"markdownRemark":{"html":"<p>Imagine you are fascinated by a topic! In order to master a topic, you pound through a pile of books, articles or any other form of artifacts. You feel good about your understanding of that topic. It makes you feel intelligent and are ready to move on to the next topic that captures your mind.</p>\n<p>Six months later, you meet a friend at a coffee shop and try to explain what you had learned a few months ago. But, you miss some of the key facts about the topic. Now you are just sharing your opinions. So this begs the question of how can we intelligently preserve the facts before opinions start to take over? By the way, I am a victim of this hypothetical scenario and I constantly observe this happening around me. This piece is a reminder to myself so I can look back when I start noticing this flaw about myself.</p>\n<p><strong>Write. Wtrite. Write.</strong></p>\n<p>I have made writing and sharing in public a priority. Writing can help you understand a topic clearly and narrate well. Writing is just another form of art. It requires deep and clear thinking. To prose and narrate well, reflect your thoughts on a piece of paper and then try to re-write as you were explaining it to someone else. Writing something down can be a cognitive load. So how can you make it less taxing on yourself?</p>\n<ol>\n<li>Use radically simple sentences. Don't worry about syntax. Just write!</li>\n<li>Pretend you are writing a letter to someone explaining what you have learned. Choose a person who you admire the most and pretend you are writing directly to them. This will bring forth your natural flow and tone.</li>\n<li>The only thing worth doing is to just write. It'll never be good. But once you finish it, you can go back and polish it. Writing is all it matters.</li>\n<li>Don't fall for making your piece viral. You are writing not to get famous but to get more intelligent about topics you care about learning.</li>\n<li>Writing syntatically is great! But make it fun! Tell stories! We are pattern seeking animals and story telling began with our ancestors. This will make explaining easy and easy to consume. Pick characters that you admire, create a plot and end your plot with a huge take away. Lessons of course can be drawn from great stories.</li>\n<li>Don't worry about the length of your piece. The only thing that matter is to get your point across. But for today, just write.</li>\n<li>Use your experience and imagination to write. The latter is always great for story telling and captures reader's attention. But if you get stuck, fall back on your experiences. Go back to a moment when you were star struck. Bring that element into your writing. </li>\n<li>The only qualification you need is your willingness to write.</li>\n<li>Always carry a commonplace book with you. Transcribe what you find inspiring in other people's writing. Emulate those great writers in your commonplace book.</li>\n<li>Just Write!</li>\n</ol>","frontmatter":{"date":"06 September, 2019","path":"/blog/just-write","title":"Just Write"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}