{"data":{"markdownRemark":{"html":"<h4>[I. Brief Summary]</h4>\n<ul>\n<li>Yvon Chouniard was ahead of its times to challenge the conventional wisdom and responsibility of business. He argues against the model of capitalism which chases endless growth and the destruction of natural resources. Patagonia is in the business to make the best quality product, take care of planet, innovate on old rules of simplicity, and use business to drive behavioral change to prevent environmental crisis. The book uncovers Patagnoia's various business philosophies. Clothing business was born in late sixties, after a climbing trip in England. He began to see clothing as a way to help support the marginally profitable hardware business. Patagonia was named for the clothing business. Patagonia went through classic business challenges— inventory management, growing demand, quality control, vendor relationship, global logistics, and many more. It almost brought Patagonia to bankruptcy.</li>\n</ul>\n<h4>[II. Big Ideas]</h4>\n<ul>\n<li>\n<p>History: Chouinard was a young outdoor enthusiast. He did not appreciate how Europeans were rock climbing because they wee damaging the rock. So, he pursued to becoming a blacksmith and started making pitons to leave no trace when rock climbing. There was no competition for pitons. He surrounded himself with people who had similar interest of not damaging the nature and having a passion for outdoor life. These people also happended to be his customers. As the business grew, he expanded into other climbing tools. Each tool was constantly redesigned to be stronger, lighter, simpler and functional. Quality control was always taken seriously because if a tool failed, it could kill someone, and since they were their own best customers, there was a good change it could be one of them. </p>\n</li>\n<li>\n<p>Product Design Philosophy:</p>\n</li>\n<li>\n<p>Production Philosophy: </p>\n</li>\n<li>\n<p>Distribution Philosophy:</p>\n</li>\n<li>\n<p>Marketing Philosophy: </p>\n</li>\n<li>\n<p>Financial Philosophy: </p>\n</li>\n<li>\n<p>Human Resource Philosophy: </p>\n</li>\n<li>\n<p>Management Philosophy:</p>\n</li>\n<li>\n<p>Environmental Philosophy: </p>\n</li>\n</ul>\n<h4>[III. Quotes]</h4>\n<ul>\n<li>What if we shopped to live, instead of lived to shop?</li>\n<li>Studying Zen has taught me to simplify; to simplify yields a richer result. The rock climber becomes a master when he leave his big wall gear at the base, when he so perfects his skill that he climb the wall free, relying on his skill and the features of the rock.</li>\n<li>In anything at all, perfection is finally attained not when there is no longer anything to add, but when there is no longer anything to take away, when a body has been stripped down to its nakedness.</li>\n</ul>","frontmatter":{"date":"05 March, 2020","path":"/bookshelf/let-my-people-go-surfing","title":"Let My People Go Surfing Inc by Yvon Chouinard"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}