{"data":{"markdownRemark":{"html":"<h2>Work in Progress</h2>\n<details>\n  <summary><strong>Table of Contents</strong></summary>\n  <br>\n<ul>\n<li>Purpose</li>\n<li>Why write?</li>\n<li>\n<p>How to make writing less taxing?</p>\n<ul>\n<li>Simple sentences</li>\n<li>Pretending you are writing it to someone</li>\n<li>Do not edit</li>\n<li>Do not worry about the length</li>\n</ul>\n</li>\n<li>\n<p>Singular purpose</p>\n<ul>\n<li>Use titles to define your purpose</li>\n<li>Caution with titles</li>\n</ul>\n</li>\n<li>\n<p>Information gathering</p>\n<ul>\n<li>Use your imagination and experiences</li>\n<li>First principles approach</li>\n<li>Inversion</li>\n<li>Multi-disciplinary approach</li>\n<li>Short experiments</li>\n<li>\n<p>Read, research and take more notes</p>\n<ul>\n<li>Questions</li>\n<li>Books &#x26; publications</li>\n<li>A note on note taking</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Outlining</li>\n<li>First draft</li>\n<li>\n<p>Second draft (revise for clarity)</p>\n<ul>\n<li>Cut</li>\n<li>Rewriting</li>\n<li>Cliches</li>\n</ul>\n</li>\n<li>\n<p>Third draft (technical)</p>\n<ul>\n<li>First person</li>\n<li>Passive Aggressive</li>\n<li>Caution with adverbs</li>\n<li>Punctuation</li>\n</ul>\n</li>\n<li>\n<p>Final draft (voice)</p>\n<ul>\n<li>Resolutions &#x26; examples</li>\n<li>Voice</li>\n<li>Bibliography</li>\n</ul>\n</li>\n<li>\n<p>Getting better</p>\n<ul>\n<li>Dissecting good writers</li>\n<li>\n<p>Dissecting good books</p>\n<ul>\n<li>Read</li>\n</ul>\n</li>\n<li>Commonplace book</li>\n</ul>\n</li>\n<li>\n<p>Notes</p>\n</details>\n<br>\n</li>\n</ul>\n<hr>\n<p>The underlying motivation for this piece stemmed from reading a ton. Some time ago, I started reading a lot which led to the fiddling with ideas. However, none of these ideas were concrete. I couldn't connect them to its origin and neither could I articulate them well. Writing became the next natural step of progression. The question I kept bumping into was, ”how to write well? Here is my attempt to answer that!</p>\n<h4>Why write?</h4>\n<p>Writing broadens your mind by turning abstraction (intuition and ideas) into concrete (words). You are full of fuzzy ideas that are strongly supported by your intuition. However, intuition isn't a tool. It is a gut feeling. Intuition is a fuel that supports your biased decision making process. Turning intuition into tools means understanding their origin, limitations and how they interact with other ideas.</p>\n<p>The tool available on hand is called writing.  Why use such a tool? Writing is an investigative tool to explore your thinking. Writing explores questions you are seeking answers to.</p>\n<p>Turning ideas into words supported by logical thinking will crystallize your ideas. Writing allows us to think about ideas more rationally and deliberately question its origin and limitations. Writing allows you to remove distractions and biases. Writing can help you understand a topic clearly which then can help you narrate well. Writing extends memory and clarifies thinking. Writing is just another form of art. It requires deep and clear thinking.</p>\n<p>Writing helps you win! How? The person who can best formulate ideas can communicate the best argument. Writing preserves truth. It allows you to have profound and original ideas at your fingertip. Writing helps you sharpen your capacity to think, debate and present intelligently. Writing prevents you from falling prey to fads and ideologies.</p>\n<p>The most complex hierarchies such as law, medicine, business, politics or academics require clear thinking and communicating well. At this level of competency, you are required to defend your strategy in business, economic policy in politics or defend your thesis in academia research. Thus, well formulated thoughts become necessary and valuable to persuade your audience. </p>\n<p>Warren Buffett once said:</p>\n<blockquote>\n<p>Some of the things I think I think, I find don’t make any sense when I start trying to write them down. You ought to be able to explain why you’re taking the job you’re taking, why you’re making the investment you’re making, or whatever it may be. And if it can’t stand applying pencil to paper, you’d better think it through some more.</p>\n</blockquote>\n<p>Lastly, exposing writing to others will question your intent and thought process. There is no better way to get feedback. The more you share, the more feedback you'll receive creating a feedback loop.</p>\n<p>As the saying goes, the pen is mightier than the sword.</p>\n<h4>How to make writing less taxing?</h4>\n<p>Writing takes cognitive load which can sometimes introduce writer's block. In order to prevent this negative sentiment, following certain tricks can help us navigate the grey cloud. Writing can be less taxing if you go after incremental wins.</p>\n<ul>\n<li>\n<p>First, use radically simple sentences and do not worry about grammatical syntax. The goal is to pen down whatever comes to your mind. For example, start with what you know on capitalism.</p>\n<ul>\n<li>\"Capitalism is a free market. Capitalism is an economic system. America is built on capitalism.\"</li>\n</ul>\n</li>\n<li>\n<p>Second, pretend you are writing a letter to someone either asking questions or explaining what you know. You should choose a person who you admire the most and pretend you are writing directly to them and having a conversation. This will bring forth your natural flow and tone. Writing this way will also raise questions which will make it easy to gather information when you start researching more. For example,</p>\n<ul>\n<li>\"Dear Buffett &#x26; Munger, I want to explore what capitalism is and the implications of the economic system on our society today. I understand capitalism is not perfect but is it the only system that works the best out of all the options available? If that is true, then how is China prospering built on socialist economic system?\" </li>\n<li>\"Let me explain you how did capitalism came about.\"</li>\n</ul>\n</li>\n<li>\n<p>Third, do not worry about polishing or editing your material just yet. Keep going!</p>\n</li>\n<li>\n<p>Fourth, do not worry about the length of your piece. The goal is to write down everything you know and fill in the gaps by reading and researching more.</p>\n</li>\n</ul>\n<h4>Singular purpose</h4>\n<p>You must define your purpose for writing. For example, I want to understand capitalism. This purpose becomes the center of the universe when exploring and writing on the topic. </p>\n<p>You should let go of sentences or ideas that has nothing to do with the topic. Vagueness causes confusion! To create a bond with a reader, you need to stay ultra-focused on your purpose otherwise it will break the bond. If you start to diverge from the original topic, it is time to rethink about the purpose.</p>\n<p>For brevity, try to have one purpose for each sentence. But don't overkill on making your sentences so pure that they are boring or too dry to read. Narrative is as important as purpose to capture reader's attention. I'll address stylistic choices later for more fluid narrative. However, each sentence, paragraph and the essay should relentlessly focus on only one purpose.</p>\n<p><strong>Use ultra-focused titles to help you stay focused on your purpose.</strong> Titles are important. If anytime you feel diverged, titles can be a good reminder for your purpose. Using something like ”Economic Systems &#x26; Free Society” can be dangerous because it does not allow a reader to understand the purpose of your writing. The title is so vague here. It is impossible to tell which type of systems or which society. A better title could be ”Capitalism and its role in America.” This will draw readers who are interested in understanding capitalism and its role in American economy. It is clear and concise.</p>\n<p><strong>Stay cautious with purpose.</strong> How about when writing to explore? This could be complicated because there are circumstances when you have to explore beyond the boundaries of your purpose. You may be exploring topic A and B. But the topic B does not fit into topic A. This creates uncertainty and does not allow for singular purpose. During this emotional roller coaster, you may feel your exploration on topic B is a wasted effort since it does not tie into topic A. These doubts must be resisted because now you have a better understanding of a topic from different viewpoints. Perhaps, a better alternative is to review your purpose again.</p>\n<h4>Information gathering</h4>\n<p>How to gather information on a topic you are about to write on?</p>\n<ul>\n<li>First, use your experience and imagination to write. The latter is always great for story telling which captures the reader's attention. Use your experiences by sharing a story. Go back to a moment when you were star struck. Share those experiences if they are relevant to your topic.</li>\n<li>Second, use first principles approach to find the universal laws of your topic. Reasoning from first principles will get you the most basic and foundational facts, and removes the impurity of assumptions and biases. The idea is to break down complicated problems into basic elements and then reassemble them from the ground up. Therefore, as a writer, it should be your obligation to keep trying until  you get to the bottom of your topic.</li>\n<li>Third, what is the inverse of topic you are exploring? Always invert because this will prevent you from being blind-sided with one opinion. Great thinkers and writers do this really well! For example, inversion of \"what are the advantages of capitalism?\" looks like \"what are the disadvantages of capitalism?\"</li>\n<li>Fourth, use multi-disciplinary approach to find how the topic is relevant in other fields. This can be simply by googling, \"What is the relevance of X in the field ABC?\" For example, \"How adaptive system such as survival of the fittest in biology and capitalism in economics are related to each other?\"</li>\n<li>Fifth, run short experiments and tests by stress testing a set of data to derive a conclusion from the study. Running a short study should give you a direction on where to take your research. You should gather facts from credible resources that your tests align with other large studies. Remember, you are not a data analyst so don't spiral yourself into analysis paralysis. This step is to ensure that you have done your homework. Relying on other academic research should be sufficient.</li>\n</ul>\n<p>At this point, you may also feel you are running out of ideas. So, what do you do when ideas stop flowing?</p>\n<ul>\n<li>\n<p>Sixth, the simplest answer is to read and research more. If you can't brain dump your ideas then there is nothing to share. In such a situation, don't pride yourself with \"know it all\" or coming up with excuses such as \"writer's block.\" Instead, go to a local library to research more. And ask your local librarian for book recommendations on the topic you are writing about.</p>\n<ol>\n<li>\n<p>Questions to ask to keep moving forward. Ask yourself two key questions to continue exploring and researching further:</p>\n<ul>\n<li>What are key <em>supporting points</em> for **your argument?</li>\n<li>What are key <em>inversion points</em> for your topic?</li>\n<li>\n<p>In our case of exploring capitalism: </p>\n<ul>\n<li>State why capitalism is given such importance in western world? Supporting point</li>\n<li>Explore why capitalism is not working today for middle class. Supporting point</li>\n<li>Predict how America would be different without capitalism. Inversion point</li>\n<li>Explore the biases found in 1% of wealthy population to continue supporting capitalism. Supporting point</li>\n<li>State why China's system is prosperous today? Inversion point</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Once you state these key points, gather 5-10 publications and books and start taking notes.</p>\n<ul>\n<li>\n<p>Book1 , Book 2, Book 3, etc.</p>\n<ul>\n<li>Notes1, Notes2, Notes3, etc.</li>\n</ul>\n</li>\n<li>\n<p>Publication 1, Publication2, etc.</p>\n<ul>\n<li>Notes1, Notes2, etc.</li>\n</ul>\n</li>\n<li>A note on taking notes</li>\n</ul>\n</li>\n</ol>\n<p><strong>A note on note taking.</strong> Highlighting is overrated. Instead, practice learning mindfully. How? Summarize each section of your publication or each chapter of your book. This step of exploring really enables you to apply rigor to understanding what you have just read. By doing this, you put your brain to work which will help you remember and expand your memory. Always read with a pen or pencil so you can take notes right away. Putting this aside will only make you push the can further down the road. These are all good mental hygiene practices.</p>\n<p>If you don't understand something, re-read those sentences again, but slowly and deeply. As you read, ask yourself: <em>What does the author mean here? What were his intentions? What is the key point the author is trying to convey?</em> Scribble away in margins as you answer these questions. This is called critical thinking by asking rigorous questions. Only by picking sentences, paragraphs, pages, and chapters apart you can learn how writer's intentions.</p>\n</li>\n</ul>\n<h4>Outlining</h4>\n<p>By now, you should have gathered enough material to write on. Create a skeleton of your essay by outlining your key topics. An outline gives form and structure to your essay. Below is an example of outline for \"what is capitalism?\"</p>\n<ul>\n<li>\n<p>Topic: What is capitalism?</p>\n<ul>\n<li>Definitions from different sources</li>\n<li>Are there any variations of capitalism found?</li>\n</ul>\n</li>\n<li>\n<p>History</p>\n<ul>\n<li>Where did it origin from?</li>\n<li>When did capitalism develop?</li>\n<li>What were the early days?</li>\n<li>How has it evolved?</li>\n</ul>\n</li>\n<li>\n<p>Multi-disciplinary approach to link concepts together</p>\n<ul>\n<li>Darwinian evolutionary theory</li>\n<li>Laissez faire</li>\n</ul>\n</li>\n<li>\n<p>Why capitalism?</p>\n<ul>\n<li>\n<p>What are the advantages and disadvantages of capitalism?</p>\n<ul>\n<li>\n<p>What are the shortcomings of capitalism?</p>\n<ul>\n<li>Unequal distribution</li>\n<li>Pollution and other externalized costs</li>\n</ul>\n</li>\n<li>\n<p>What are major achievements found in capitalistic economies?</p>\n<ul>\n<li>Wealth generation</li>\n<li>Technological advancement</li>\n<li>Personal freedom</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Private sector and public sector roles in capitalism</li>\n</ul>\n</li>\n<li>\n<p>What are other alternatives and their consequences?</p>\n<ul>\n<li>Fascism</li>\n<li>Communism</li>\n<li>\n<p>Socialism</p>\n<ul>\n<li>\n<p>How has socialism played out in modern economics?</p>\n<ul>\n<li>China (prosperous)</li>\n<li>Venezuela (decline)</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Future enhancements to capitalism</p>\n<ul>\n<li>Is capitalism our best option available for economic prosperity?</li>\n<li>\n<p>Can capitalism uplift all or the weakest will always suffer?</p>\n<ul>\n<li>What are some moral issues associated with capitalism?</li>\n</ul>\n</li>\n<li>An opinion on few things we can enhance within the system.</li>\n</ul>\n</li>\n<li>Conclusion</li>\n<li>Sources &#x26; Bibliography</li>\n</ul>\n<p>Once you have listed all topics, take a moment to examine your outline. Ask yourself, what is still needed to convincingly and logically tie your points together?</p>\n<h4>First draft</h4>\n<p>Once you feel confident about your well thought out outline, you can fill out sentences for each outline heading. Write sentences per outline heading to complete your paragraph. Do not follow any prescribed length for number of sentences here. Use your notes that you gathered during the information gathering.</p>\n<p>Don’t worry too much about how well you are writing at this point including grammar, form or voice. Think of your essay writing process as manyfold. The purpose of the first draft is to produce paragraphs quick and dirty using your notes. Continue filling out the outline headings until you feel you have covered all key supporting points. You have finished your first draft production stage.</p>\n<h4>Second draft (revise for clarity)</h4>\n<p>Remember in school, you were asked to write a 10 page essay? Schools actually do disservice to students. Classroom instructors force students to go on a tangent by going at maximum length to explain a topic. Students would be forced to think if instructors demanded their students to explain US Constitution in no more than two pages. The primary reason to write an essay is to formulate and organize informed and logical set of ideas about something important. However, it is not to test whether a student can write a 10 page essay on a given topic.</p>\n<p>Brevity is the ultimate soul of wit. Use fewer words and simple sentences because readers have no tolerance for rambling. Use fewer ideas per sentence. A paragraph should present a single idea, using multiple sentences. Make your point and get out of their way. Say something once, why say it again? A good writing convey purpose with clarity. </p>\n<p>But it is the hardest task to achieve. Coaching and constant practice can minimize and manage the problem, but never quite eliminate it. As Mark Twain said, “You can straighten a worm, but the crook is in him and only waiting.”</p>\n<p>Occam's razor applies not just to science but also to writing. Given two paragraphs which convey almost the same meaning, the shorter paragraph is always better.</p>\n<p>Once you feel comfortable with your content, it is time to revise by cutting, rewriting and removing cliches. Repeat the process until clearest statements are achieved.</p>\n<ul>\n<li>Cut</li>\n</ul>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"14 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}