{"data":{"markdownRemark":{"html":"<h2>Work in Progress</h2>\n<details>\n  <summary><strong>Table of Contents</strong></summary>\n  <br>\n<ol>\n<li>Introduction — why write?</li>\n<li>Making writing less taxing</li>\n<li>\n<p>Singular purpose </p>\n<ol>\n<li>Use titles to stay focused</li>\n</ol>\n</li>\n<li>Clarity</li>\n<li>\n<p>Revise</p>\n<ol>\n<li>Avoid first person (me, I)</li>\n<li>Avoid passive voice</li>\n<li>Use caution with adverbs</li>\n<li>Punctuation</li>\n<li>Feltre Notes</li>\n<li>Bibliography</li>\n</ol>\n</li>\n<li>Style usage</li>\n<li>Structure</li>\n<li>\n<p>Giant shoulders</p>\n<ol>\n<li>Great writers</li>\n<li>Great books</li>\n</ol>\n</li>\n<li>Conclusion</li>\n<li>\n<p>Notes &#x26; Sources</p>\n</details>\n<br>\n</li>\n</ol>\n<p>The underlying motivation for this piece stemmed from reading a ton. Some time ago, I started reading a lot which led to fiddling with lots of ideas. However, none of these ideas were concrete. I couldn't connect them to its origin and articulate them well. Writing became the next natural step of progression. The question I keep bumping into, ”how to write well?” Here is my attempt to answer that!</p>\n<h4>Introduction — Why Write?</h4>\n<p>Writing is an investigative tool to explore our thinking. Writing explores questions we are seeking answers to. Writing broadens our mind by turning abstraction (intuition and ideas) into concrete (words). Writing extends memory and clarifies thinking. Writing helps you win! How? The person who can best formulate ideas and communicate the best argument wins. Writing helps you sharpen your capacity to think, debate and present intelligently. Writing preserves truth and allows you to have profound and original ideas at your fingertip. It prevents you from falling prey to fads and ideologies.</p>\n<p>Furthermore, the further up the ladder of competence you climb, with your well-formulated thoughts, the more important thinking and communicating become. At the very top of the most complex hierarchies (law, medicine, academia, business, theology, politics) nothing is more necessary and valuable. If you can think and communicate, you can also defend yourself, and your friends and family, when that becomes necessary, and it will become necessary at various points in your life. Finally, it is useful to note that your mind is organized verbally, at the highest and most abstract levels. Thus, if you learn to think, through writing, then you will develop a well- organized, efficient mind – and one that is well-founded and certain. This also means that you will be healthier, mentally and physically, as lack of clarity and ignorance means unnecessary stress. Unnecessary stress makes your body react more to what could otherwise be treated as trivial affairs. This makes for excess energy expenditure, and more rapid aging (along with all the negative health-related consequences of aging). — Jordan Peterson</p>\n<p>Exposing writing to others will question your intent and thought process. There is no better way to get feedback. The more you share, the more feedback you'll receive. A form of learning with positive feedback loop.</p>\n<p>We are full of fuzzy ideas that are strongly supported by our intuition. However, intuition isn't a tool. It is a gut feeling. It is a fuel that supports our biased decision making process. Turning intuition into tools means understanding their origin, limits and how they interact with other ideas. The tool available on hand is called writing.  So why use such a tool? Turning ideas into words supported by logical thinking will crystallize ideas. Putting ideas on paper is the most organized way of organizing them in one place. Writing allows us to think about ideas more rationally and deliberately question its origin and limitation. Writing allows us to remove distractions. Writing can help us understand a topic clearly which then can help us narrate well. Writing is just another form of art. It requires deep and clear thinking.</p>\n<blockquote>\n<p>Warren Buffett once said: \"Some of the things I think I think, I find don’t make any sense when I start trying to write them down. You ought to be able to explain why you’re taking the job you’re taking, why you’re making the investment you’re making, or whatever it may be. And if it can’t stand applying pencil to paper, you’d better think it through some more.\"</p>\n</blockquote>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"4 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}