{"data":{"markdownRemark":{"html":"<h2>I. Law of Productivity</h2>\n<p><em>Time Spent = Deliberate Practice</em></p>\n<p><em>High-Quality Work Produced = Time Spent x Intensity of Focus</em></p>\n<h2>II. Solving big problems</h2>\n<p>Break down problems into smaller problems. Supply X number of inputs for one set of smaller problem. Aptitude is different than knowledge. Knowledge can be taught but learning how to think (aptitude) can take a work of work to overcome. </p>\n<h2>III. Dilberate practice</h2>\n<ul>\n<li>Step 1: active learning, always opt for active (read physical books) form of learning as opposed to passive (listen to audible) form of learning</li>\n<li>Step 2: Focused mode: pomodoro chunking with diffused mode: exercise, mental exercise and break in between</li>\n<li>\n<p>Step 3: Feynman Technique: There are four simple steps:</p>\n<ul>\n<li>choose a concept and think very hard with repetitive review</li>\n<li>teach it to a toddler (teach to deepen your learning concepts and sharing will catch a blind spots and errors is to brainstorm and work with others who are smartly focused on the topic)</li>\n<li>identify gaps and go back to the source material</li>\n<li>review and simplify</li>\n</ul>\n</li>\n<li>Step 4: spaced repetition to move from working memory to long term and  recall - index cards for retrieval</li>\n<li>Step 5: visual metaphors or analogy to map images to learning or analogies like Syria with cereal</li>\n<li>Step 6: memory palace technique to map physical locations like home to learning concepts</li>\n<li>Step 7: mnemonics to remember list</li>\n<li>Step 8: multi-disciplinary approach to transfer of knowledge from one discipline and applying it to another</li>\n<li>Step 9: analytical lens - do not trust assertions and arguments which constitutes the teacher's message without analyzing. Know what author's incentives are. Be a demanding student and an inspectional reader to make up your mind on where you stand</li>\n<li>Step 10: Test, use scoring system to evaluate yourself. Understanding does not mean expertise. Test, Review and Revise</li>\n</ul>\n<h2>IV. Einstellung</h2>\n<p>Einstellung is an enemy of creativity. Don’t get hung up on your intuition and old ideas. Step 3.2 and 3.3 abover will also deepen your creativity.</p>\n<h2>V. Chemicals Imbalances</h2>\n<p>We all experience chemical imbalances if we work too much or not exercise or not spend time with loved ones. How to fix chemical imbalances or get back in the flow?</p>\n<ul>\n<li>Cortisol: presence of stress; follow the tips below</li>\n<li>\n<p>Endorphins: exercise</p>\n<ul>\n<li>It’ll help you power through a dreadful task after working out. This works for two reasons. First, the endorphin rush just feels great. You’re more tolerant of pain. Second, since you have recently completed a “challenging activity”, your mind is more readily willing to predict that you’ll complete another.</li>\n</ul>\n</li>\n<li>\n<p>Dopamine: complete a task by using music and/or coffee</p>\n<ul>\n<li>Use a particular playlist you use when you need energy. These are songs that you love but don’t listen to frequently.</li>\n<li>Use the right amount of coffee will put ypu in a great mood. Too much and you will get jittery. Experiment and find what works for you.</li>\n</ul>\n</li>\n<li>Serotonin: help others without expecting anything in return</li>\n<li>Oxytocin: spend time with loved ones</li>\n</ul>\n<hr>\n<p><strong>Notes</strong></p>\n<ul>\n<li>\n<p>Notes from Coursera course <a href=\"https://www.coursera.org/learn/learning-how-to-learn\">Learning How To Learn</a></p>\n<ul>\n<li>Tools: Chunking - Pomodoro, Space Repitition Ankii, Visual Memory System - Inedex Cards, Memory Palace Techniques, Visual Metaphors or Analogy (ex: Syria like cereal) Exercise far effective than any drug, Test Checklist, Sleeping, Breathing, Optimism - turning a negative situation into positive helps you relieve stress, Will Power and Focused Instrumental Music.</li>\n<li>Focused Mode &#x26; Diffused Mode (breaks/exercise, sleeping washes away metabolic toxins). Use pomodora technique and chunking for focused, non-distracted learning.</li>\n<li>Chunking helps you with practice and repitition. Learning little by little, small chunks can become larger and gradually will help you become a master of the material. When wanting to learn something new break it down to atomic steps to learn by chunking each step. Chunks are best built with focused, undivided attention, understanding of the basic idea.</li>\n<li>Space Repitition technique to move from Working Memory to Longterm Memory Storage Warehouse.</li>\n<li>Teach others in Leyman's words. Learning with others is a form of active learning.</li>\n<li>Law of Serendipity/Deliberate Practice: lady luck favors the one who deliberately practices. Focusing on more difficult tasks as opposed to easy tasks. Work deliberately hard!</li>\n<li>Eistellung is an enemy of creativity. Einstellung is when your initial thought, an idea you've already had in mind, or a neural pattern you've already developed well and strengthened, prevents a better idea or solution from being found. Or keeps you from being flexible enough to accept new, better, or more appropriate solutions. You have to unlearn your erroneous older ideas or approaches even while you're learning new ones. Number 7 helps you build intuition but be wary of making you from being creative. Einstellung, the idea you are already holding in mind can block you from fresh thoughts.</li>\n<li>Multi-disciplinary approach: Interleaving- Interleaving is a process where one mix, or interleave, multiple subjects or topics while they study. Transfer- transfer of knowledge or learning refers to learning in one context and applying it to another. Procedural learning by doing many different types of problems you’ll find that you understand both why and how, it will help build your intuition. Fresh ideas will help you with independent thinking.</li>\n<li>Recalling: Simple recall, trying to remember the key points without looking at the page, is one of the best ways to help the chunking process along. Visual System Memory System, image helps you enhance your memory and recall the concept. Memory Palace Technique is a powerful way of grouping things you want to remember like the layout of your house and using it as a notepad where you want to deposit the concepts images you want to remember; the more you memorize using these innovative techniques, the more creative you become because you are building these wild, unexpected possibilities.</li>\n<li>Illusions of Competence: Learn to recognize when you're fooling yourself about whether you're actually learning the material. Mini testing, Minimize highlighting, Mistakes are good, Use deliberate practice. Working memory has only 4 slots. Glancing, reading passively or highlighting too much is an illusional learning. One of the best ways to catch a blind spots and errors is to brainstorm and work with others who are smartly focused on the topic.</li>\n<li>Habit building includes four steps - cue (notification), routine (chain habits daily log), reward (incentives and celebrate), belief (hope).</li>\n<li>Product vs Process - when learning something new it is okay to start with a few negative feelings about beginning a learning session. Use pomodoro to push yourself. Learn to focus on process not product. Process means, the flow of time and the habits and actions. Start with hard start and then jump into easy.</li>\n<li>Quitting your day is as important as planning your day. Think of diffuse mode.</li>\n<li>Will Power is more important than time. It is limited and most abundant in the morning. To get started use focused instrumental music.</li>\n</ul>\n</li>\n<li>\n<p>I. RENAISSANCE LEARNING &#x26; UNLOCKING YOUR POTENTIAL II</p>\n</li>\n</ul>\n<p>The value of teamwork\nWe also don't want to throw the baby out with the bath water, and ignore worthwhile research that gives intriguing hints about differences between the two hemispheres of the brain.\nThere's a great deal of evidence from research that the right hemisphere helps us step back and put our work into big picture perspective. People with damage to the right hemisphere are often unable to gain ah-ha, insights.\nThe right hemisphere, as it turns out, is vitally important in getting into the right track and doing reality checks. People with strokes can remind us of the dangers of not using our full cognitive abilities, which involve many areas of our brain.\nAs leading neuroscientist Vilayanur S Ramachandran has noted, the right hemisphere serves as a sort of devil's advocate to question the status quo and look for global inconsistencies.\nWhile the left hemisphere instead tries to cling tenaciously to the way things were. This echos the pioneering work of psychologist Michael Gazzaniga who posited that the left hemisphere interprets the world for us and will go to great lengths to keep those interpretations unchanging.\nWhen you work in the focus mode, it's easy to make minor mistakes in your assumptions or calculations. If you go off track early on, it doesn't matter if the rest of your work is correct. But these non-sensical results just don't matter to you because the more left centered focus mode has associated with it a desire to cling to what you've done. That's the problem with the focus, sometimes a bit left hemisphere leaning mode of analysis. It provides for an analytical and upbeat approach, but abundant research evidence suggests there's a potential for rigidity, dogmatism, and egocentricity.\nNobel Prize winning physicist Richard Feynman perhaps said it best when he pointed out, the first principle is that you must not fool yourself. And you are the easiest person to fool.\nOne of the best ways to catch your blind spots and errors is to brainstorm and work with others who are also smartly focused on the topic. It's sometimes just not enough to use more of your own neural horsepower. Both modes and hemispheres to analyze your work. After all, everyone has blind spots. You're naively upbeat focused mode can still skip right over errors, especially if you're the one who committed the original errors.\nBy making it a point to do some of your studying with friends, you can more easily catch where your thinking has gone astray. Friends and teammates can serve as sort of ever questioning larger scale diffuse mode outside your brain that can catch what you missed, or what you just can't see. And of course, explaining to friends helps build your own understanding. The importance of working with others doesn't just relate to learning. It's also important in career building. A single small tip from a teammate to take a course from the outstanding Professor Passionate, or to check out a new job opening, can make an extraordinary difference in how your life unfolds.\nA word of warning, however. Study groups can be powerfully effective for learning, but if study sessions turn into socializing occasions, all bets are off.\nA Test Checklist\nTesting itself is a powerful learning experience. It is fundamental.\nA list to prepare for the test. If all yes, then you are ready.\nDid you make a serious effort to understand the text? Just hunting for relevant worked-out examples doesn't count.\nDid you work with classmates on homework problems or at least check your solutions with others? Did you attempt to outline every homework problem solution before working with classmates?\nDid you participate actively in homework group discussions contributing ideas and asking questions? Did you consult with the instructor or teaching assistants when you were having trouble with something?\nDid you understand all your homework problem solutions when they were handed in? Did you ask in class for explanations of homework problem solutions that weren't clear to you? If you had a study guide, did you carefully go through it before the test and convince yourself you could do everything on it? Did you attempt to outline lots of problem solutions quickly without spending time on the Algebra in calculations?\nDid you go over the study guide and problems with class mates and quiz one another? If there was a review session before the test, did you attended and asked questions about anything you weren't sure about?\nAnd lastly, did you get a reasonable night's sleep before the test? If your answer is no, your answers to all the preceding questions may not matter.\nTaking a test is serious business. Just as fighter pilots and doctors go through checklists before takeoff and surgery. Going through your own test preparation checklist can vastly improve your chances of success. The answer to the question. How should I prepare for the test becomes clear once you've filled our Doctor Felder's checklist.\nHard Start - Jump to Easy\nThe classic way students are taught to approach tests is to tackle the easiest problems first. This is based on the idea that by the time you finish the relatively simple problems, you'll be confident in handling the more difficult.\nWhat to do? Easy problems first, or hard? The answer is to start with the hard problems but quickly jump to the easy ones.\nIt's also a valuable technique for helping you avoid Einstellung, getting stuck on the wrong approach - because you have a chance to look at the problem from differing perspectives.\nHelpful Hints for Tests\nIf you're a stressed out test taker, keep in mind that the body puts out chemicals such as cortisol when it's under stress. This can cause sweaty palms, a racing heart, a knot on the pit of your stomach.\nBut interestingly, research finds, it's how you interpret these symptoms. The story you tell yourself about why you're stressed makes all the difference. If you shift your thinking from, this test has made me afraid, to this test has got me excited to do my best. It can really improve your performance.\nAnother good tip for panicky test takers is to momentarily turn your attention to your breathing. Relax your stomach, place your hand on it, and slowly draw a deep breath. By doing this type of deep breathing, you're counteracting the fight or flight response that fuels anxiety. This calms you down. But don't just start this breathing on the day of the test. If you practice this breathing technique in the weeks before, just a minute or two here or there is all it takes. You'll slide more easily into the breathing pattern during the test. Remember, practice makes permanent. It's especially helpful deliberately moving to a deep breathing pattern in those final anxious moments before a test is handed out.\nGood worry helps provide motivation and focus, while bad worry simply wastes energy.\nThe day before a test, or tests, have a quick, final look over the materials to brush up on them. You'll need both your focus mode and diffuse mode muscles, so to speak, the next day. So you don't want to push your brain too hard. You wouldn't run a ten mile race the day before running a marathon.\nSummary\nMetaphors and analogies aren't just for art and literature. One of the best things you can do to not only remember, but more easily understand concepts in many different fields, is to create a metaphor or analogy for them. Often, the more visual, the better.\nWe've learned from Nobel Prize winner Santiago Ramon y Cajal that if you change your thoughts, you can really, truly change your life. It seems people can enhance the development of their neuronal circuits by practicing thoughts that use those neurons. Like Santiago Ramon y Cajal, you can take pride in aiming for success because of the very things that make other people say you can't do it.\nOverconfidence in your results can result from using only one mode of thinking. By making it a point to do some of your studying with friends, you can more easily catch where your thinking has gone astray.\nTaking a test is serious business, just as fighter pilots and doctors go through checklists before takeoff and surgery, going through your own test preparation checklist can vastly improve your chances of success.\nCounterintuitive strategies such as the hard start jump to easy technique, can give your brain a chance to reflect on harder challenges even as you're focusing on other more straightforward problems.\nHere are some last test taking pointers. The body puts out chemicals when it's under stress. How you interpret your body's reaction to those chemicals makes all the difference. If you shift your thinking from, this test has made me afraid, to this test has got me excited to do my best, it helps improve your performance. If you're panicked on a test, momentarily turn your attention to your breathing. Relax your stomach, place your hand on it, and slowly draw a deep breath. Your hand should move outward and your whole chest should expand like a barrel. Your mind can trick you into thinking that what you've done is correct even if it isn't. This means that whenever possible you should blink, shift your attention, and then double check your answers using a big picture perspective, asking yourself, does this really make sense? And finally, remember that not getting enough sleep the night before a test can negate any other preparation you've done.</p>","frontmatter":{"date":"03 October, 2019","path":"/blog/notes-on-deliberate-practice","title":"Notes On Deliberate Practice"},"fields":{"readingTime":{"text":"14 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}