{"data":{"site":{"siteMetadata":{"title":"The Mihir Chronicles"}},"allMarkdownRemark":{"totalCount":5,"edges":[{"node":{"html":"<ul>\n<li><a href=\"https://twitter.com/mbostock\">Mike Bostock</a>: Mike Bostock is one my favorite programmers. He is behind a data visualization library called D3. Prior to that he worked at New York Times.</li>\n<li><a href=\"https://twitter.com/NadiehBremer\">Nadieh Bremer</a>: An astronomer with a background in data science now focsing on story telling via visualizations.</li>\n<li><a href=\"https://twitter.com/chriscoyier\">Chris Coyier</a>: Chris Coyier is behind CSS Tricks, Code Pen and many other projects. He shares incredible amount of stuff on his Twitter page.</li>\n<li><a href=\"https://www.andrewng.org/\">Andrew Ng</a>: Andrew Ng has open source courses on deep learning which I have yet to take.</li>\n<li><a href=\"http://gregbrockman.com/\">Greg Brockman</a>: Greg Brockman is behind Open AI project.</li>\n<li><a href=\"http://worrydream.com/\">Bret Victr</a>: Bret Victr is just amazing! He has so much great stuff about programming and deep analysis on various topics especially on <em>inventing on principles</em>.</li>\n<li><a href=\"https://blog.codinghorror.com/\">Jeff Atwood</a>: Jeff Atwood is behind stackoverflow. Do I need to say anything more?</li>\n</ul>","id":"cec79f7c-8ed3-5f41-a19b-73caa0c4998e","frontmatter":{"title":"Code","date":"08 August, 2019","path":"/explore/code"}}},{"node":{"html":"<ul>\n<li><a href=\"http://www.berkshirehathaway.com\">Warren Buffett</a>: historical lessons on buffettology. No need to go to school. This alone will teach you how to handle finances, relationships, ethics and avoiding stupid mistakes especially greed.</li>\n<li><a href=\"https://www.jpmorganchase.com/corporate/investor-relations/annual-report-proxy.htm\">Jamie Dimon</a>: Dimon is the CEO of JP Morgan Chase. He is leading one of the largest banks in the world and has a lot to share on banking, economy and policies.</li>\n<li><a href=\"https://www.oaktreecapital.com/insights/howard-marks-memos\">Howard Marks</a>: If Warren Buffett is for equity then Howard Marks is for fixed income. Both follow the same principles but involved in managing different asset classes.</li>\n<li><a href=\"https://www.blackrock.com/corporate/investor-relations/larry-fink-chairmans-letter\">Larry Fink</a>: is the CEO of Blackrock, a largest active investing organization. Lot of wisdom in his letters.</li>\n<li><a href=\"http://1icz9g2sdfe31jz0lglwdu48.wpengine.netdna-cdn.com/wp-content/uploads/2012/09/Seth-Klarman-Baupost-Group-Letters.pdf\">Seth Klarman</a>: not much out there on Seth Klarman but this is the best resource I found.</li>\n<li><a href=\"https://ir.aboutamazon.com/annual-reports\">Jeff Bezos</a>: Amazon. Period.</li>\n<li><a href=\"https://www.csisoftware.com/category/pres-letters/\">Mark Leonard</a>: Mark Leonard, an underdog but one of the most fascinating CEOs out there who have acquired software businesses and managed to grow companies many x times.</li>\n<li><a href=\"https://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=77768\">Clifford Asness</a>: a hedge fund manager behind a very well run firm, AQR Capital.</li>\n<li><a href=\"https://www.socialcapital.com/annual-letters/\">Chamath Palihapitiya</a>: used to be a VC, helped grow facebook but now following Buffett type partnership. A lot of insight on private market and how moonshot ideas will take over.</li>\n<li><a href=\"https://www.adventur.es/annual-letters/\">Brent Beshore</a>: not a fan of private equity genrally speaking, but Brent has good intentions and has a lot to share in his letters.</li>\n</ul>","id":"57b90842-bfc6-5257-84af-5c2e874ddc8b","frontmatter":{"title":"Shareholder Letters","date":"08 August, 2019","path":"/explore/shareholder-letters"}}},{"node":{"html":"<ul>\n<li><a href=\"http://paulgraham.com/articles.html\">Paul Graham</a>: behind Y Combinator. One of the best essays I have come across on various topics but mostly how to operate.</li>\n<li><a href=\"https://www.eugenewei.com/\">Eugene Wei</a>: a great strategist with very very long form of essays. He has a way of sharing complex topics with a twist. Mostly on how modern economies such as Google, Amazon, Facebook, etc. work!</li>\n</ul>","id":"2e8f9d03-3d05-58d1-a3cf-06e77cd31adb","frontmatter":{"title":"Techies","date":"08 August, 2019","path":"/explore/techies"}}},{"node":{"html":"<ul>\n<li><a href=\"https://aswathdamodaran.blogspot.com/\">Aswath Damodaran</a>: he is a finance professor with lots of resource on how to value a company. Part of it is numbers and the other is narrative. Good luck valuing narrative!</li>\n<li><a href=\"http://michaelmauboussin.com/\">Michael J. Mauboussin</a>: another finance professor with deep essays. I like his analysis on moats.</li>\n<li><a href=\"https://www.collaborativefund.com/blog/authors/morgan/\">Morgan Housel</a>: he is such a clearer thinker and writer. I can read every piece he has written without getting bored.</li>\n<li><a href=\"http://jasonzweig.com/\">Jason Zweig</a>: a wallstreet jounalist who has reviewed intelligent investor with comments. A must read everything that Jason Zweig has to share.</li>\n<li><a href=\"https://25iq.com/\">Tren Griffin</a>: he is a great writer on various topics but especially on valuation, strategies and leadership. I need 6 months off to go over everything he has ever written.</li>\n<li><a href=\"https://stratechery.com/\">Ben Thompson</a>: an independent CFA for an independent organization who covers technology companies who have aggregate theory as their strategy.</li>\n<li><a href=\"http://investorfieldguide.com/\">Patrick O’Shaughnessy</a>: he is one of the best with one of the best podcast. A must listen!</li>\n<li><a href=\"http://abovethecrowd.com/\">Bill Gurley</a>: he is one of the best VCs who backs ideas that will take off. Many successful exits!</li>\n<li><a href=\"http://www.philosophicaleconomics.com/\">Jessie Livermore (anonymous)</a>: he blows my mind with his deep analysis on markets. The craziest part he never went to school for finance.</li>\n<li><a href=\"https://www.fooledbyrandomness.com/\">Nassim Taleb</a>: A controversial author but so much wisdom to share on risk and randomness.</li>\n<li><a href=\"http://www.econtalk.org/\">Russell Roberts</a>: a great podcast which covers economic policies.</li>\n</ul>","id":"45c2d191-7507-546f-a0a5-2c93a9859ffa","frontmatter":{"title":"Valuation & Investing","date":"08 August, 2019","path":"/explore/valuation-investing"}}},{"node":{"html":"<ul>\n<li><a href=\"https://www.vulture.com/2018/11/jerry-saltz-how-to-be-an-artist.html\">How to be an artist</a>: Jerry Saltz is a Pulitzer prize winner for art criticism. Here he shares his thoughts on creativity and how to be an artist.</li>\n<li><a href=\"http://blog.samaltman.com/productivity\">Productivity</a>: Sam Altman shares his thoughts on optimizing productivity. What hit home for me was just like how money compounds, making incremental productivity hacks can also compound. Sleep was a big one! I no longer preach \"sleep when I die\" attitude. It is actually completely opposite today. If I don't get enough sleep, my body really feels the pain.</li>\n<li><a href=\"https://meaningness.com/geeks-mops-sociopaths\">Geeks, mops and sociopaths</a>: this one was fascinating about how things take off and the role geeks, mops and sociopaths play a role. This can be applied to so many things, especially the digital coin trend.</li>\n<li><a href=\"https://www.edge.org/conversation/yuval_noah_harari-daniel_kahneman-death-is-optional\">Death is optional</a>: I am a huge fan of Yuval and his work on Homo Sapiens. And there is no one better than Daniel Kahneman to lead the discussion on access to medicine and how society will play a role. Sad to say, it does not surprise me there will be inequality in health care just how we are facing income inequality today.</li>\n<li><a href=\"https://www.newyorker.com/magazine/2009/06/01/the-cost-conundrum\">The cost conundrum</a>: Atul Gawande does an exceptional job explaining how healthcare cost varies in two seprate towns in Texas for the same treatment. A long but worth the read to understand the industry.</li>\n<li><a href=\"https://kk.org/thetechnium/1000-true-fans/\">1000 true fans</a>: no more chasing millions and 20x growth rate because a creator's job is to find the true fans. Let's start with finding 1000 true fans.</li>\n<li><a href=\"http://www.issendai.com/psychology/sick-systems.html\">Sick systems</a>: this is deep and I still haven't had a chance to fully analyze this piece. But there is so much validity to how system of keeping someone forever works in professional world.</li>\n<li><a href=\"http://augmentingcognition.com/ltm.html\">LTM</a>: I have a personal fascination with long term memory and I still haven't crack the code but I am a huge believer in space repition and its benefits. Michael Nielsen does a great job covering space repition techniques using the tool called Anki.</li>\n<li><a href=\"https://jamesclear.com/luck-vs-hard-work\">Luck vs hard work</a>: can't get any simpler than the title itself. A great piece on luck vs hard work.</li>\n<li><a href=\"http://blakemasters.com/peter-thiels-cs183-startup\">Peter Thiel cs183 essays</a>: Peter Thiel is one of the most outcry and an independent thinker. These notes capture his wisdom he shared during one of the CS183 lecture on startups. </li>\n<li><a href=\"https://theamericanscholar.org/solitude-and-leadership/#.XU5OtJNKifU\">Solitude and leadership</a>: leadership is solitude and solitude is leadership. Be able to think for yourself is one of the most underrated skill. This is how leaders our born!</li>\n<li><a href=\"https://www.albertbridgecapital.com/drew-views/2019/6/17/stay-in-the-game\">Stay in the game</a>: this one is emotional and hit home for me. We all have demons but Max had demons which were beyond his control. He stayed in the game and kept battling. A must read!</li>\n</ul>","id":"86be6227-bf56-54e0-8e7a-5bdf5ed3e437","frontmatter":{"title":"Articles","date":"08 August, 2019","path":"/explore/articles"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}