{"data":{"markdownRemark":{"html":"<h4>[I. Brief Summary]</h4>\n<ul>\n<li>Ed Catmull, President of Pixar Animation and Disney Animation shares a memoir which focuses on how companies can build competitive and creative forces for decades to come and outlast existing management. Focusing themes of the book are managing creativity, fostering a creative culture at work, and the challenges of stepping into a leadership role.</li>\n</ul>\n<h4>[II. Big Ideas]</h4>\n<ul>\n<li>Ed Catmull loved animation and had done some ground breaking work in the 3D and animation world. The foundational work was done in the 60s and 70s. </li>\n<li>Catmull went to work for George Lucas at Lucasfilm to head up their new computer division.</li>\n<li>Pixar initially began as a hardware company. </li>\n<li>“Braintrust,” a group who’s most important characteristic was “the ability to analyze the emotional beats of a movie without any of its members themselves getting emotional or defensive.”</li>\n<li>It was the Braintrust that saved Toy Story 2. Catmull has this takeaway: “Getting the team right is the necessary precursor to getting the ideas rights…Getting the right people and the right chemistry is more important than getting the right idea.” </li>\n<li>If people in an organization don’t trust one another, they will never speak their minds openly. They end up agreeing with whatever the boss says. People are genuinely afraid to say what they think for fear of offending someone.</li>\n<li>If we never fail and make mistakes, we will never grow. The issue for us is that we must bring ourselves to a point of looking past our failures to see what can be done through our failures. </li>\n</ul>\n<h4>[III. Quotes]</h4>\n<ul>\n<li>\"Failure isn't a necessary evil. In fact, it isn't even at all. It is a necessary consequence of doing something new.\"</li>\n<li>\"It’s not the manager’s job to prevent risks. It’s the manager’s job to make it safe for others to take them.\"</li>\n<li>\"Unleashing creativity requires that we loosen the controls, accept risk, trust our colleagues, work to clear the path for them, and pay attention to anything that creates fear.\"</li>\n<li>\"When faced with a challenge, get smarter…I have met people who took what seemed the safer path and were the lesser for it…Always take a chance on better, even if it seems threatening.\"</li>\n<li>\"You don’t have to ask permission to take responsibility.\"</li>\n<li>\"To ensure quality, then, excellence must be an earned word, attributed by others to us, not proclaimed by us about ourselves.\"</li>\n<li>\"…societal conditioning discourages telling the truth to those perceived to be in higher positions.\"</li>\n<li>\"Failure is painful, and our feelings about this pain tend to screw up our understanding of its worth.\"</li>\n<li>\"How do we face our failures without fear?\"</li>\n<li>\"Self-interest guides opposition to change…Once you master any system, you typically become blind to its flaws; even if you can see them, they appear far too complex and intertwined to consider changing.\"</li>\n</ul>","frontmatter":{"date":"28 July, 2019","path":"/bookshelf/creativity-inc","title":"Creativity Inc by Ed Catmull"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}