{"data":{"markdownRemark":{"html":"<h1>Work in Progress</h1>\n<h3>Who is a Product Manager?</h3>\n<p>A person who is responsible to set overall capability vision and direction, own the quality and delivery of products, ensure roadmap is prioritized to address market opportunities, and lead the product management discipline for the team. <em>Product Owner</em> is a role you play on a scrum team. <em>Product Manager</em> is the job.</p>\n<blockquote>\n<p>A good product takes chaos and creates order. — Brian Nogard</p>\n</blockquote>\n<p>How do you set yourself up for success as a product manager? To master the art of product management requires many years of practice. The only way to learn it is to actually do it. Become a knowledge sponge, talk to external and internal product managers, read everything about the topic, copy others before you try to find your own voice and do something unique. Doing something unique is most probable after achieving mastery.</p>\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Understand the customer deeply — this means user studies, you have to go talk to the users every week and spend a lot of time with them to hear their pain, get inside their head.</li>\n<li>Be metrics driven , you should be using time series data to give you insight into what people are doing with the product and see if the changes you are making are improving things. If you haven’t instrumented the app and chosen a metric you want to improve, you are just guessing.</li>\n<li>The product manager is responsible for prioritizing the product roadmap and communicating it to the team. Not as a top down dictator, but as a consensus builder amongst all the stakeholders, breaking a tie when necessary.</li>\n<li>You need to be a communication hub, both when building consensus internally on priorities/roadmap, but also externally communicating changes to customers. Users need to see that the product is continually improving by hearing about it from you. Everyone internally needs to be on the same page when changes roll out. You are the point of contact for all things related to this product.</li>\n<li>Once you master all of that, you will need to develop product vision (conviction about where things are going in the future, make the hard calls about what to eliminate, etc) and strive to make something truly great. You can think about it not just as eliminating customer pain, but actually creating customer delight. In rare instances, you can wind up creating something that people actually love. (very few products attain this — nobody says they love Tide detergent, but people do say they love their Harley Davidson),</li>\n</ul>\n<h2>Product Roadmap</h2>\n<h2>Technical Requirements</h2>\n<h2>Design Requirements</h2>\n<h2>Business Development</h2>\n<h2>People Management</h2>\n<h2>Resources</h2>\n<h3>Sources</h3>\n<ul>\n<li><a href=\"https://blog.coinbase.com/a-letter-to-a-new-product-manager-d5d96c228bf4\">A Letter To A New Product Manager by Brian Armstrong</a></li>\n</ul>","frontmatter":{"date":"04 March, 2020","path":"/blog/on-product-management","title":"On Product Management"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}