{"data":{"markdownRemark":{"html":"<h2>I. Law of Productivity</h2>\n<p><em>Time Spent = Deliberate Practice</em></p>\n<p><em>High-Quality Work Produced = Time Spent x Intensity of Focus</em></p>\n<h2>II. Solving big problems</h2>\n<p>Break down problems into smaller problems. Supply X number of inputs for one set of smaller problem. Aptitude is different than knowledge. Knowledge can be taught but learning how to think (aptitude) can take a work of work to overcome. </p>\n<h2>III. Dilberate practice</h2>\n<ul>\n<li>Step 1: active learning, always opt for active (read physical books) form of learning as opposed to passive (listen to audible) form of learning</li>\n<li>Step 2: Focused mode: pomodoro chunking with diffused mode: exercise, mental exercise and break in between</li>\n<li>\n<p>Step 3: Feynman Technique: There are four simple steps:</p>\n<ul>\n<li>choose a concept and think very hard with repetitive review</li>\n<li>teach it to a toddler (teach to deepen your learning concepts and sharing will catch a blind spots and errors is to brainstorm and work with others who are smartly focused on the topic)</li>\n<li>identify gaps and go back to the source material</li>\n<li>review and simplify</li>\n</ul>\n</li>\n<li>Step 4: spaced repetition to move from working memory to long term and  recall - index cards for retrieval</li>\n<li>Step 5: visual metaphors or analogy to map images to learning or analogies like Syria with cereal</li>\n<li>Step 6: memory palace technique to map physical locations like home to learning concepts</li>\n<li>Step 7: mnemonics to remember list</li>\n<li>Step 8: multi-disciplinary approach to transfer of knowledge from one discipline and applying it to another</li>\n<li>Step 9: analytical lens - do not trust assertions and arguments which constitutes the teacher's message without analyzing. Know what author's incentives are. Be a demanding student and an inspectional reader to make up your mind on where you stand.</li>\n<li>Step 10: Test, use scoring system to evaluate yourself. Understanding does not mean expertise. Test, Review and Revise.</li>\n</ul>","frontmatter":{"date":"03 October, 2019","path":"/blog/notes-on-deliberate-practice","title":"Notes On Deliberate Practice"},"fields":{"readingTime":{"text":"2 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}