{"data":{"markdownRemark":{"html":"<p>Work in progress.</p>\n<p>As I enter the fourth decade of my time on this planet, I am no longer planning the upcoming months or years but rather thinking in decades. This helps me orient myself into working towards long-term outcomes, shifting my mindset towards mastery and steering away from distractions. This also sets a sense of urgency on how to spend time because there are only handful of decades left now.</p>\n<p>Thinking forward is good but thinking backward is as important! Last decade was spent on exploring and wandering. </p>\n<h4>Ignorance</h4>\n<p>Many view ignorance as negative, but in my opinion, ignorance can serve well if used towards the right things. This is mostly due to ego not in check. I have been rebellious my entire life. I didn't have a corporate job after college because I thought I could run a company. I also traveled to few places after graduating college. Not because I was smart, but I was ignorant about lot of things and how things operated in real world. Starting a company is hard, keeping it alive is even harder. The latter could only be learnt if one actually <strong>does</strong> it and <strong>is</strong> ignorant. If I already knew the limitations, I would have never tried in the first place. Being ignorant paid off for me! Learning to find strangers and working with them, bringing a project to life, and selling a product once it comes to life are the skills I would've not learned otherwise.</p>\n<p>Everyone gets a limited window in their lives to be ignorant. If I get a chance again, I would do it again because it alllowed me to wander and explore.</p>\n<h4>Exploration</h4>\n<p>Reflect back on relationships, what you learnt and things you did not.\nWhat will you do in the next decade? Mastery of any sort after exploration?\nA very long piece reflecting on everything ego, ambition, learning, growth, etc.\nSense of urgency, importance of exercise, importance of balance\nHumor\nthinking in decades make you realize your time remaining on the planet earth which makes your ego humble and work with sense of urgency. It helps you pick important things in live. On personal level, it shapes your mindset by spending time with loved ones, deepening your relationships and truly care about things that matter — love, empathy, etc.\nStaying away from fancy and shiny things</p>\n<h4>Relationships</h4>\n<h4>Humor</h4>","frontmatter":{"date":"03 August, 2019","path":"/blog/thinking-in-decades","title":"Thinking In Decades"},"fields":{"readingTime":{"text":"2 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}