{"data":{"markdownRemark":{"html":"<details>\n  <summary><strong>Table of Contents</strong></summary>\n  <br>\n<ul>\n<li>Purpose</li>\n<li>Why write?</li>\n<li>\n<p>How to make writing less taxing?</p>\n<ul>\n<li>Simple sentences</li>\n<li>Pretending you are writing it to someone</li>\n<li>Do not edit</li>\n<li>Do not worry about the length</li>\n</ul>\n</li>\n<li>\n<p>Singular purpose</p>\n<ul>\n<li>Use titles to define your purpose</li>\n<li>Disadvantages of purpose</li>\n</ul>\n</li>\n<li>\n<p>Information gathering</p>\n<ul>\n<li>Use your imagination and experiences</li>\n<li>First principles approach</li>\n<li>Inversion</li>\n<li>Multi-disciplinary approach</li>\n<li>Short experiments</li>\n<li>\n<p>Read, research and take more notes</p>\n<ul>\n<li>Questions</li>\n<li>Books &#x26; publications</li>\n<li>A note on note taking</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Outlining</li>\n<li>First draft</li>\n<li>\n<p>Second draft</p>\n<ul>\n<li>Cutting</li>\n<li>Rewriting</li>\n<li>Avoid Clichés</li>\n<li>First person rules</li>\n<li>Avoiding passive voice</li>\n<li>Caution with adverbs</li>\n<li>\n<p>Punctuation</p>\n<ul>\n<li>Periods</li>\n<li>Commas</li>\n<li>Ellipsis</li>\n<li>Semicolons</li>\n<li>Colons</li>\n<li>Punctuation within quotation marks</li>\n<li>Punctuation within parentheses</li>\n<li>Dashes</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Final draft</p>\n<ul>\n<li>Resolutions</li>\n<li>Rhythm &#x26; Style</li>\n<li>Bibliography</li>\n</ul>\n</li>\n<li>\n<p>Getting better</p>\n<ul>\n<li>Use commonplace to dissect good writing</li>\n<li>Good writers and books</li>\n</ul>\n</li>\n<li>\n<p>Notes</p>\n</details>\n<br>\n</li>\n</ul>\n<hr>\n<h2>Purpose</h2>\n<p>The underlying motivation for the piece stemmed from reading a ton. I started reading a lot a few years ago which led to the fiddling with ideas. However, none of these ideas were concrete. I couldn't connect them to its origin and neither could I articulate them well. Writing became the next natural step of progression. Below are my notes compiled from observing others.</p>\n<h2>Why write?</h2>\n<p>Writing broadens your mind by turning abstraction such as intuition and ideas into concrete words. You are full of fuzzy ideas that are strongly supported by your intuition. However, intuition isn't a tool. It is a gut feeling. Intuition fuels your biased decision making process. Turning intuition into tools means understanding their origins, limitations and how they interact with other ideas.</p>\n<p>The tool available on hand is called writing. Why use such a tool? Writing is an investigative tool to explore your thinking.</p>\n<p>Turning ideas into words supported by logical thinking will crystallize your ideas. Writing allows you to think about ideas more rationally by deliberately questioning its origins and limitations. Writing extends memory and clarifies thinking which then can help you narrate well. Writing is another form of art which requires deep and clear thinking.</p>\n<p>Writing helps you win. How? The person who can best formulate ideas can communicate the best argument. Writing preserves truth. It allows you to have profound and original ideas at your fingertip. Writing helps you sharpen your capacity to think, debate from first principles approach, and present intelligently. Writing prevents you from falling prey to fads and ideologies. It removes distraction.</p>\n<p>The most complex hierarchies such as law, medicine, business, politics or academics require breaking down the complex theories into a simpler form. At this level of competency, you are required to communicate well by defending your strategy in business, economic policy in politics or thesis in academia research. Thus, well formulated thoughts become necessary and valuable to persuade your audience. </p>\n<p>Warren Buffett once said:</p>\n<blockquote>\n<p>Some of the things I think I think, I find don’t make any sense when I start trying to write them down. You ought to be able to explain why you’re taking the job you’re taking, why you’re making the investment you’re making, or whatever it may be. And if it can’t stand applying pencil to paper, you’d better think it through some more.</p>\n</blockquote>\n<p>Lastly, exposing writing to others will question your intent and thought process. There is no better way to get feedback. The more you write and share, the more feedback you'll receive creating a positive feedback loop. As the saying goes, the pen is mightier than the sword.</p>\n<h2>How to make writing less taxing?</h2>\n<p>Writing takes cognitive load which introduces writer's block. But it can be less taxing if you go after the incremental wins.</p>\n<ul>\n<li>\n<p>Use radically simple sentences and do not worry about grammatical syntax. The goal is to pen down whatever comes to your mind. For example, let's pick capitalism.</p>\n<p>   <em>\"Capitalism is a free market. Capitalism is an economic system. America is built on capitalism.\"</em></p>\n</li>\n<li>\n<p>Pretend you are writing a letter to someone either asking questions or explaining what you know. You should choose a person who you admire the most and pretend you are having a conversation with that person. This will bring forth your natural flow and tone. Writing this way will also raise several questions which will make it easy to gather information when you start researching more. For example:</p>\n<p>   <em>\"Dear Buffett &#x26; Munger, I want to explore what capitalism is and the implications of the economic system on our society today. I understand capitalism is not perfect but is it the only system that works the best out of all the options available? If that is true, then how is China prospering built on socialist economic system?\"</em> </p>\n<p>   <em>\"Let me explain you how did capitalism came about.\"</em></p>\n</li>\n<li>\n<p>Do not worry about polishing or editing your material just yet. Keep going!</p>\n</li>\n<li>\n<p>Do not worry about the length of your piece. The goal is to write down everything you know. Reading and research will come later.</p>\n</li>\n</ul>\n<h2>Singular purpose</h2>\n<p>You must define your purpose for writing. For example, I want to understand capitalism. This purpose becomes the center of the universe when exploring the topic. </p>\n<p>You should let go of sentences or ideas that has nothing to do with the topic. Vagueness causes confusion. To create a bond with a reader, you need to stay ultra-focused on your purpose otherwise it will break the bond. If you start diverging from the original topic, it is time to rethink about the purpose.</p>\n<p>For brevity, try to have one purpose for each sentence. But don't overkill on making your sentences so pure that they are boring or too dry to read. Narrative is as important as purpose to capture reader's attention. I'll address stylistic choices later for more fluid narrative. However, each sentence, paragraph and the essay should relentlessly focus on only one purpose.</p>\n<h3>Use ultra-focused titles to help you stay focused on your purpose</h3>\n<p>Titles are important. If anytime you feel diverged, titles can be a good reminder of your purpose. If you can't understand your topic, your reader will most likely feel the same. Using something like ”Systems, Free Society &#x26; Economy” can be dangerous because it does not allow a reader to understand the purpose of your writing. The title is so vague here. It is impossible to tell which type of systems or which free society. A better title could be ”Capitalism and its role in America.” This will draw readers who are interested in understanding capitalism and its role in American economy. It is clear and concise.</p>\n<h3>Disadvantages of purpose</h3>\n<p>What are the limitations of purpose? This could be complicated because there are circumstances when you have to explore beyond the boundaries of your purpose. You might be exploring topic A and B. But the topic B does not fit into topic A. This creates uncertainty and does not allow for singular purpose. During this emotional roller coaster, you may feel your exploration on topic B is a wasted effort since it does not tie into topic A. These doubts must be resisted because now you have a better understanding of a topic from different viewpoints. Perhaps, a better alternative is to review your purpose again.</p>\n<h2>Information gathering</h2>\n<p>How to gather information on a topic you want to write about?</p>\n<ul>\n<li>Use your experience and imagination to write. The latter is always great for story telling which captures the reader's attention. Use your experiences by sharing a story. Go back to a moment when you were star struck. Share those experiences with your readers if they are relevant to your topic.</li>\n<li>Use first principles approach to find the universal laws of your topic. Reasoning from first principles will get you the most basic and foundational facts. It will remove the impurity of assumptions and biases. The idea is to break down the complicated problems into basic elements and then reassemble them from the ground up. Therefore, as a writer, it should be your obligation to keep trying until  you get to the bottom of your topic.</li>\n<li>What is the inverse of topic you are exploring? Always invert because this will prevent you from being blind-sided with one-sided opinion. Great thinkers and writers do this really well! For example, inversion of <em>\"what are the advantages of capitalism?\"</em> can be <em>\"what are the disadvantages of capitalism?\"</em></li>\n<li>Use multi-disciplinary approach to find how the topic is relevant in other fields. This can be simply by googling, \"What is the relevance of X in the field ABC?\" For example, <em>\"How adaptive system such as survival of the fittest in biology and capitalism in economics are related to each other?\"</em></li>\n<li>Run short experiments and tests by stress testing a set of data to derive a conclusion from the study. Running a short study should give you a direction on where to take your research. You should gather data from credible resources. Keep in mind, you are not a data analyst so don't spiral yourself into analysis paralysis. This step is to ensure that you have done your homework. Relying on other academic research should also be sufficient.</li>\n</ul>\n<p>By now, you may also feel you are running out of ideas. What do you do when ideas stop flowing?</p>\n<p>The simplest answer is to read more and research more. If you can't brain dump your ideas then there is nothing to share. In such a situation, don't pride yourself with \"know it all\" or coming up with excuses such as \"writer's block.\" Instead, go to a local library to research more. Ask your local librarian for book recommendations on the topic you are writing about. Ask yourself two key questions to continue exploring and researching further:</p>\n<ul>\n<li><em>What are key supporting points for your argument?</em></li>\n<li><em>What are key inversion points for your topic?</em></li>\n</ul>\n<p>In our case on the topic of capitalism: </p>\n<ul>\n<li>Supporting point — <em>State why capitalism is given such importance in western world?</em></li>\n<li>Supporting point — <em>Explore why capitalism is not working today for middle class.</em></li>\n<li>Inversion point — <em>Predict how America would be different without capitalism.</em></li>\n<li>Supporting point — <em>Explore the biases found in 1% of wealthy population to continue supporting capitalism.</em></li>\n<li>Inversion point — <em>State why China's system is prosperous today?</em></li>\n</ul>\n<p>Once you state these key points, gather 5-10 publications and 5-10 books and start taking notes.</p>\n<ul>\n<li>\n<p>Book1 , Book 2, Book 3, etc.</p>\n<ul>\n<li>Notes1, Notes2, Notes3, etc.</li>\n</ul>\n</li>\n<li>\n<p>Publication 1, Publication2, etc.</p>\n<ul>\n<li>Notes1, Notes2, etc.</li>\n</ul>\n</li>\n</ul>\n<h3>A note on taking notes</h3>\n<p>Highlighting is overrated. Instead, practice learning mindfully. How? Summarize each section of your publication or each chapter of your book. This step of exploring really enables you to apply rigor to understanding what you have just read. By doing this, you put your brain to work which will help you remember and expand your memory. Always read with a pen or pencil so you can take notes right away. Putting this aside will only make you push the can further down the road. These are all good mental hygiene practices.</p>\n<p>If you don't understand something, re-read those sentences again, but slowly and deeply. As you read, ask yourself: <em>What does the author mean here? What were his intentions? What is the key point the author is trying to convey?</em> Scribble away in margins as you answer these questions. This is called critical thinking by asking rigorous questions. Only by picking sentences, paragraphs, pages, and chapters apart you can learn how writer's intentions.</p>\n<h2>Outlining</h2>\n<p>By now, you should have gathered enough material to move forward. Create a skeleton of your essay by outlining your key topics. An outline gives form and structure to your essay. Below is an example of an outline on capitalism:</p>\n<ul>\n<li>\n<p>Topic: What is capitalism?</p>\n<ul>\n<li>Definitions from different sources</li>\n<li>Are there any variations of capitalism found?</li>\n</ul>\n</li>\n<li>\n<p>History</p>\n<ul>\n<li>Where did it origin from?</li>\n<li>When did capitalism develop?</li>\n<li>What were the early days?</li>\n<li>How has it evolved?</li>\n</ul>\n</li>\n<li>\n<p>Multi-disciplinary approach to link concepts together</p>\n<ul>\n<li>Darwinian evolutionary theory</li>\n<li>Laissez faire</li>\n</ul>\n</li>\n<li>\n<p>Why capitalism?</p>\n<ul>\n<li>\n<p>What are the advantages and disadvantages of capitalism?</p>\n<ul>\n<li>\n<p>What are the shortcomings of capitalism?</p>\n<ul>\n<li>Unequal distribution</li>\n<li>Pollution and other externalized costs</li>\n</ul>\n</li>\n<li>\n<p>What are major achievements found in capitalistic economies?</p>\n<ul>\n<li>Wealth generation</li>\n<li>Technological advancement</li>\n<li>Personal freedom</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Private sector and public sector roles in capitalism</li>\n</ul>\n</li>\n<li>\n<p>What are other alternatives and their consequences?</p>\n<ul>\n<li>Fascism</li>\n<li>Communism</li>\n<li>\n<p>Socialism</p>\n<ul>\n<li>\n<p>How has socialism played out in modern economics?</p>\n<ul>\n<li>China (prosperous)</li>\n<li>Venezuela (decline)</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Future enhancements to capitalism</p>\n<ul>\n<li>Is capitalism our best option available for economic prosperity?</li>\n<li>\n<p>Can capitalism uplift all or the weakest will always suffer?</p>\n<ul>\n<li>What are some moral issues associated with capitalism?</li>\n</ul>\n</li>\n<li>An opinion on few things we can enhance within the system.</li>\n</ul>\n</li>\n<li>Conclusion</li>\n<li>Sources &#x26; Bibliography</li>\n</ul>\n<p>Once you have listed your key topics, take a moment to examine your outline. Ask yourself, what is still needed to convincingly and logically tie your points together? Ask yourself the two key questions we asked earlier to continue exploring and researching further:</p>\n<ul>\n<li>What are key <em>supporting points</em> for **your argument?</li>\n<li>What are key <em>inversion points</em> for your topic?</li>\n</ul>\n<h2>First draft</h2>\n<blockquote>\n<p>When you write a first draft, you write it for yourself. When you re-write it, you write it for everyone else. — Stephen King.</p>\n</blockquote>\n<p>Once you feel confident about your well thought out outline, write sentences per outline heading to complete your paragraph. Do not follow any prescribed length for the number of sentences here. Use your notes that you gathered during the information gathering. Don’t worry too much about how well you are writing at this point including grammar, form or voice. With regard to grammar, spoken language and common sense are generally better guides for a first draft than rule books. It’s more important to be understood than it is to form a grammatically perfect sentence during your first draft.</p>\n<p>And don’t worry too much about readers who want to find a way to argue about every supporting point. Just enjoy writing. Think of your writing process as multiple stages. </p>\n<p>The first stage is called the production stage. This is when you write your first draft. The purpose of the first draft is to produce paragraphs quick and dirty using your notes. Continue filling out the outline headings until you feel you have covered all key supporting points. You have now finished your production stage.</p>\n<p>The second stage is called polishing stage. This is when you edit your content. They can be broken down into many drafts addressing clarity, grammar and voice.</p>\n<h2>Second draft</h2>\n<p>Remember in school, you were asked to write a 10 page essay? Classroom instructors force students to go on a tangent by going at maximum length to explain a topic. Students would be forced to think if instructors demanded their students to explain US Constitution in no more than two pages. The primary reason to write an essay is to formulate and organize informed and logical set of ideas about something important. However, it is not to test whether a student can write a 10 page essay on a given topic.</p>\n<p>Brevity is the ultimate soul of wit. Use fewer words and simple sentences because readers have no tolerance for rambling. Use fewer ideas per sentence. A paragraph should present a single idea by using short and concise sentences.  Minimize clauses, compound sentences and transition words such as \"however\" or \"thus\" so that the reader can focus on the main message. Make your point and get out of their way. A good writing convey purpose with clarity. Occam's razor applies not just to science but also to writing. Given two paragraphs which convey almost the same meaning, the shorter paragraph is always better.</p>\n<p>But clarity is the hardest task to achieve. Coaching and constant practice can minimize and manage the problem, but never quite eliminate it. As Mark Twain said:</p>\n<blockquote>\n<p>You can straighten a worm, but the crook is in him and only waiting.</p>\n</blockquote>\n<p>Once you feel comfortable with your first draft, it is time to revise by cutting, rewriting, avoiding clichés, exceptions for first person's point of view, avoiding passive voice, using proper punctuations and being cautionary with adverbs. Repeat the process until the clearest statements are achieved.</p>\n<h3>Cutting</h3>\n<blockquote>\n<p>Anything that can be said can be said clearly. — Ludwig Wittgenstein</p>\n</blockquote>\n<p>Slice every paragraph by each sentence and place it on its own line. The purpose of this step is to analyze each sentence in its isolation to explore an opportunity to cut words out. The point of cutting your writing isn’t to make it shorter. The point of cutting it is to make it better. Below are a few examples on how to cut.</p>\n<ul>\n<li><em>Keep track of your word count before and after. This will make you realize how much verbose it was than necessary.</em></li>\n<li>*Cut, cut more and cut it again and again. When you cut your writing, you want <strong>~~to know that</strong>~~ nothing else <strong><del>is</del></strong> <strong>to</strong> get<strong><del>ting</del></strong> in.*</li>\n<li>*Use minimalism to achieve clarity. <strong><del>While you are writing, ask</del></strong> <strong>Ask</strong> yourself, is it possible to preserve the original message without that punctuation mark, <del><strong>that</strong></del> word, <del><strong>that</strong></del> sentence, <del><strong>that</strong></del> paragraph or <strong><del>that</del></strong> section? Cut extra words or commas out whenever you can.*</li>\n<li>*If you <del><strong>feel, you</strong></del> cannot cut, you are fooling yourself. <strong><del>The weather forecast calls for rainy conditions.</del></strong> It will probably rain.*</li>\n<li><del><strong>*Keep searching for sentences to kill.</strong></del>  <del><strong>Cut until it hurts, and beyond.</strong></del> Kill sentences until it hurts.*</li>\n<li>*Find sentences with multiple clauses that run on and on<del>**, saying more than you need to, and confusing the heck out of your readers</del>.***</li>\n<li>*Slaughter every single adverb. You <strong><del>probably</del></strong>, do not <del><strong>actually</strong></del> need them because they are <del><strong>really</strong></del> pointless.*</li>\n<li>*Slaughter clichés. <strong><del>A serious crisis.</del></strong> If a crisis isn’t serious, what is it? Or “<strong><del>mounting, incredible, interesting</del></strong> concerns/<strong><del>mounting, incredible, interesting</del></strong> pressure/<strong><del>mounting, incredible, interesting</del></strong> evidence.” Everything seems to be “mounting, incredible or interesting” nowadays.*</li>\n<li><em>Write <del><strong>comprehensibly</strong></del> clearly at a vocabulary level you have mastered so others can understand.</em></li>\n<li>*When writers use these rephrases, <strong><del>\"In other words\"</del></strong> or <del><strong>\"That is to say\"</strong></del> or <del><strong>\"Put another way\"</strong></del>, it is often a red flag. Say something once, why explain it again? Are you not confident in your original statement that you have to explain it again?*</li>\n<li>*Don't <del>italicize</del> or use <del>\"quotations\"</del>  to emphasize your arguments. If what you’re saying is important, you don’t need fonts or punctuation marks to prove it. And if what you’re saying isn’t important, no amount of italics or quotation marks can make it so. If what you’re saying can’t speak for itself, why are you speaking for it? If you really need to drive your points home, you can <strong>bold</strong> them.*</li>\n</ul>\n<h3>Rewriting</h3>\n<p>The essence of rewriting is destruction. Cutting is bloody, but rewriting is destructive, because it requires brutal self-examination after you already put all that work into striving for perfection. Rewrite your sentences to be more precise (short and simple) and meaningful. Let go of whatever you love the most. Great writers don’t try to fix their own work but they try to destroy it. </p>\n<p>As Samuel Johnson, who set the standard for English prose in the 18th century, advised: </p>\n<blockquote>\n<p>“Read over your compositions, and wherever you meet with a passage which you think is particularly fine, strike it out.”</p>\n</blockquote>\n<p>Look below at Mark Twain's destroying his <a href=\"http://www.gutenberg.org/files/2895/2895-h/2895-h.htm#ch6\">work</a>. He chops his writing a few times until he violently crosses out his writing with two giant X’s over it. He commands himself to, <em>“Give it up.”</em></p>\n<p><a href=\"https://www.notion.so/e964f6f5256745009a2a6f95e0a54a26#33f056a1596c47a3a62400cb2083f184\">IMAGE</a></p>\n<p>Look below at the revised manuscript (<a href=\"https://www.themorgan.org/literary-historical/289875\">from the manuscript collection of the Morgan Library</a>) of the novel <em>Eugénie Grandet,</em> by the great French novelist Honoré de Balzac. Blazac stood in the print shop while the printing of his novel was in progress. He yanked each page off to accommodate revision of his existing work. Notice how he glued sections of torn paper onto the revised manuscript. He is self-examining his work brutally till the last minute. This is the work of craftsmanship.</p>\n<p><a href=\"https://www.notion.so/e964f6f5256745009a2a6f95e0a54a26#a047ee8abbd74e9ab2b8843e654ace0a\">IMAGE</a></p>\n<blockquote>\n<p>When you buy a novel, you're not paying for the words the author put on the page. You're paying for the heavy lifting the author did to remove the unnecessary ones. — Dan Brown</p>\n</blockquote>\n<p>So how do you rewrite? To assess each sentence ask yourself the following questions:</p>\n<ul>\n<li><em>Logic</em> — what didn’t you agree with in your sentence?</li>\n<li><em>Clarity</em> — what is unclear about your sentence?</li>\n<li><em>Interest</em> — what is boring in your sentence?</li>\n<li><em>Brevity</em> — what is not necessary in your sentence?</li>\n<li><em>Expansion</em> — what unanswered questions were left out in your sentence?</li>\n</ul>\n<p>Let’s rewrite a paragraph without unnecessary words:</p>\n<p>\"<em>To be brief on the sentence-level, you should remove filler words that don’t add necessary context to the sentence. This isn't intuitive to novice writers: extra words cause readers to unwittingly slow down and do extra work while reading. That makes it harder for them to recognize the sentence’s true point. Reading many extra words is also a chore for your brain. And when you exhaust readers, they quit reading.\"</em></p>\n<p>That leaves us with:</p>\n<p>\"<em>To be brief on the sentence-level, remove words that don’t add necessary context. Extra words cause readers to slow down and do extra work. That makes it harder for them to recognize the sentence’s point. And when you exhaust readers, they quit reading.\"</em></p>\n<p>Let's try rewriting again:</p>\n<p>\"<em>Your sentence is brief when no additional words can be removed. Being succinct is important because filler buries your talking points and bores readers into quitting.\"</em></p>\n<p>Rewrite in a way that you are explaining a complex topic to a ten-year-old. The complexity of your writing should emerge from the strength of its ideas, not from how those ideas are worded. Remember don't drop key information while simplifying. By removing grammatical overhead, the underlying point stands out.‍</p>\n<h3>Avoid Clichés</h3>\n<p>\"Going south\" or \"taking a nosedive\" or \"the only game in town\" or \"I wouldn't touch it with a ten-foot pole\" or \"shoot first\" or \"ask questions later\" are all examples of clichés. Clichés grow like viruses and spread like wildfire. This is not called writing but your fingers are aimlessly moving and typing.</p>\n<blockquote>\n<p>“A cliché is any wording that springs automatically to mind and types itself, as if it has kidnapped your hands.“ — Jason Zweig</p>\n</blockquote>\n<p>Some clichés get so overused that people have to introduce the enhanced version of those. Consider how often people use “unchartered waters“ in place of “uncharted waters,” or “the 800-pound elephant in the room” instead of “the 800-pound gorilla.” Reinventing these cliches with another animal is not thinking but aimlessly walking in the park. </p>\n<p>Politicians tend to do this really well. See some more examples <a href=\"https://malaphors.com\">here</a>.</p>\n<h3>First person rules (still need work)</h3>\n<p>\"I think this,\" \"I know that,\" \"I feel like,\" \"trust me,\" \"myself,\" \"I,\" and the endless echo of me me me and more me. First person is often utilized poorly among new writers. Writing in first person prevents you to stay independent and unbiased. You can get away with writing in the first person under two conditions:</p>\n<ul>\n<li>You are a vastly experienced and successful writer with profound expertise in your subject, or</li>\n<li>You poke fun at yourself.</li>\n</ul>\n<p>Regarding the redundancy of I or any of the first person pronouns, it is a matter of writing style and . But if you want to diminish it for any reasons, below are worthy alternatives. </p>\n<ul>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled>  FELTRE NOTES</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled>  <a href=\"https://unilearning.uow.edu.au/academic/2div.html\">https://unilearning.uow.edu.au/academic/2div.html</a></li>\n</ul>\n<h3>Avoid passive voice</h3>\n<p>According to <a href=\"https://en.wikipedia.org/wiki/Voice_(grammar)#Passive\">Wikipedia</a>, \"In the passive voice the grammatical subject of the verb is the recipient (not the doer) of the action denoted by the verb.\" Let's review some of the most obvious <strong><a href=\"http://examples.yourdictionary.com/examples-of-active-and-passive-voice.html\">examples</a></strong>  from <a href=\"http://yourdictionary.com\">YourDictionary.com</a> that are easily overlooked:</p>\n<ul>\n<li>Passive — <em>At dinner, six shrimp were eaten by Harry.</em></li>\n<li>Active — <em>Harry ate six shrimp at dinner.</em></li>\n<li>Passive — <em>The savannah is roamed by beautiful giraffes.</em></li>\n<li>Active — <em>Beautiful giraffes roam the savannah.</em></li>\n<li>Passive — <em>The flat tire was changed by Sue.</em></li>\n<li>Active — <em>Sue changed the flat tire.</em></li>\n<li>Passive — <em>A movie is going to be watched by us tonight.</em></li>\n<li>Active — <em>We are going to watch a movie tonight.</em></li>\n<li>Passive — <em>The obstacle course was run by me in record time.</em></li>\n<li>Active — <em>I ran the obstacle course in record time.</em></li>\n<li>Passive — <em>It was a thrill for me to meet her.</em></li>\n<li>Active — <em>I was thrilled to meet her.</em></li>\n</ul>\n<p>You would never write something like “A movie is going to be watched by us tonight.” YourDictionary.com implies that all passive structures hinge on various forms of the verb to be: am, is, was, were. If only! Getting rid of the passive voice is not a breeze. Passive language is the plague within you that infests your writing like how microbes infests your gut. This type of writing is a reflection of you.</p>\n<p>Let's dissect an example by picking it apart:</p>\n<p><em>\"There is a growing number of people who find themselves using smart phones to track whether their friendships are healthy.\"</em></p>\n<p>The “there is a” is unnecessary. It’s one of the most common, and annoying, crutches of passive language. Once you develop the habit of recognizing “there is” as passive language that serves no purpose, you will be able to look at <em>“There was somebody at the door”</em> and automatically edit it to <em>“Somebody was at the door.”</em></p>\n<p>Let's revise our original example:</p>\n<p><em>\"A growing number of people find themselves using smart phones to track whether their friendships are healthy.\"</em></p>\n<p>Did something odd just happen? Do you notice that, without the “There is,” the “A growing number of people” looks exposed somehow? Before, we might have read right through it or past it. Now, without the vague illusion of authority imposed by “There is a,” we want to know: How many people? How fast is that number growing? </p>\n<p>The writer who wrote that sentence didn't know either otherwise he or she wouldn't leave it to the reader to figure it out. Writers resort to passive wording when they are actively trying to hide something. The thing they are trying to hide is usually their ignorance.</p>\n<p>To concern, to happen, to involve, to occur, to represent, to mark, to illustrate, to symbolize, to signify, are what I call “distancing verbs.” Used like this, they insert a superficial buffer between the subject of a sentence and the action. They don’t meet the classic definition of “passive,” but they <strong>are</strong> passive. They can turn a good, direct sentence into a lame and halting mess.</p>\n<p>Let's cover more examples:</p>\n<ul>\n<li><em>“The formation of the new government occurred after the rebels…”</em></li>\n<li><em>“The debate between Democrats and Republicans concerns whether…”</em></li>\n<li><em>“The misunderstanding among customers involved the price of…”</em></li>\n</ul>\n<p>Look more closely at those three examples. Do you see what they have in common? In each case, the writer has taken the logical choice for the verb that should drive the sentence and turned it into a noun, creating the need for a distancing verb that can barely pull its own weight. “Form” is a good, simple, direct verb that the writer has bloated into the noun chain of “the formation of,” which then necessitates the addition of “occurred.” In the next example, “debate” (as a verb) becomes “the debate” (as a noun) “between.” In the last one, “misunderstand” becomes “the misunderstanding among.”</p>\n<p>In each case, the distancing verb is irrelevant. Turn the noun structure back into an active verb and then kill the distancing verb:</p>\n<ul>\n<li>Passive — *“<strong><del>The formation of</del></strong> the new government <strong><del>occurred</del></strong> after the rebels…”*</li>\n<li>Active — *“The rebels <strong>formed</strong> the new government after they…”*</li>\n<li>Passive — *“<strong><del>The debate between</del></strong> Democrats and Republicans <strong><del>concerns</del></strong> whether…”*</li>\n<li>Active — *“Democrats and Republicans <strong>are debating</strong> whether…”*</li>\n<li>Passive — *“<strong><del>The misunderstanding among</del></strong> the customers <strong><del>involved</del></strong> the price of…”*</li>\n<li>Active — *“The customers <strong>misunderstood</strong> the price of…”*</li>\n</ul>\n<p>In a similar failure, some verbs feel active but fade into passivity in the wrong hands. Look what happens to the energetic verb “to stem” in this sentence:</p>\n<p><em>\"One reason why the struggling retail chain survived for years stemmed from the fact that consumers couldn’t find cheaper prices elsewhere.\"</em></p>\n<p>What is this junk about “one reason” that “stemmed from the fact that”? The reason didn’t stem from anything! To make the sentence active, do this:</p>\n<p>\"<em>The struggling retail chain survived for years because consumers couldn’t find cheaper prices elsewhere.\"</em></p>\n<p>That makes the sentence a full 33% shorter, much clearer, and much more active. It also makes it say what the writer means. A subtle form of passive language is hard to spot but easy to fix. For example:</p>\n<p>\"<em>The President said Congress was likely to approve the bill by Tuesday, despite many members of both houses being away from the nation’s capital for the long holiday weekend.\"</em></p>\n<p>That “despite…being” or “despite [VERB]-ing” structure is common as dust and just as appealing. So far as I can tell, it’s become common because so many people refuse to write the simplest of all verbs: is, was, and were. Kill the “despite,” and you get:</p>\n<p><em>\"The President said Congress was likely to approve the bill by Tuesday, though many members of both houses are away from the nation’s capital for the long holiday weekend.\"</em></p>\n<p>It’s simpler, cleaner, and more active. Writing better is all about paying attention to the smallest details. If you don’t treat each word with exquisite care, you can’t improve. Most people handle words as if they were pennies: light, cheap, dispensable. Instead, handle them as if they were 45-pound weights in the gym. Think before you pick them up. Look before you put them down. Make sure you choose the right one and put it in the right place. Words shouldn’t be cheap to you.</p>\n<p>Have you made the logic of action in each sentence as simple and direct as possible? Is it clear who or what is the cause and who or what is affected? Are you tying unneeded words to the ankles of the subjects and objects of the sentence? Are you letting verbs do their work, or are you treating them as if they can’t move without crutches and canes?</p>\n<h3>Caution with adverbs</h3>\n<p>Mark Twain disliked them: </p>\n<blockquote>\n<p>I am dead to adverbs; they cannot excite me….this is her demon, the adverb is mine….I cannot learn adverbs; and what is more, I won’t.</p>\n</blockquote>\n<p>Stephen King dislikes them:</p>\n<blockquote>\n<p>I believe the road to hell is paved with adverbs, and I will shout it from the rooftops. To put it another way, they’re like dandelions. If you have one on your lawn, it looks pretty and unique. If you fail to root it out, however, you find five the next day...fifty the day after that...and then, my brothers and sisters, your lawn is totally, completely, and profligately covered with dandelions.</p>\n</blockquote>\n<p>It isn’t that adverbs are never necessary. It’s that they are so rarely necessary and so often misused. They are intentionally abused. Adverbs are often a signal that someone is trying to deceive or manipulate you. At a minimum, adverbs should put you on notice as a reader that the evidence isn’t convincing enough to hold itself up without an adverbial crutch.</p>\n<p>Look at this example:</p>\n<p><em>\"He is truly a legend in his own time.\"</em></p>\n<p>Now parse it by deleting the adverb and using basic skills of critical thinking to interrogate what’s left of the sentence:</p>\n<p><em>\"He is <del><strong>truly</strong></del> a “legend in his own time.”</em></p>\n<ul>\n<li><em>According to whom?</em></li>\n<li><em>What does it mean to be a “legend in your own time”?</em></li>\n<li><em>Who measures or determines how famous you have to be to qualify?</em></li>\n<li><em>If the person is as famous as you imply, why do you have to remind your readers that he’s a legend?</em></li>\n<li><em>And isn’t “legend in his own time” just a cliché anyway?</em></li>\n</ul>\n<p>The adverb, intended to convince you without supporting evidence, is the weakest link in the sentence. Yank it out, and the whole sentence comes apart and falls clanking to the ground. “Truly” is there as marketing, not meaning, to get you to suspend your disbelief about something that is at best unproven (or unprovable) and at worst untrue. </p>\n<p>A sign in the window of the restaurant declaring “TRULY THE BEST PIZZA IN TOWN” is telling you to prepare for a bad case of indigestion.</p>\n<p>When you remove adverbs such as \"really,\" \"truly,\" \"actually,\" or literally,\" you force yourself to justify the verb and ask if you need those modifiers in the first place. If the verb is not strong enough, pick a stronger verb. For example, you can swap out verb such as \"dislike\" with a stronger verb, \"hate.\" </p>\n<p>Concrete adverbs, such as <em>wildly</em> or <em>coldly,</em> inject specificity into sentences. Conceptual adverbs like <em>truly</em> or <em>really</em> drain the vividness out of sentences, replacing it with unsubstantiated claims you have to take on faith alone.</p>\n<p>I <strong><del>literally</del></strong> died laughing. No, you didn't!</p>\n<h3>Punctuation</h3>\n<p>There is loss of clarity when misusing punctuation and marks the writers as someone who doesn’t pay attention to detail. Below are few rules to follow for proper punctuation:</p>\n<ul>\n<li>\n<p><strong>I. Periods</strong></p>\n<p>If you can, use a period instead of a comma or a hyphen. Never use a comma or a hyphen if using a period in its place wouldn’t change the sentence’s intended meaning. Following this rule will help you avoid several grammar mistakes. Consider these examples:</p>\n<ul>\n<li>Incorrect: <em>“I don’t know why he’s singing, he’s next-level awful.”</em></li>\n<li>Incorrect- <em>“I’m not a liar, I just don’t respect the truth.”</em></li>\n<li>Incorrect <em>“I have a hunch that you rollerblade , am I right?”</em></li>\n<li>Incorrect <em>“Why would you smack a badger, that’s dangerous.”</em></li>\n</ul>\n<p>Read through those sentences once more. This time, imagine replacing each comma or hyphen with a period. The statements continue to read perfectly, right? The sentences’ meanings don’t change at all, right? Awesome. Then use that period instead of the comma/hyphen and you’ve just confidently avoided improper comma usage! (I’m not going to dive into <em>how</em> it is that you’re avoiding punctuation errors because that would necessitate a discussion on clauses, and I want to keep this guide short.) Here are the fixed examples:</p>\n<ul>\n<li>Correct <em>“I don’t know why he’s singing. He’s next-level awful.”</em></li>\n<li>Correct *“I’m not a liar. I just don’t respect the truth.”</li>\n<li>Correct <em>“I have a hunch that you rollerblade. Am I right?”</em></li>\n<li>Correct <em>“Why would you smack a badger? That’s dangerous.”</em></li>\n</ul>\n<p>The takeaway is that unless you’re an experienced writer, train yourself to always take a second look whenever you use a comma or a hyphen. Ask yourself, “Can I replace this with a period?” If so, do it. This is the most important comma rule.</p>\n</li>\n<li>\n<p><strong>II. Commas</strong></p>\n<p>Commas denote a pause in speaking. Speak the sentence aloud to find pauses.</p>\n<ul>\n<li>\n<p>A. You need a comma around a word located at the extreme end of a sentence that addresses someone being spoken to.</p>\n<p><strong><em>Correct</em></strong>: <em>“Matt, you eat way too many pimply pickles.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“Why do you keep flicking my belly button, Matt?”</em></p>\n<p>In both examples, the person being spoken to is referenced at either extreme end of the sentence. Notice that the word used to address the person (e.g. “Matt”) is separated from the rest of the sentence with a comma. Always do this. If you don’t, you could run into the following problem:</p>\n<p><strong><em>Potentially confusing</em></strong>: <em>“Let’s eat grandpa.”</em></p>\n<p><strong><em>Very clear</em></strong>: <em>“Let’s eat, grandpa.”</em></p>\n<p><strong><em>Potentially confusing</em></strong>: <em>“Where’s the kitchen Matt?”</em></p>\n<p><strong><em>Very clear</em></strong>: <em>“Where’s the kitchen, Matt?”</em></p>\n<p>What nonsense? You don't eat grandpa. Notice how the above two sentences have entirely different meanings based on the presence of a comma. The <em>confusing</em> example can be mistaken for, “Where is the kitchen mat [that I stand on while cooking]?” as opposed to, “Hey, Matt, where exactly is the kitchen located?” Comma rules make up the bulk of this page. Because not knowing when to use a comma is the most common punctuation mistake.</p>\n</li>\n<li>\n<p>B. You need a comma around a word located at the extreme end of a sentence that answers a question with a <em>yes</em> or <em>no</em> word.</p>\n<p><strong><em>Correct</em></strong>: <em>“Yeah, he smelled like rabies and burned sausage.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“Correct, I’m still waiting for Santa Claus’ therapist.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“I don’t know what you’re talking about, no.”</em></p>\n<p>In the above examples, a positive (“yes”, “yeah”, “sure”, “correct”, etc.) or negative (“no”, “nah”, “nope”, “incorrect”, etc.) word begins or ends the sentence. As when addressing someone, always separate the affirmative or negative word from the rest of the sentence using a comma. If you don’t, you could end up with confusion:</p>\n<p><strong><em>Potentially confusing</em></strong>: <em>“No one is still here.”</em></p>\n<p><strong><em>Clear</em></strong>: <em>“No, one is still here.”</em></p>\n<p>In the first example, you’re stating that <em>nobody is here</em>. In the second, you’re responding to a question in the negative (“no”) then clarifying that “one [person] is still here.”</p>\n</li>\n<li>\n<p>C. In a list, use a comma before the final “and”</p>\n<p>When you have a series of items separated by commas, ensure that you place a final comma (an “Oxford comma”) before <em>and</em>:</p>\n<p><strong><em>Correct</em></strong>: <em>To my parents, Jeff Bridges, and Wonder Woman.</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>To my parents, Jeff Bridges and Wonder Woman.</em></p>\n<p>In the <em>correct</em> example, you’re dedicating a book to your parents, <em>and</em> Jeff Bridges, <em>and</em> Wonder Woman. That’s three individual people. In the <em>incorrect</em> example, you’re dedicating a book to your parents who you’re then identifying as Jeff Bridges and Wonder Woman. The lack of a concluding comma inadvertently changes the entire meaning of your sentence.</p>\n<p>Takeaway: At the end of a list of items, always use a comma before the final “and.”</p>\n</li>\n<li>\n<p>D. Use a comma before introducing a question</p>\n<p>Place a comma before introducing a question — regardless of whether the question is wrapped in quotation marks:</p>\n<p><strong><em>Correct</em></strong>: <em>I’ve been wondering, Why is that turtle so nasty?</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>I’ve been wondering why is that turtle is so nasty?</em></p>\n<p><strong><em>Correct</em></strong>: <em>He was wondering, “Where are my hands?”</em></p>\n<p>Also, capitalize the first letter of the question (e.g. the \"W\" in \"Why\"). In the first example, this helps delineate the question so that it's interpreted outside the context of the containing sentence.</p>\n<p>Tip: Quotes only surround a question when you’re word-for-word quoting something that was said. If you’re instead hypothetically <em>posing</em> a question, as is the case in the first example, then quotes are not needed.</p>\n</li>\n<li>\n<p>E. Don’t use a comma to represent vocal pauses</p>\n<p>Commas serve many purposes, but representing arbitrary pauses in speech is not one of them. For example, this is not when you should use a comma:</p>\n<p><strong><em>Incorrect</em></strong>: <em>“It’s a tough day in a man’s life, when he finds out he’s a robot.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“It’s a tough day in a man’s life when he finds out he’s a robot.”</em></p>\n<p>The above sentence might be spoken with a pause between the words “life” and “when” in order to provide dramatic effect, but a comma is the wrong form of punctuation to capture a pause. Instead, an ellipsis (…) would be appropriate:</p>\n<p><strong><em>Correct</em></strong>: <em>“It’s a tough day in a man’s life… when he finds out he’s a robot.”</em></p>\n<p>The easiest way to avoid misusing commas in this manner is to ask yourself if using the comma makes the sentence read like a haiku. If so, replace it with an ellipsis or drop it altogether.</p>\n<p>This leads into the next rule…</p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>III. Ellipses</strong></p>\n<p>An ellipsis is a trio of periods (…).</p>\n<p>Don’t use it—unless you're quoting someone. You rarely see it used in textbooks , because it’s the sign of a lazy writer failing to structure their thoughts so that they fall within the lines of more common punctuation.</p>\n<p>In essence, the writer is falling back on free-form speech patterns. Speaking of which, that's the one place it’s okay to use an ellipsis: inside a quote.</p>\n<p>For example, she said to me, <em>“Linda… You need to get rid of that damn cat.”</em></p>\n<p>Above, the purpose of the ellipsis is to insert a dramatic pause reflecting how the quote was originally articulated. In this way, it serves to properly capture the intention behind breaking Rule #5.</p>\n<p>Don’t use ellipses in formal writing. Only consider using them within quoted speech.</p>\n</li>\n<li>\n<p><strong>IV. Semicolons</strong></p>\n<p>It’s really easy to use semicolons [;] incorrectly, so my advice is to not use them in the first place. After all, semicolons are rarely needed to help communicate a point.</p>\n<p>Since it would be pedantic to not at least provide you with one example of proper semicolon usage, I will show you the case where it’s difficult to misuse it: when you’re connecting two sentences that use different sets of words to express the same idea.</p>\n<p><strong><em>Correct</em></strong>: <em>“She’s not a good listener; I feel like I’m talking to myself.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“I can’t stop thinking about my dog; she is everything to me.”</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>“Those pants are gross; they smell bad too.”</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>“That person looks like a hamster; he’s weird.”</em></p>\n<p>Notice how the <em>correct</em> examples use a semicolon to conjoin two sentiments that are essentially making the same point but from different perspectives. (Sometimes this is desired for the purposes of emphasis.) This is when you would use a semicolon.</p>\n<p>In contrast, notice how the <em>incorrect</em> examples use a semicolon to conjoin two sentiments that convey complementary but not redundant information. “That person looks like a hamster” is one sentiment. “He’s weird,” although perhaps related in thought, is a separate sentiment. They are not mere rewordings. Do not use a semicolon here.</p>\n<p>If we wanted to <em>correctly</em> use a semicolon for the last <em>incorrect</em> example, we could change the second part to, “That person looks like a hamster; he has rodent-like qualities.” In this way, we’re specifically describing what a hamster looks like instead of explicitly using the word “hamster.”</p>\n<p>The primary takeaway from this rule is simple: Avoid using semicolons because they invite redundancy. Redundancy is bad in writing. Find a way to express yourself concisely. Further, when a semicolon is used in this way, it can often be seamlessly substituted for a period. And a period is better than a semicolon because readers are more familiar with them and are therefore less likely to pause to assess why you're using a semicolon.</p>\n</li>\n<li>\n<p><strong>V. Colons</strong></p>\n<p>Only use a colon when you’re presenting an example of what the words <em>before</em> the colon refer to:</p>\n<p><strong><em>Correct</em></strong>: <em>“There is only one God: Thor.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“She had one piece of advice: Never slap a monkey.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“This is how you play footsie: with your feet.”</em></p>\n<p><strong><em>Correct</em></strong>: <em>“He is a smart man: He solves sudokus in seconds, speaks many languages, and is great with chipmunks.”</em></p>\n<p>There's also a second colon rule at work here: The words <em>before</em> the colon must be able to stand alone as a grammatically correct sentence. Meaning, if you replace the colon with a period, the words before the period make sense when read alone.</p>\n<p>For example, below is incorrect colon usage:</p>\n<p><strong><em>Incorrect</em></strong>: <em>“Her favorite color was: blue.”</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>“I love penguins because: they stand out.”</em></p>\n<p>In these incorrect examples, the leading sentence couldn’t stand alone without adding words back in:</p>\n<ul>\n<li>“Her favorite color was” is not a proper sentence. The \"was\" ends the sentence mid-thought. It simply doesn’t sound right.</li>\n<li>“I love penguins because” also is not a proper sentence. \"Because\" is supposed to introduce a new thought, but doesn't.</li>\n</ul>\n<p>In both of these incorrect examples, simply drop the colon and the sentence will magically read perfectly. (If punctuation serves zero grammatical purpose, don’t use it!)</p>\n<p>The takeaway: Only use colons when your first sentence introduces the second sentence, but the first sentence could standalone if the next didn't exist.</p>\n</li>\n<li>\n<p><strong>VI. Punctuation within quotation marks</strong></p>\n<p>American English dictates that punctuation (periods, exclamation marks, and question marks) should be placed <em>inside</em> quotation marks:</p>\n<p><strong><em>Correct</em></strong>: <em>He said to me, “That’s one hell of a goat.”</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>He said to me, “That’s one hell of a goat”.</em></p>\n<p><strong><em>Correct</em></strong>: <em>He asked, “Life sucks. Why am I so short?”</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>He asked, “Life sucks. Why am I so short”?</em></p>\n<p><strong><em>Correct</em></strong>: <em>He yelled to the driver, “Go back to America!”</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>He yelled to the driver, “Go back to America”!</em></p>\n</li>\n<li>\n<p><strong>VII. Punctuation within parentheses</strong></p>\n<p>If you’re wrapping a full sentence within parentheses, the final punctuation must stay within those parentheses:</p>\n<p><strong><em>Correct</em></strong>: <em>John is stupid. (He scored 35 on an IQ test.) He’ll die young.</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>John is stupid. (He scored 35 on an IQ test). He’ll die young.</em></p>\n<p>In contrast, if you’re wrapping merely a <em>portion</em> of a sentence in parentheses, leave the sentence’s ending punctuation <em>outside</em> the parentheses:</p>\n<p><strong><em>Correct</em></strong>: <em>I’m going back home (Japan).</em></p>\n<p><strong><em>Incorrect</em></strong>: <em>I’m going back home (Japan.)</em></p>\n</li>\n<li>\n<p><strong>VIII. Dashes</strong></p>\n<p>Dashes should emphasize the clauses you consider most important — without using bold or italics — and not only for defining terms. (Parentheses can present clauses more quietly and gently than commas.) Don’t lean on semicolons as a crutch to join loosely linked ideas. This only encourages bad writing. You can occasionally use contractions such as isn’t, don’t, it’s and shouldn’t. Don’t be overly formal. And don’t use exclamation marks to call attention to the significance of a point. You could say ‘surprisingly’ or ‘intriguingly’ instead, but don’t overdo it. Use these words only once or twice per paper.</p>\n</li>\n</ul>\n<h2>Final draft</h2>\n<h3>Resolution</h3>\n<p>Your goal is to make your writing so concise that it can’t be summarized further. For the essay to succeed, brilliantly, it has to work at all of the levels of resolution simultaneously. You should not transfer any cognitive load to your readers. Logic should flow flawlessly and narrative should be fluid. Below are the levels of resolutions:</p>\n<ul>\n<li><em>Word</em>: choosing the right word precisely fitting at the right location.</li>\n<li><em>Sentence</em>: crafting a sentence so an idea or thought can be expressed correctly in a grammatically correct manner.  Sharpen your sentences. Each sentence should examine the truth. Revise your sentences over and over again until each sentence becomes readable, believable and explainable to a young kid.</li>\n<li><em>Paragraph</em>: sentences should be properly arranged and sequenced inside a paragraph.</li>\n<li>*<em>Paragraph arrangement</em>: all of the paragraphs have to be arranged in a logical progression, from the beginning of the essay to the end to get us to the final destination.</li>\n<li><em>Essay as a whole</em>: an essay without originality or creativity can fail because it is not interesting or important. Sometimes a creative person, who is not technically proficient as a writer, can make the opposite mistake. Their choice of word is poor, their sentences are badly constructed and poorly organized within their paragraphs, their paragraphs has no intelligible relationship to one another, and yet the essay as a whole can succeed because there are valuable thoughts trapped within it.</li>\n<li><em>Reader</em>: an essay necessarily exists within a context of interpretation, made up of the reader. When you are writing something for someone, you need to know your audience.</li>\n<li><em>Culture</em>: an essay necessarily exists within a context of interpretation, made up of culture that the reader is embedded in. Knowing your audience's culture is as important as knowing your audience. Context matters!</li>\n</ul>\n<h3>Rhythm &#x26; style</h3>\n<blockquote>\n<p>The essence of a sound style is that it cannot be reduced to rules — that it is a living and breathing thing, with something of the demoniacal in it — that it fits its proprietor tightly and yet ever so loosely, as his skin fits him. It is, in fact, quite as securely an integral part of him as that skin is…. In brief, a style is always the outward and visible symbol of a [writer], and it cannot be anything else.  To attempt to teach it is as silly as to set up courses in making love. — H.L. Mencken</p>\n</blockquote>\n<p>Inject questions and less-formal language to break up tone and maintain a friendly feeling. Informal expressions can be good for this, but they shouldn’t be too narrowly tied to a region. Similarly, use a personal tone because it can help to engage a reader.</p>\n<p>Instead of trying to sound distinctive, just sound like you. Appealing to someone who’s never read you before is exactly like going out on a first date. The worst thing you can possibly do is to pretend to be someone other than yourself. Don’t try to be serious if you’re funny, funny if you’re serious, a mathematician if you’re a poet, or a poet if you’re a mathematician. Don’t show off a vocabulary you don’t have; don’t hide a sophistication that you do have. Straining to sound unique can end up making you sound just like every other wannabe, and nothing like yourself. </p>\n<p>Let your voice emerge and let readers appreciate what you care about and the perspectives you see the world through. </p>\n<p>See how Abraham Lincoln took a paragraph drafted by his Secretary of State, William H. Seward, and <strong><a href=\"https://www.loc.gov/resource/mal.0773800/?sp=1&#x26;st=text\">elevated it from rhetoric to political poetry</a></strong>.</p>\n<p>Seward wrote:</p>\n<p><em>“I close. We are not, we must not be, aliens or enemies, but fellow-countrymen and brethren.  Although passion has strained our bonds of affection too hardly, they must not, I am sure they will not, be broken.  The mystic chords which, proceeding from so many battlefields and so many patriot graves, pass through all the hearts and all hearths in this broad continent of ours, will yet again harmonize in their ancient music when breathed upon by the guardian angel of the nation.”</em></p>\n<p>Lincoln transformed that to:</p>\n<p><em>“I am loath to close. We are not enemies, but friends. We must not be enemies. Though passion may have strained, it must not break our bonds of affection. The mystic chords of memory, stretching from every battlefield and patriot grave to every living heart and hearthstone all over this broad land, will yet swell the chorus of the Union when again touched, as surely they will be, by the better angels of our nature.”</em></p>\n<p>Notice how Lincoln makes the abstract personal. Steward's draft has the chilly commanding tone given by a preacher who struggles to keep his ego in check. “I close” (you in the back row, wake up now!) and “I am sure” (Trust me, I know I’m right!). Lincoln infuses the passage with emotion and empathy — “I am loath to close” (You are my friends, and I hate to leave you) and “We are not enemies, but friends. We must not be enemies” (Please, I beg you, let’s live together in respect and friendship). Seward offered only a rhetorical implication that divine justice would redeem the nation. Lincoln offers the tangible hope that who we can be is who we are, that we all have angels within us.</p>\n<p>At its best, writing becomes almost indistinguishable from music. Someone reading great writing, just like someone listening to great music, takes an intense, tactile pleasure in the rhythm and flow of the work, sensing instinctively what is about to come next and nevertheless being surprised and thrilled by it at the same time. </p>\n<p>Great writers orchestrate that interplay between tension, suspense, surprise, release and completion. It is wild and sensual, deliberate and controlled, humorous and intelligent, all at once, all carried out with lightness and grace. The spontaneity is studied, the result of continuous refinement. </p>\n<p>Lastly, providing examples is another stylistic choice. Examples make abstract statements specific. Your brain best remembers things this way. Provide before-and-after examples, or counterexamples, to clarify what you don’t **mean. Help readers orient themselves on a spectrum of right and wrong. If you make examples fun and topical, readers pay more attention. Don't waste time with examples if you're confident your point was self-evident.</p>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"43 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}