{"data":{"site":{"siteMetadata":{"title":"The Mihir Chronicles"}},"allMarkdownRemark":{"totalCount":2,"edges":[{"node":{"html":"<ul>\n<li><a href=\"https://www.vulture.com/2018/11/jerry-saltz-how-to-be-an-artist.html\">How to be an artist</a>: Jerry Saltz is a Pulitzer prize winner for art criticism. Here he shares his thoughts on creativity and how to be an artist.</li>\n<li><a href=\"http://blog.samaltman.com/productivity\">Productivity</a>: Sam Altman shares his thoughts on optimizing productivity. What hit home for me was just like how money compounds, making incremental productivity hacks can also compound. Sleep was a big one! I no longer preach \"sleep when I die\" attitude. It is actually completely opposite today. If I don't get enough sleep, my body really feels the pain.</li>\n<li><a href=\"https://meaningness.com/geeks-mops-sociopaths\">Geeks, mops and sociopaths</a>: this one was fascinating about how things take off and the role geeks, mops and sociopaths play a role. This can be applied to so many things, especially the digital coin trend.</li>\n<li><a href=\"https://www.edge.org/conversation/yuval_noah_harari-daniel_kahneman-death-is-optional\">Death is optional</a>: I am a huge fan of Yuval and his work on Homo Sapiens. And there is no one better than Daniel Kahneman to lead the discussion on access to medicine and the society's role. Sad to say, it does not surprise me there will be inequality in health care just how we are facing income inequality today.</li>\n<li><a href=\"https://www.newyorker.com/magazine/2009/06/01/the-cost-conundrum\">The cost conundrum</a>: Atul Gawande does an exceptional job explaining how healthcare cost varies in two seprate towns in Texas for the same treatment. A long but worth the read to understand the health care issues in America.</li>\n<li><a href=\"https://kk.org/thetechnium/1000-true-fans/\">1000 true fans</a>: no more chasing millions and 20x growth rate because a creator's job is to find the true fans. There is so much joy in finding the first 1000 true fans.</li>\n<li><a href=\"http://www.issendai.com/psychology/sick-systems.html\">Sick systems</a>: this is deep and I still haven't had a chance to fully analyze the piece. But there is so much validity to how system of keeping someone forever works in professional world.</li>\n<li><a href=\"http://augmentingcognition.com/ltm.html\">LTM</a>: I have a personal fascination with long term memory and I still haven't cracked the code yet but I am a huge believer in space repition and its benefits. Michael Nielsen does a great job covering space repition techniques using the tool called Anki.</li>\n<li><a href=\"https://jamesclear.com/luck-vs-hard-work\">Luck vs hard work</a>: can't get any simpler than the title itself. A great piece on luck vs hard work.</li>\n<li><a href=\"http://blakemasters.com/peter-thiels-cs183-startup\">Peter Thiel cs183 essays</a>: Peter Thiel is one of the most outcry and an independent thinker. These notes capture his wisdom he shared during one of the CS183 lecture on startups. </li>\n<li><a href=\"https://theamericanscholar.org/solitude-and-leadership/#.XU5OtJNKifU\">Solitude and leadership</a>: leadership is solitude and solitude is leadership. Being able to think for yourself is one of the most underrated skill. This is how leaders our born!</li>\n<li><a href=\"https://www.albertbridgecapital.com/drew-views/2019/6/17/stay-in-the-game\">Stay in the game</a>: this one is emotional and hit home for me. We all have demons but Max had demons which were beyond his control. He stayed in the game and kept battling. A must read!</li>\n</ul>","id":"86be6227-bf56-54e0-8e7a-5bdf5ed3e437","frontmatter":{"title":"Articles","path":"/explore/articles"}}},{"node":{"html":"<ul>\n<li><a href=\"http://www.berkshirehathaway.com\">Warren Buffett</a>: historical lessons on buffettology. No need to go to school. This alone will teach you how to handle finances, relationships, ethics and avoiding stupid mistakes especially greed.</li>\n<li><a href=\"https://www.jpmorganchase.com/corporate/investor-relations/annual-report-proxy.htm\">Jamie Dimon</a>: is the CEO of JP Morgan Chase. He is leading one of the largest banks in the world and has a lot to share on banking, economy and policies.</li>\n<li><a href=\"https://www.oaktreecapital.com/insights/howard-marks-memos\">Howard Marks</a>: if Warren Buffett is for equity then Howard Marks is for fixed income. Both follow the same principles but are involved in managing different asset classes.</li>\n<li><a href=\"https://www.blackrock.com/corporate/investor-relations/larry-fink-chairmans-letter\">Larry Fink</a>: is the CEO of Blackrock, a largest active investing organization. Lot of wisdom in his letters.</li>\n<li><a href=\"http://1icz9g2sdfe31jz0lglwdu48.wpengine.netdna-cdn.com/wp-content/uploads/2012/09/Seth-Klarman-Baupost-Group-Letters.pdf\">Seth Klarman</a>: not much out there on Seth Klarman but this is the best resource I could find.</li>\n<li><a href=\"https://ir.aboutamazon.com/annual-reports\">Jeff Bezos</a>: Amazon. Period.</li>\n<li><a href=\"https://www.csisoftware.com/category/pres-letters/\">Mark Leonard</a>: is an underdog but one of the most fascinating CEOs out there who have acquired software businesses and managed to grow companies many x times. Buffett of software companies!</li>\n<li><a href=\"https://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=77768\">Clifford Asness</a>: a hedge fund manager behind a very well run firm, AQR Capital.</li>\n<li><a href=\"https://www.socialcapital.com/annual-letters/\">Chamath Palihapitiya</a>: used to be a VC, helped grow facebook but now following Buffett type partnership. A lot of insight on private market and how moonshot ideas will take over.</li>\n<li><a href=\"https://www.adventur.es/annual-letters/\">Brent Beshore</a>: not a fan of private equity genrally speaking, but Brent has good intentions and has a lot to share in his letters.</li>\n</ul>","id":"57b90842-bfc6-5257-84af-5c2e874ddc8b","frontmatter":{"title":"Shareholder Letters","path":"/explore/shareholder-letters"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}