{"data":{"markdownRemark":{"html":"<p>Work in progress.</p>\n<p>As I enter the fourth decade of my time on this planet, I am no longer planning the upcoming months or years but rather thinking in decades. This allows to re-orient myself working towards long-term outcomes, shifting the mindset towards mastery, staying humble and steering away from distractions. This also sets a sense of urgency on how to spend time because there are only handful of decades left. But before I move forward, few things I have learned in the last decade.</p>\n<p>Many view ignorance as negative, but in my opinion, ignorance can serve well if used appropriately. This is mostly due to ego not in check but it is all part of learning and growing. I have been rebellious my entire life. I didn't have a corporate job after college because I thought I could start a company. I also traveled to few places after graduating college to find my place in this world. Not because I was smart, but I was ignorant about lot of things and lacked knowledge on how the real world operated. </p>\n<p>Starting a company was a dream because a glory such as that is what the West demands. But traveling and meeting people feom outside of my bubble clarified what success meant to me. Also, little did I know starting a company is hard, keeping it alive is even harder. If I knew the limitations, I would have never tried in the first place. Being ignorant paid off in a way! Learning to find strangers and working with them, bringing a project to life, and selling a product after its born are the skills I would've never learned otherwise. Lastly, fear never crossed my mind because I was too busy being ignorant. </p>\n<p>Today, I somewhat despise ignorance but I am glad I got that window to live in such a way. Everyone gets a limited window in their lives to be ignorant and everyone should take advantage of that because it allows everyone to wander and explore.</p>\n<p>Growing up, I had areas of interest I wanted to pursue but nothing with a strong conviction. I was naturally drawn to stock investing from an early age. As I was graduating from college, the world was recovering from the Great Recession. Prospects in the industry were low or rarely available. This in turn made me rebellious. Rather than seeking a stable career, I wandered around and explored. Signing myself up for bootcamps, meeting strangers over coffee, learning to build products, starting a company, moving away from family and friends and so much more. The goal was to be a learner that came my way not following the story we are told in West — chase money, power and awards.</p>\n<p>Accomplishments </p>","frontmatter":{"date":"03 August, 2019","path":"/blog/thinking-in-decades","title":"Thinking In Decades"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}