{"data":{"markdownRemark":{"html":"<ul>\n<li><a href=\"https://aswathdamodaran.blogspot.com/\">Aswath Damodaran</a>: he is a finance professor with lots of resource on how to value a company. Part of it is numbers, and the other is narrative. Good luck valuing narrative but you can learn a thing or two from him.</li>\n<li><a href=\"http://michaelmauboussin.com/\">Michael J. Mauboussin</a>: another finance professor with deep essays. I like his analysis on moats.</li>\n<li><a href=\"https://www.collaborativefund.com/blog/authors/morgan/\">Morgan Housel</a>: he is such a clearer thinker and writer. I can read every piece he has written without getting bored.</li>\n<li><a href=\"http://jasonzweig.com/\">Jason Zweig</a>: a wallstreet jounalist who has reviewed intelligent investor with comments. A must read everything that Jason Zweig has to share. A classic value thinker and journalist!</li>\n<li><a href=\"https://25iq.com/\">Tren Griffin</a>: he is a great writer on various topics but especially on valuation, strategies and leadership. I need 6 months off to go over everything Tren has ever written.</li>\n<li><a href=\"https://stratechery.com/\">Ben Thompson</a>: an independent CFA for an independent organization who covers technology companies with the emphasis on aggregate theory and network effect as their strategies.</li>\n<li><a href=\"http://investorfieldguide.com/\">Patrick O’Shaughnessy</a>: he is one of the best with one of the best podcast. A must listen!</li>\n<li><a href=\"http://abovethecrowd.com/\">Bill Gurley</a>: he is one of the best VCs who backs ideas that will take off. Many successful exits!</li>\n<li><a href=\"http://www.philosophicaleconomics.com/\">Jessie Livermore (anonymous)</a>: he blows my mind with his deep analysis on markets. The craziest part he never went to school for finance.</li>\n<li><a href=\"https://www.fooledbyrandomness.com/\">Nassim Taleb</a>: a controversial author but so much wisdom to share on risk and randomness.</li>\n<li><a href=\"http://www.econtalk.org/\">Russell Roberts</a>: a great podcast which covers economic policies.</li>\n</ul>","frontmatter":{"date":"08 August, 2019","path":"/explore/valuation-investing","title":"Valuation & Investing"},"fields":{"readingTime":{"text":"2 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}