{"data":{"markdownRemark":{"html":"<p>To discover what truly matters, you can ask deeper and deeper questions that build on the answers. The key to get to the bottom of root causes is not to ask one question. This effort challenges everyone's assumptions.</p>\n<p>The most useful yet underutilized tool for anyone who wants to lead or discover. Following are 100 major ideas (mental models) that will help you ask the right questions:</p>\n<p>COMPUTER SCIENCE</p>\n<ol>\n<li>Algorithms— A way for computers to process data. A set of instructions which take an initial input and state, perform a finite number of operations and produce an output. An algorithm will eventually have a stopping point.</li>\n<li>Recursion\tBreaking down a problem into simple steps called functions. These functions can call themselves. An example would be a function which allows a robot to take a step. If the robot needed to get somewhere, you could call the function. The function could then call itself over and over, checking for completing each time.</li>\n<li>Data Structures: Graphs, Hash Table, Heaps, Queues, Stacks, Trees\tA way to organize data on a computer so that it can be manipulated efficiently. Data structures include, but are not limited to; arrays, records, lists, files, trees, and tables.</li>\n<li>If-Else Statements\tA conditional statement in computer programming. If a programmer-defined condition is true, then a block of code will be executed. If the condition is false, then another piece of code will be executed.</li>\n<li>Security Public Key Cryptography\tKeys are very long numbers which can be used to encrypt and decrypt data when sent from one person to another. They can also be used to validate data. They work as a personal signature from the sender so that when you receive data, you know who it has come from.\nENGINEERING\tBreakpoint\tA small pause, or break, in complex engineering systems, to allow for safety or debugging. These breaks allow you to look at the system and reflect on performance, making sure that there are no noticeable errors. Breakpoints can be a useful addition to your thinking in a variety of subjects.\nENGINEERING\tBack-up Systems / Redundancy\tThe adding of duplicated parts to systems to increase reliability and provide a failsafe, should part of the system go down. The duplicated part could be a backup of a critical component or it could be used to increase performance, such as multi-threading in computing.\nENGINEERING\tFeedback Loops: Positive &#x26; Negative (aka Homeostatis)\tPart of a control system in which the outputs are fed back in as inputs. Take the heating in your home: your furnace will push out heat, the thermometer will check the temperature and use this information to turn the furnace on and off. The system is a loop.\nENGINEERING\tMargin of safety\tDescribes the capacity of a system to carry loads beyond its actual capability. When designing such systems, the system should be able to support additional loads which are calculated using detailed analysis.\nBIOLOGY\tEvolution by Natural Selection\tAn evolutionary process where living things, over generations, adapt to changes in their environment. This includes, but is not limited to; food, mates, climate, predators, and weather. Those which are better able to adapt to those changes will reproduce in greater numbers and pass on favorable traits.\nBIOLOGY\tEcosystem\tA community where living things interact with each other and nonliving things around them in a mutually beneficial relationship. Bees may help to pollinate flowers, which grow in the soil, which is provided nutrients from organic matter.\nBIOLOGY\tRed Queen Effect (Coevolution/Extinction)\tAn evolutionary hypothesis which suggests that organisms who interact with other organisms, and species, will have a better chance of survival over generations. Interactions between species create a more diverse and effective population.\nCHEMISTRY\tAutocatalysis (ex: Disney Movie Catalog -> VHS) aka Self Breeding aka Evergreen\tChemical reactions can produce a product or products. If one or more of those products accelerates or increases the original reaction, they are said to be a catalyst. If this is the case, then the chemical reaction has undergone autocatalysis.\nMATH\tCompound Interest\tInterest is the cost of borrowing. When money is lent, a simple interest is calculated on the original, principal sum. This is interest. Compound interest is calculated on the principal amount plus the accumulated interest of previous periods, and can thus be regarded as interest on interest.\nMATH\tPermutations &#x26; Combinations\tA combination is a list of things where the order does not matter, like a shopping list. A permutation is a list of things where the order does matter, like a bestseller list.\nMATH\tInversion\tInversion can be defined as the opposite way to do something or, to do something in reverse. This can be particularly useful in solving complex problems, helping to see them in a different way. The inverse of a simple addition would be to subtract one component from the total.\nMATH\tMultiply by Zero\tAnything multiplied by zero becomes zero. no matter how big the preceding numbers are, if you are in a system which multiplies numbers, and one of the numbers is zero, the end product will always be zero.\nMATH\tPower Laws\tA relationship between two quantities whereby a small change in one, results in a large change in the other. One quantity changes as a power of the other. If you double the diameter of a circle, the area would quadruple.\nPHYSICS\tLaws of Thermodynamics\tConsists of four laws. 1. If two systems are independently equal, thermally, to a third, the two systems must be equal to each other. 2. The total amount of energy in a closed system cannot change. 3. The disorder of energy in a closed system will always increase. 4. It is impossible to reach absolute zero.\nPHYSICS\tCriticality, Critical Mass: Non-linearity, Tipping Points, M-Stan vs E-Stan\tWhen a nuclear reaction happens, neutrons are released and can cause another reaction. The smallest amount of a material needed to self-sustain a nuclear chain reaction is said to be the critical mass.\nPHYSICS\tTheory of Equilibrium: Static vs Dynamic\tWhen a system has no change over time, in motion or energy. Static equilibrium is when motion and energy are unchanging. Dynamic equilibrium is when two competing forces find a balance to prevent any change in the motion and energy.\nPHYSICS\tLeverage\tBy using a lever, you can amplify the input force. Think of a teeter-totter or a see-saw. Push one side down and the other goes up. Make one side short and the other long, and you can lift heavy objects by applying force to the long side.\nPHYSICS\tNewton’s Laws\tThe three laws of motion describe the interrelationships between objects, and the forces acting on them. Namely; how an object will move when forces are applied, how the force of an object is changed by acceleration, and how the forces of two objects react to each other.\nSTATISTICS\tBayes Theorem\tGives the probability for particular events when previous background knowledge, related to the event, is known. For example, the probability of someone dying can be predicted with more accuracy when the person's age is known.\nSTATISTICS\tProbability\tThe likelihood that something will happen. In most cases, we cannot say, with certainty, what outcome will occur, but we can often predict how likely a given outcome is.\nSTATISTICS\tCentral Limit Theorem (Bell Curve)\tThis theorem states that given a large enough sample size from a population, the mean of the sample will be representative of the mean of the population. The distribution of sample and population will be similar too. A large enough size is considered to be between 30 and 40.\nSTATISTICS\tCorrelation and Causation\tCorrelation is when two or more variables change together, but they are not the cause of the other change or changes. Causation is when two or more variables change and one of those variables is responsible for the other change or changes.\nSTATISTICS\tStandard Deviation \tUsed in statistics to measure a spread of values and how far from ‘normal’ these values are. By finding the Standard Deviation, we can know what is ‘normal’ for a given set of values, and what is above or below this normal range.\nSTATISTICS\tRegression to the Mean\tWhat goes up must come down. An anomaly in statistics (an extreme value), will tend to be closer to average the next time it is measured. If, when measured a second time, the value is found to be more extreme, then the original value was likely closer.\nSTATISTICS\tLaw of Small &#x26; Large Numbers\tAs a sample size grows large, its mean gets closer to the average of the population. A large sample size will give a more accurate outcome. When a small sample size is used, there is a tendency to treat it as truth when there is a recognizable pattern and it backs up a set of findings.\nSTATISTICS\tUtility\tA calculation of the gratification experienced by the user of goods, or a set of goods. Happiness cannot be directly measured, but utility tries to represent the satisfaction or benefit in a way that is measurable.\nECONOMICS\tElasticity of Demand\tWhen prices go up, the demand for a given product usually goes down. When prices go down the demand usually goes up. Demand is usually elastic for the products we do not care much about, such as socks.\nECONOMICS\tSupply &#x26; Demand\tAn economic model which helps to set the market price for goods and services. Prices will vary based on the supply and demand but will settle when the demand is equal to the supply.\nECONOMICS\tScarcity: Limited Time, Going Fast\tRefers to a basic problem that we encounter in our world: there is a finite amount of resources yet an infinite amount of human wants. Based on scarcity, decisions need to be made about how best to allocate resources.\nECONOMICS\tEconomics of Scale (Law of Scale)\tDescribes the cost advantage of products, for both producers and consumers, when production is scaled up. It costs more per unit to produce just 1 of something than it does to produce 1000 because the production costs are spread over the units.\nECONOMICS\tCompetitive Advantage: (Sources:Monopolies, Duopolies &#x26; Oligopolies)\tThe ability of a business to outperform its competitors. This can be gained by having lower prices for the same product or by offering better goods and services at the same price. Can also be gained by having access to better resources, new technology, better location, etc.\nECONOMICS\tCosts: Opportunity Cost, Sunk Costs, Relevant Costs and Marginal Costs\t\"Opportunity cost is the cost of doing one thing over another,\nsuch as staying in vs. going out. Sunk costs are costs which cannot be recovered. Relevant costs are costs which will make a difference in decisions. Marginal cost is the cost of producing one more unit of a product or service.\"\nECONOMICS\tTradeoffs\tCertain situations have two or more desirable outcomes. There are times when all outcomes cannot be achieved together: there will be losses and gains with each. You need to find the trade-off which will produce the most desirable outcome.\nECONOMICS\tWealth Effect, Income Effect, Substitution Effect\tAs wealth or the perception of wealth rises so too does the spending. This can happen when a person brings in more income or when assets are manipulated, either naturally or artificially.\nECONOMICS\tComparative Advantage: Tiger Woods &#x26; Lawn\tThe ability of someone, or a group of people, to produce goods or services at a better price than a competitor. The quality of the goods or services does not matter.\nECONOMICS\tBottleneck – Theory of Constraints\tA process which will help you to discover what is causing a bottleneck (traffic jam) within your system. Identify the constraint. Use available resources. Review other activities. Use additional resources. Repeat.\nECONOMICS\tArbitrage\tThe simultaneous buying and selling of any good where you can exploit a price difference. For example, buying vintage clothes from a thrift store knowing that you can sell them for a higher price, instantly, to a clothing dealer.\nECONOMICS\tMoral Hazard\tWhen someone enters a risky situation knowing that someone else will bear the cost of the risk or risks. This can occur when one side does not have access to all the information in the situation.\nECONOMICS\tSwitching Costs\tThe costs involved when switching between suppliers. These could be; actual expenses, inconveniences, lost time, mental and psychological barriers, risks and uncertainty, or social barriers.\nECONOMICS\tMatthew Effect/Cumulative Advantage/Preferential Attachment: Small Initial Advantage Snowballs/ Preferential Attachment\tThe rich get richer and the poor get poorer. Someone who starts out with more money than someone else will generally accumulate more money than the other person. The same is also true for fame, status, education, etc.\nECONOMICS\tMarginal Analysis aka Cost Benefit Analysis\tA tool used to maximize the profits of a company. Marginal analysis deals with an examination and identification of the added benefits of an activity or a slight increase in production. This is weighed against the costs which will be incurred.\nECONOMICS\tNetwork effects\tThe effect that one person has for other people on the value of goods or services. A great example is social media: the more people who sign up for a social network, the more valuable and attractive that social network is to the average person.\nECONOMICS\tCompetitive/Creative Destruction\tRevolution in the economic structure. The old gives way to the new. New products, commodities, technology, organizations, and innovations replace old ones. For the economy to grow and the masses to benefit some organizations must suffer.\nECONOMICS\tPareto Principle (aka “The 80/20 Rule”)\tFor many events, it can be shown that 80% of the effects come from 20% of the causes. Inputs are not directly relational to outputs. In business, 80% of revenue generally comes from 20% of the clients. This principle can help to show where to focus time and energy.\nECONOMICS\tPrisoners' Dilemma\tA game in which two separate prisoners are given two choices: confess or don’t confess. If they both confess, they each get 2 years in prison. If neither confesses, they each get 1 year. If one confesses and the other does not, the confessor goes free and the other gets 3 years.\nECONOMICS\tTragedy of the Commons\tThe 'tragedy' refers to a set of individuals who, acting rationally, independently, and in their own self-interest can create a situation where they destroy a group’s collective long-term viability by depleting a common source. Fishing and herding are classic examples.\nBUSINESS\tEconomic Moats\tThe ability of a business to protect itself and create long-term competitive advantages. Companies such as Walmart can undercut competitors and negotiate supplier discounts due to a high volume of sales. Size advantage, cost advantage, patents, etc., can all be considered economic moats.\nBUSINESS\tFloat\tWhen a bank deposit or transfer is made, there is a short period of time where the money is duplicated. The money will show up immediately in the recipient’s account, but will not yet have had time to leave the sender’s account. This duplicated money can be used as an investible asset.\nBUSINESS\tPorter’s 5 forces\tA framework for determining the level of competition within an industry and evaluate a firm's strategic position: (1) Bargaining power of suppliers and (2) buyers, (3) the threat of new entrants or (4) substitutes, and (5) industry rivalry, make up the five forces.\nBUSINESS\tSurfing a wave\tIt pays to be in the right place at the right time. New ideas come and go. The tricky part is deciding which idea to jump on and which to avoid. If you can get onboard with a successful idea at the right time then you can build a successful business around it.\nBUSINESS\tDiminishing Returns: Fatigued Worker\tIf one factor of production is incremented while others stay constant, the cost to produce one unit of the product will increase. For example, on a farm, if you add an extra person but no more tools, then the cost per harvest will be more.\nBUSINESS\tCircle of Competence\tWhen investing money into something, you should stay within your circle of competence. That is, you should stick to areas that you know more about than the average investor, and focus your time in those areas.\nBUSINESS\tTrademarks, Patents, and Copyright\tA trademark protects the items which define a company brand, the logo being one of those things. Copyright protects literary and artistic works, such as movies or books. Patents protect inventions and stop other people from making or selling them.\nBUSINESS\tChurn\tThe churn rate is the number of customers who stop subscribing to a product or service. For a business to grow, the number of new customers added each year must be higher than the churn rate.\nFINANCE\tMr. Market\tA fictional character who makes business decisions based on his mood. One day he may be in a state of euphoria, and the next, panicked. Used to illustrate why business decisions should be made based on rational, big picture, information.\nFINANCE\tThe Stock Pari Mutuel System\tA system of betting where the bets are pooled and the winners share the money after the house, or organizer, has taken their cut. The odds are discovered at the end of the event, rather than being set at the beginning.\nFINANCE\tRisk vs Uncertainty &#x26; Risk vs Volatility\tRisk is an unknown, but we can predict the probability of it. Uncertainty is an unknown and we cannot predict the probability of it. Volatility refers to short term change and does not mean that something is risky in the long term.\nACCOUNTING\tDouble-Entry Accounting\tA form of bookkeeping where every transaction is recorded in two columns, as either a debit or a credit. The columns should balance and help to better track company finances.\nACCOUNTING\tDepreciation\tA means of attributing the expense of an asset over the course of its useful years instead of as a one-off cost when bought. Machinery for making cars will be bought, but will not mean a large net loss in year one, instead the expense is spread over a few years, meaning profits for each year are more realistic.\nACCOUNTING\tFinancial Ratios (Owner Earnings, Return on Invested Capital, Return on Assets)\tFinancial ratios represent the multitude of numbers in a company’s financial statements in a way which help to evaluate the financial condition of a company. They can represent profitability, liquidity, efficiency, debt, capital, performance, cash flow, and more.\nACCOUNTING\tFinancical Statements (Balance Sheet, Income Statement, Cash Flows)\tA formal report of the finances of a person, group, company or anything else. The three basic ones are the Balance Sheet (snapshot of assets, liabilities, and equity), Income Statement (income, expenses, and profit), and Cash Flow (operating costs, investments and financial activities tied to actual cash).\nPSYCHOLOGY\tCommitment and Consistency\tAs people, once we make a commitment we usually remain consistent with our decision. This can lead to people sticking with a decision even when facts change, or throwing more money at a problem which has sunk costs.\nPSYCHOLOGY\tDeprival Super Reaction Syndrome\tPeople are more affected by loss than by gains, or by what they have to lose. If something is taken away from a person or if that threat is present, even if they have only had it for a short time (or even no time at all), they will become irrationally upset.\nPSYCHOLOGY\tPavlovian Conditioning aka Classical Conditioning\tLearning to associate a conditioned stimulus with an unconditioned stimulus. Pavlov’s experiments proved this. He would ring a bell (conditioned) every time he gave food (unconditioned, food causes salivation) to his dogs. Over time the dogs would salivate (unconditioned) when the bell was rung (conditioned).\nPSYCHOLOGY\tEnvy and Jealousy\tEnvy is when you want something which someone has, a physical object or attribute. Jealousy is when you feel threatened that someone is going to replace you in a relationship, perhaps as a partner or father figure.\nPSYCHOLOGY\tIncentive-Caused Bias/Rewards: System Gaming, Intrinsic/Extrinsic, FedEx\tGet the incentives right. Finding the correct incentive can cause people to change the way they think and change their behavior. A commission may incentivize employees to close more sales at any cost, but the employee will not be concerned with the profitability of the sale in the long term.\nPSYCHOLOGY\tLollapalooza Effect\tWhen multiple psychological biases combine to produce an end product (positive or negative), which is more than the sum of its parts. Tupperware parties use reciprocation, consistency, commitment, and social proof to increase sales.\nPSYCHOLOGY\tSelf Deception and Denial, Pain-Avoiding Psychological Denial\tWe often fool ourselves into believing that falsehoods are true and truths are false. We do this when we do not have enough mental strength to admit the truth and face the consequences. We may tell ourselves that everything is fine when our world is crumbling around us.\nPSYCHOLOGY\tSocial Proof: Line Lengths Example, Peers Have Most Pull\tLooking to others for information to validate a choice in uncertain situations. If other people are doing something then it must be okay for you to do it, too. If others are not doing something then it is likely not a good idea for you to do it either.\nPSYCHOLOGY\tOperant Conditioning: By Consequences, Reward/Punish, Skinnerism \tA type of conditioning where behaviors are learned and encouraged through rewards for good behavior and punishment for bad behavior. If you work hard in your job you receive a paycheck and are motivated to continue this behavior. If you don’t work hard the paycheck could be taken away.\nPSYCHOLOGY\tIdeological bias\tA bias which is rooted in religious, political, or philosophical ideas. These ideologies can cloud judgment, leading us to search for evidence to back up our ideas and dismiss those which do not conform. Once the idea is rooted it is hard to get away from.\nPSYCHOLOGY\tMan with a hammer syndrome\tIf the only tool you have is a hammer, then every problem looks like a nail. If you have limited skills, you begin to see your skill set as the solution to every problem. It is better to have a wide variety of skills and approaches to solve problems with.\nPSYCHOLOGY\tReason-Respecting: Why/Because, Pre-mortem: Assume Failure, Arguing from First Principle\tWe are more likely to comply with something or to learn something when we are given the 'why' behind it. The why strengthens our learning but can be dangerous as we will often learn and comply even when the reason behind it is false.\nPSYCHOLOGY\tLiking/Loving Bias &#x26; Disliking/Hating Bias\tPeople tend to agree with and comply with those who they see in a positive light. This includes attributes such as popularity, attractiveness, familiarity, positive association, and cooperativeness. We are also more inclined towards people with similar opinions, beliefs, and backgrounds to ourselves.\nPSYCHOLOGY\tDoubt-Avoidance \tWhen faced with decisions riddled with doubt, we are hardwired to make quick decisions to remove the doubt, often leaving us with a wrong decision. Law courts force jurors to take time before reaching a decision to deal with this doubt.\nPSYCHOLOGY\tInconsistency-Avoidance \tAs people, we are reluctant to change or to become inconsistent. This means that bad habits are hard to change, but once we have learned good habits, it is easy to keep them.\nPSYCHOLOGY\tCuriosity Instinct\tThe inbuilt instinct which leads us to innovate and explore based on our curiosity. It has led us to acquire information and knowledge about the world around us. Curiosity provides us with an incentive to innovate, explore, and learn.\nPSYCHOLOGY\tKantian Fairness Tendency\tThe pursuit of fairness for everyone and everything. We believe in people being treated equally, but that is not the case. The definition of fairness, of how people should be treated differs from person to person, and we should adjust our behavior accordingly.\nPSYCHOLOGY\tInfluence-from-Mere Association \tA conditioned reflex where a response is triggered by an association. You may have experiences where spending more has resulted in higher quality goods, so you seek out more expensive goods. You may buy a product with a cat on the packaging because you love cats.\nPSYCHOLOGY\tExcessive Self-Regard \tThe more we know, the more we understand what we do not know. We have a tendency to overestimate our ability when we have little experience or knowledge. This optimism does have benefits and means that we are willing to dive into new things.\nPSYCHOLOGY\tOveroptimism &#x26; Over-Confidence \tMost of us have a tendency to overestimate ourselves. We believe that we are more intelligent, honest, happier, etc., than the average person, but we cannot all be above average. Confidence is good, but overconfidence can create a bias in us.\nPSYCHOLOGY\tContrast-Misreaction \tWe often compare people and objects to other people and objects, evaluating their worth based on comparisons. We should evaluate these things individually, and not by their contrast to something else.\nPSYCHOLOGY\tStress-Influence \tStress can be both good and bad for us. Under stress, we can complete tasks and have an enhanced focus for a short period of time. Yet stress can also lead us to act without thinking. Constant stress can affect our health. Light stress, on the other hand, can improve our performance.\nPSYCHOLOGY\tAvailability-Misweighing\tWe have a tendency to give more weight to the information which is at hand and easily remembered. We positively misjudge events if they happened more recently or with more frequency. When events are vivid, we remember them more easily.\nPSYCHOLOGY\tUse-It-or-Lose-It\tThe less we use something, such as a skill, the less useful and honed it will become. It is good practice for us to work on our lesser-used skills so that we have them available to us when we need them.\nPSYCHOLOGY\tDrug-Misinfluence\tDrugs or alcohol can throw us into a spiraling negative-feedback loop which can become self-reinforcing and impossible to escape from. We can be influenced to make big mistakes, so we should stay away from the big mistake (the drugs), in the first place.\nPSYCHOLOGY\tSenescence Misinfluence \tAs we get older, there is a natural drop in our skills and abilities. We can use continuous learning and mental stimulation to slow this decay, like doing a crossword every day or reading a book.\nPSYCHOLOGY\tAuthority-Misinfluence\tAs a society we have hierarchies, a few people lead and lots of people follow. This is a natural human tendency. We have a tendency to blindly follow those who are in power and not question their orders. We will often do something just because someone says so.\nPSYCHOLOGY\tTwaddle Tendency\tMany people try to hide their inadequacies by saying something when they have nothing to say. Big words, pompous language, and jargon are used to mask a lack of knowledge. We would rather ramble than to not know about a subject.\nPSYCHOLOGY\tConfirmation Bias\tWhen we have pre-existing beliefs, we often take facts and make them fit with these beliefs. Facts are interpreted selectively. We like to agree with the facts which support our beliefs and throw out or misinterpret others.\nPSYCHOLOGY\tFirst Conclusion Bias (Second Order Thinking)\tOur brains automatically seek evidence to confirm the first conclusion that we come to. This could be a way for our brains to conserve energy, but it can lead us to confirm a wrong conclusion in some situations.\nPSYCHOLOGY\tReciprocation Theory: Concessions\tReciprocation is the act of doing something nice for someone, with the expectation that they will do something nice in return for you. One form of reciprocity is the idea of reciprocal concessions in which the requester lowers his/her initial request making the respondent more likely to agree to a second request.\nPSYCHOLOGY\tSurvivorship bias\tWe tend to focus on the survivors and the winners for our information and discount the losers. If there are many successful bars in your area you may think about opening one yourself, but the bars which failed are invisible to you, their information is lost.\nMANAGEMENT\tOccam’s razor\tAll things being equal, the simplest solution tends to be the best. We should discard the things which are unknowable and unimportant. Just because something is complicated, it does not mean it is worth anything. Keep everything simple.\nMANAGEMENT\tParkinson’s Law\tWork expands to fill the time available for its completion. The more time we give a task, the more complex we will make it. You can save yourself time and effort by assigning the correct amount of time to a given task.</li>\n</ol>","frontmatter":{"date":"20 February, 2020","path":"/blog/on-asking-questions","title":"On Asking Questions"},"fields":{"readingTime":{"text":"24 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}