{"data":{"markdownRemark":{"html":"<h2>Work in Progress</h2>\n<details>\n  <summary><strong>Table of Contents</strong></summary>\n  <br>\n<ol>\n<li>Introduction — why write?</li>\n<li>Making writing less taxing</li>\n<li>\n<p>Singular purpose </p>\n<ol>\n<li>Use titles to stay focused</li>\n</ol>\n</li>\n<li>Clarity</li>\n<li>\n<p>Revise</p>\n<ol>\n<li>Avoid first person (me, I)</li>\n<li>Avoid passive voice</li>\n<li>Use caution with adverbs</li>\n<li>Punctuation</li>\n<li>Feltre Notes</li>\n<li>Bibliography</li>\n</ol>\n</li>\n<li>Style usage</li>\n<li>Structure</li>\n<li>\n<p>Giant shoulders</p>\n<ol>\n<li>Great writers</li>\n<li>Great books</li>\n</ol>\n</li>\n<li>Conclusion</li>\n<li>\n<p>Notes &#x26; Sources</p>\n</details>\n<br>\n</li>\n</ol>\n<p>The underlying motivation for this piece stemmed from reading a ton. Some time ago, I started reading a lot which led to fiddling with lots of ideas. However, none of these ideas were concrete. I couldn't connect them to its origin and articulate them well. Writing became the next natural step of progression. The question I keep bumping into, ”how to write well?” Here is my attempt to answer that!</p>\n<h4>Introduction — why write?</h4>\n<p>Writing is an investigative tool to explore your thinking. Writing explores questions you are seeking answers to. Writing broadens your mind by turning abstraction (intuition and ideas) into concrete (words). You are full of fuzzy ideas that are strongly supported by your intuition. However, intuition isn't a tool. It is a gut feeling. It is a fuel that supports your biased decision making process. Turning intuition into tools means understanding their origin, limits and how they interact with other ideas. The tool available on hand is called writing. So why use such a tool? Turning ideas into words supported by logical thinking will crystallize your ideas. Writing allows us to think about ideas more rationally and deliberately question its origin and limitation. Writing allows you to remove distractions and biases. Writing can help you understand a topic clearly which then can help you narrate well. Writing extends memory and clarifies thinking. Writing is just another form of art. It requires deep and clear thinking.</p>\n<p>Writing helps you win! How? The person who can best formulate ideas can communicate the best argument. Writing preserves truth. It allows you to have profound and original ideas at your fingertip. Writing helps you sharpen your capacity to think, debate and present intelligently. Writing prevents you from falling prey to fads and ideologies.</p>\n<p>Exposing writing to others will question your intent and thought process. There is no better way to get feedback. The more you share, the more feedback you'll receive creating a feedback loop.</p>\n<p>Lastly, the most complex hierarchies such as law, medicine, business, politics or academics require clear thinking and communicating well. At this level of competency, you are required to defend your strategy in businss, economic policy in politics or defend your thesis in academia research. Thus, well formulated thoughts become necessary and valuable. Warren Buffett said it well.</p>\n<blockquote>\n<p>Some of the things I think I think, I find don’t make any sense when I start trying to write them down. You ought to be able to explain why you’re taking the job you’re taking, why you’re making the investment you’re making, or whatever it may be. And if it can’t stand applying pencil to paper, you’d better think it through some more.</p>\n</blockquote>\n<h4>Making writing less taxing</h4>\n<p>Writing takes cognitive load which can sometimes introduce writer's block. In order to prevent this negative sentiment, following certain rules can help us navigate the grey cloud. Writing can be less taxing if you go after incremental wins.</p>\n<p>First, use radically simple sentences and do not worry about grammatical syntax. The goal is to pen down whatever comes to your mind. Second, pretend you are writing a letter to someone explaining what you have learned. You should choose a person who you admire the most and pretend you are writing directly to them. This will bring forth your natural flow and tone. Third, do not worry about polishing your material just yet. Keep going! Fourth, do not worry about the length of your piece. You should make sure to gather all the facts and opinions. Fifth, use your experience and imagination to write. The latter is always great for story telling which captures the reader's attention. But if you get stuck, fall back on your experiences. Go back to a moment when you were star struck. Share those experiences if they are relevant to your writing.</p>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"4 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}