{"data":{"markdownRemark":{"html":"<p>Imagine you are fascinated by a topic! In order to master a topic, you pound through a pile of books, articles or any other form of artifacts. You feel good about your understanding of that topic. It makes you feel intelligent and are ready to move on to the next topic that captures your mind.</p>\n<p>Six months later, you meet your best friend and try to explain what you had learned a few months ago. But, you miss some key facts about that topic. Now you are just sharing your opinions. So this begs the question of how can we intelligently share facts over opinions? By the way, I am a victim of this hypothetical scenario and I constantly observe this happening around me.</p>\n<p>This is why I have made writing and sharing in public a priority. Writing can help you understand a topic clearly and help you narrate well. Writing is just another form of art. It requires deep and clear thinking. As I write more, I want to make this piece about writing well, document my stylistic approach, common syntax errors so I can prose well.</p>\n<h4>Writing Tips</h4>\n<ol>\n<li>Use radically simple sentences.</li>\n<li>Pretend you are writing a letter to someone explaining what you have learned. Choose a person who you admire which will bring forth your natural voice and flow.</li>\n<li>It'll never be good. Just write and polish it as you go.</li>\n<li></li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">4) Don’t worry if it’s good; just finish it. Whether or not your project is good, you’ll be a different person at the end of it, and that’s always worth doing.\n\n5) Don’t write with the aim of changing anybody’s life. That will lead to heavy, irritating prose. Just share what delights or enrages or fascinates you. If somebody’s life is changed by it, that’s a bonus.\n\n6) Whenever you can, tell stories instead of explaining stuff. Humans love stories, and we hate having stuff explained to us. Use Jesus as an example: He spoke almost exclusively in parables, and allowed everybody to draw their own lessons from his great storytelling. And he did very well.\n\n7) Your work doesn’t have to be any particular length, or written for any particular market. It doesn’t have to even be seen by another human being. How and if to publish your work is a problem for another day. For today, just write.\n\n8) Remember that you’ve been doing research your whole life, merely by existing. You are the only expert in your own experience. Embrace this as your supreme qualification.\n\n9) Every writer starts in the same place on Day One: Super excited, and ready for greatness. On Day Two, every writer looks at what she wrote on Day One and hates herself. What separates working writers from non-working writers is that working writers return to their task on Day Three. What gets you there is not pride but mercy. Show yourself forgiveness, for not being good enough. Then keep going.\n\n10) Be willing to let it be easy. You might be surprised.</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></pre></div>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}