{"data":{"markdownRemark":{"html":"<h2>Why writing is important?</h2>\n<p>Imagine you are fascinated by a topic! In order to master a topic, you pound through a pile of books, articles or any other form of artifacts. You feel good about your understanding of that topic. It makes you feel intelligent and are ready to move on to the next topic that is on your mind. Six months later, you meet a friend at a coffee shop and try to explain what you had learned a few months ago. But, you miss some of the key facts about the topic. Now you are just sharing your opinions. By the way, I am a victim of this hypothetical scenario and I constantly observe this happening around me. This piece is a reminder to myself so I can look back when I start noticing this flaw about myself. </p>\n<p>So this begs the question of how can we intelligently preserve the facts before opinions start to take over? The answer is <strong>writing</strong>. </p>\n<p>Writing preserves truth. It is an investigative tool. When your expose your writing to others, your intent and your thought process is questioned. There is no better way to get feedback. The more you share, the more feedback you'll recieve. A form of learning with positive feedback loop.</p>\n<p>This is why I have made writing and sharing in public a priority. Writing can help you understand a topic clearly which then can help you narrate well. Writing is just another form of art. It requires deep and clear thinking. But writing sometimes can take a cognitive load. So how can you make it less taxing on yourself?</p>\n<h2>Making writing less taxing — just write!</h2>\n<ol>\n<li>Use radically simple sentences. Don't worry about syntax. Just write!</li>\n<li>Pretend you are writing a letter to someone explaining what you have learned. Choose a person who you admire the most and pretend you are writing directly to them. This will bring forth your natural flow and tone.</li>\n<li>The only thing worth doing is to just write. It'll never be good. But once you finish it, you can go back and polish it up. Writing is all it matters.</li>\n<li>Don't fall for making your piece viral. You are writing not to get famous but to get more intelligent about topics you care about learning.</li>\n<li>Writing syntatically is great! But make it fun! Tell stories! We are pattern seeking animals and story telling began with our ancestors. This will make explaining easy and easy to consume. Pick characters that you admire, create a plot and end your plot with a huge take away. Lessons of course can be drawn from great stories.</li>\n<li>Don't worry about the length of your piece. The only thing that matter is to get your point across. But for today, just write.</li>\n<li>Use your experience and imagination to write. The latter is always great for story telling and captures reader's attention. But if you get stuck, fall back on your experiences. Go back to a moment when you were star struck. Bring that element into your writing. </li>\n<li>The only qualification you need is your willingness to write.</li>\n<li>Always carry a commonplace book with you. Transcribe what you find inspiring in other people's writing. Emulate those great writers in your commonplace book.</li>\n<li>Just Write!</li>\n</ol>\n<h2>Revise for clarity.</h2>\n<p>Sharpen your sentences. Each sentence should examine the truth. Revise your sentences over and over again until the sentence becomes <em>readable</em> and <em>believable</em>. Remember, brevity is the <del>ultimate</del> soul of wit. A good writing always conveys purpose with clarity. Clarity is an absolute must requirement.</p>\n<h2>One purpose only.</h2>\n<p>Since clarity is a must, we must define our purpose for writing. In this case, as a learner, I want to write well to remember things. This becomes the center of universe when exploring and writing around the topic. You should let go of sentences or ideas that has nothing to do with the topic. Vagueness causes confusion! To create a bond with a reader, you need to stay ultra-focused on your purpose. If you start to diverge from the original topic, it is time to rethink about the purpose. Lack of clarity will break the bond with your reader. For brevity, try to have one purpose for each sentence. But don't overkill on making your sentences pure with purpose. But narrative is important to catpture reader's attention. We'll address stylistic choices later for more fluid narrative.</p>\n<h2>Use titles to help you stay focused on your purpose.</h2>\n<p>Titles are important. If anytime you feel divereged, titles can be a good reminder for your purpose. This only applies if you choose the write title. Using something like ”Society &#x26; Culture” can be dangerous becasue it does not allow a reader to understand the purpose of your writing. The title is so vague here. It is impossible to tell which society or which culture. And what does that has to do with anything? A better title could be ”A brief history of American culture.” This will draw attention for users who are interested in American histroy. It is clear and concise.</p>\n<h6><em>Notes &#x26; Sources</em>: <a href=\"https://github.com/mnielsen/notes-on-writing/blob/master/notes_on_writing.md\">Notes on writing well by Michael Nielsen</a>, <a href=\"https://jasonzweig.com/on-writing-better-part-1/\">On writing better, part 1: getting started by Jason Zweig</a>, <a href=\"https://jasonzweig.com/on-writing-better-part-2/\">On writing better, part 2: sharpening your tools by Jason Zweig</a>, <a href=\"https://jasonzweig.com/on-writing-better-part-3/\">On writing better, part 3: becoming a writer by Jason Zweig</a>, <a href=\"https://jasonzweig.com/why-i-hate-adverbs/\">Why I hate adverbs by Jason Zweig</a>, <a href=\"https://docs.google.com/viewer?url=https%3A%2F%2Fjordanbpeterson.com%2Fwp-content%2Fuploads%2F2018%2F02%2FEssay_Writing_Guide.docx\">Essay writing guide by Jordan B Peterson</a>, <a href=\"https://www.julian.com/guide/write/intro\">Writing Well by Julian Shaprio</a>, <a href=\"https://www.perell.com/blog/the-ultimate-guide-to-writing-online\">The ultimate guide to writing online by David Perell</a>, <a href=\"https://www.julian.com/blog/punctuation\">Punctuation by Julian Shaprio</a></h6>","frontmatter":{"date":"06 September, 2019","path":"/blog/guide-for-writing-well","title":"Guide for Writing Well"},"fields":{"readingTime":{"text":"5 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}