{"data":{"markdownRemark":{"html":"<h2>Work in Progress</h2>\n<details>\n  <summary><strong>Table of Contents</strong></summary>\n  <br>\n<ul>\n<li>Purpose</li>\n<li>Why write?</li>\n<li>\n<p>How to make writing less taxing?</p>\n<ul>\n<li>Simple sentences</li>\n<li>Pretending you are writing it to someone</li>\n<li>Do not edit</li>\n<li>Do not worry about the length</li>\n</ul>\n</li>\n<li>\n<p>Singular purpose</p>\n<ul>\n<li>Use titles to define your purpose</li>\n<li>Disadvantages of purpose</li>\n</ul>\n</li>\n<li>\n<p>Information gathering</p>\n<ul>\n<li>Use your imagination and experiences</li>\n<li>First principles approach</li>\n<li>Inversion</li>\n<li>Multi-disciplinary approach</li>\n<li>Short experiments</li>\n<li>\n<p>Read, research and take more notes</p>\n<ul>\n<li>Questions</li>\n<li>Books &#x26; publications</li>\n<li>A note on note taking</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Outlining</li>\n<li>First draft</li>\n<li>\n<p>Second draft</p>\n<ul>\n<li>Cutting</li>\n<li>Rewriting</li>\n<li>Avoid Clichés</li>\n<li>First person rules</li>\n<li>Avoiding passive voice</li>\n<li>Caution with adverbs</li>\n<li>\n<p>Punctuation</p>\n<ul>\n<li>Periods</li>\n<li>Commas</li>\n<li>Ellipsis</li>\n<li>Semicolons</li>\n<li>Colons</li>\n<li>Punctuation within quotation marks</li>\n<li>Punctuation within parentheses</li>\n<li>Dashes</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Final draft</p>\n<ul>\n<li>Resolutions</li>\n<li>Rhythm &#x26; Style</li>\n<li>Bibliography</li>\n</ul>\n</li>\n<li>\n<p>Getting better</p>\n<ul>\n<li>Use commonplace to dissect good writing</li>\n<li>Good writers and books</li>\n</ul>\n</li>\n<li>\n<p>Notes</p>\n</details>\n<br>\n</li>\n</ul>\n<hr>\n<h4>Purpose</h4>\n<p>The underlying motivation for the piece stemmed from reading a ton. I started reading a lot a few years ago which led to the fiddling with ideas. However, none of these ideas were concrete. I couldn't connect them to its origin and neither could I articulate them well. Writing became the next natural step of progression. Below are my notes compiled from observing others.</p>\n<h4>Why write?</h4>\n<p>Writing broadens your mind by turning abstraction such as intuition and ideas into concrete words. You are full of fuzzy ideas that are strongly supported by your intuition. However, intuition isn't a tool. It is a gut feeling. Intuition fuels your biased decision making process. Turning intuition into tools means understanding their origins, limitations and how they interact with other ideas.</p>\n<p>The tool available on hand is called writing. Why use such a tool? Writing is an investigative tool to explore your thinking.</p>\n<p>Turning ideas into words supported by logical thinking will crystallize your ideas. Writing allows you to think about ideas more rationally by deliberately questioning its origins and limitations. Writing extends memory and clarifies thinking which then can help you narrate well. Writing is another form of art which requires deep and clear thinking.</p>\n<p>Writing helps you win. How? The person who can best formulate ideas can communicate the best argument. Writing preserves truth. It allows you to have profound and original ideas at your fingertip. Writing helps you sharpen your capacity to think, debate from first principles approach, and present intelligently. Writing prevents you from falling prey to fads and ideologies. It removes distraction.</p>\n<p>The most complex hierarchies such as law, medicine, business, politics or academics require breaking down the complex theories into a simpler form. At this level of competency, you are required to communicate well by defending your strategy in business, economic policy in politics or thesis in academia research. Thus, well formulated thoughts become necessary and valuable to persuade your audience. </p>\n<p>Warren Buffett once said:</p>\n<blockquote>\n<p>Some of the things I think I think, I find don’t make any sense when I start trying to write them down. You ought to be able to explain why you’re taking the job you’re taking, why you’re making the investment you’re making, or whatever it may be. And if it can’t stand applying pencil to paper, you’d better think it through some more.</p>\n</blockquote>\n<p>Lastly, exposing writing to others will question your intent and thought process. There is no better way to get feedback. The more you write and share, the more feedback you'll receive creating a positive feedback loop. As the saying goes, the pen is mightier than the sword.</p>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"4 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}