{"data":{"markdownRemark":{"html":"<h2>I. Law of Productivity</h2>\n<p><em>Time Spent <strong>=</strong> Deliberate Practice</em></p>\n<p><em>High-Quality Work Produced <strong>=</strong> Time Spent <strong>x</strong> Intensity of Focus</em></p>\n<h2>II. Solving big problems</h2>\n<p>State the objective and work backwards. Break down the problem into smaller set of problems. Supply X number of inputs for one set of smaller problem. Aptitude is different than knowledge. Knowledge can be taught but learning how to think (aptitude) can be time consuming. </p>\n<h2>III. Dilberate practice</h2>\n<ul>\n<li>Step 1: Always opt in for active (read physical books) form of learning as opposed to passive (listen to audible) form of learning</li>\n<li>Step 2: Focused mode: pomodoro chunking with diffused mode: exercise, mental exercise and break in between</li>\n<li>\n<p>Step 3: Feynman Technique: There are four simple steps:</p>\n<ul>\n<li>choose a concept and think very hard with repetitive review</li>\n<li>teach it to a toddler (teach to deepen your learning concepts and sharing will catch a blind spots and errors is to brainstorm and work with others who are smartly focused on the topic)</li>\n<li>identify gaps and go back to the source material</li>\n<li>review and simplify</li>\n</ul>\n</li>\n<li>Step 4: spaced repetition to move from working memory to long term and  recall - index cards for retrieval</li>\n<li>Step 5: visual metaphors or analogy to map images to learning or analogies like Syria with cereal</li>\n<li>Step 6: memory palace technique to map physical locations like home to learning concepts</li>\n<li>Step 7: mnemonics to remember list</li>\n<li>Step 8: multi-disciplinary approach to transfer of knowledge from one discipline and applying it to another</li>\n<li>Step 9: analytical lens - do not trust assertions and arguments which constitutes the teacher's message without analyzing. Know what author's incentives are. Be a demanding student and an inspectional reader to make up your mind on where you stand</li>\n<li>Step 10: Test, use scoring system to evaluate yourself. Understanding does not mean expertise. Test, Review and Revise</li>\n</ul>\n<h2>IV. Einstellung</h2>\n<p>Einstellung is an enemy of creativity. Don’t get hung up on your intuition and old ideas. Step 3.2 and 3.3 abover will also deepen your creativity.</p>\n<h2>V. Chemicals Imbalances</h2>\n<p>We all experience chemical imbalances if we work too much or not exercise or not spend time with loved ones. How to fix chemical imbalances or get back in the flow?</p>\n<ul>\n<li>Cortisol: presence of stress; follow the tips below</li>\n<li>\n<p>Endorphins: exercise</p>\n<ul>\n<li>It’ll help you power through a dreadful task after working out. This works for two reasons. First, the endorphin rush just feels great. You’re more tolerant of pain. Second, since you have recently completed a “challenging activity”, your mind is more readily willing to predict that you’ll complete another.</li>\n</ul>\n</li>\n<li>\n<p>Dopamine: complete a task by using music and/or coffee</p>\n<ul>\n<li>Use a particular playlist you use when you need energy. These are songs that you love but don’t listen to frequently.</li>\n<li>Use the right amount of coffee will put ypu in a great mood. Too much and you will get jittery. Experiment and find what works for you.</li>\n</ul>\n</li>\n<li>Serotonin: help others without expecting anything in return</li>\n<li>Oxytocin: spend time with loved ones</li>\n</ul>\n<hr>\n<p><strong>Notes</strong></p>\n<ul>\n<li>\n<p>Notes from Coursera course <a href=\"https://www.coursera.org/learn/learning-how-to-learn\">Learning How To Learn</a></p>\n<ul>\n<li>Tools: Chunking - Pomodoro, Space Repitition Ankii, Visual Memory System - Inedex Cards, Memory Palace Techniques, Visual Metaphors or Analogy (ex: Syria like cereal) Exercise far effective than any drug, Test Checklist, Sleeping, Breathing, Optimism - turning a negative situation into positive helps you relieve stress, Will Power and Focused Instrumental Music.</li>\n<li>Focused Mode &#x26; Diffused Mode (breaks/exercise, sleeping washes away metabolic toxins). Use pomodora technique and chunking for focused, non-distracted learning.</li>\n<li>Chunking helps you with practice and repitition. Learning little by little, small chunks can become larger and gradually will help you become a master of the material. When wanting to learn something new break it down to atomic steps to learn by chunking each step. Chunks are best built with focused, undivided attention, understanding of the basic idea.</li>\n<li>Space Repitition technique to move from Working Memory to Longterm Memory Storage Warehouse.</li>\n<li>Teach others in Leyman's words. Learning with others is a form of active learning.</li>\n<li>Law of Serendipity/Deliberate Practice: lady luck favors the one who deliberately practices. Focusing on more difficult tasks as opposed to easy tasks. Work deliberately hard!</li>\n<li>Eistellung is an enemy of creativity. Einstellung is when your initial thought, an idea you've already had in mind, or a neural pattern you've already developed well and strengthened, prevents a better idea or solution from being found. Or keeps you from being flexible enough to accept new, better, or more appropriate solutions. You have to unlearn your erroneous older ideas or approaches even while you're learning new ones. Number 7 helps you build intuition but be wary of making you from being creative. Einstellung, the idea you are already holding in mind can block you from fresh thoughts.</li>\n<li>Multi-disciplinary approach: Interleaving- Interleaving is a process where one mix, or interleave, multiple subjects or topics while they study. Transfer- transfer of knowledge or learning refers to learning in one context and applying it to another. Procedural learning by doing many different types of problems you’ll find that you understand both why and how, it will help build your intuition. Fresh ideas will help you with independent thinking.</li>\n<li>Recalling: Simple recall, trying to remember the key points without looking at the page, is one of the best ways to help the chunking process along. Visual System Memory System, image helps you enhance your memory and recall the concept. Memory Palace Technique is a powerful way of grouping things you want to remember like the layout of your house and using it as a notepad where you want to deposit the concepts images you want to remember; the more you memorize using these innovative techniques, the more creative you become because you are building these wild, unexpected possibilities.</li>\n<li>Illusions of Competence: Learn to recognize when you're fooling yourself about whether you're actually learning the material. Mini testing, Minimize highlighting, Mistakes are good, Use deliberate practice. Working memory has only 4 slots. Glancing, reading passively or highlighting too much is an illusional learning. One of the best ways to catch a blind spots and errors is to brainstorm and work with others who are smartly focused on the topic.</li>\n<li>Habit building includes four steps - cue (notification), routine (chain habits daily log), reward (incentives and celebrate), belief (hope).</li>\n<li>Product vs Process - when learning something new it is okay to start with a few negative feelings about beginning a learning session. Use pomodoro to push yourself. Learn to focus on process not product. Process means, the flow of time and the habits and actions. Start with hard start and then jump into easy.</li>\n<li>Quitting your day is as important as planning your day. Think of diffuse mode.</li>\n<li>Will Power is more important than time. It is limited and most abundant in the morning. To get started use focused instrumental music.</li>\n</ul>\n</li>\n</ul>","frontmatter":{"date":"03 October, 2019","path":"/blog/deliberate-practice","title":"Deliberate Practice"},"fields":{"readingTime":{"text":"6 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}