{"data":{"markdownRemark":{"html":"<p>Imagine you are fascinated by a topic! In order to master a topic, you pound through a pile of books, articles or any other form of artifacts. You feel good about your understanding of that topic. It makes you feel intelligent and are ready to move on to the next topic that captures your mind.</p>\n<p>Six months later, you meet your best friend and try to explain what you had learned a few months ago. But, you miss some key facts about that topic. Now you are just sharing your opinions. So this begs the question of how can we intelligently share facts over opinions? By the way, I am a victim of this hypothetical scenario and I constantly observe this happening around me.</p>\n<p>This is why I have made writing and sharing in public a priority. Writing can help you understand a topic clearly and help you narrate well. Writing is just another form of art. It requires deep and clear thinking. As I write more, I want to make this piece about writing well, document my stylistic approach, common syntax errors so I can prose well.</p>\n<h4>Just Write</h4>\n<ol>\n<li>Use radically simple sentences. Don't worry about syntax. Just write!</li>\n<li>Pretend you are writing a letter to someone explaining what you have learned. Choose a person who you admire and pretend you are writing directly to them. This will bring forth your natural flow and tone.</li>\n<li>The only thing worth doing is to write. It'll never be good. But once you finish it, you can go back and polish it.</li>\n<li>Don't fall for hitting a million views. You are writing not to get famous but to get more intelligent about topics you care about learning.</li>\n<li>Writing syntatically is great! But make it fun! Tell stories! We are pattern seeking animals and story telling begins with our ancestors. This will make explaining easy. Pick characters that you admire, create a plot and end your plot with a huge take away.</li>\n<li>Don't worry about the length of your piece. The only thing that matter is to get your point across. But for today, just write.</li>\n<li>Use your experience and imagination to write. Latter is always great for story telling. But if you get stuck, fall back on your experiences. Go back to a moment when you were star struck. Bring that element into your writing.</li>\n<li>The only qualification you need is your willingness to write.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre style=\"counter-reset: linenumber NaN\" class=\"language-text line-numbers\"><code class=\"language-text\">8) Remember that you’ve been doing research your whole life, merely by existing. You are the only expert in your own experience. Embrace this as your supreme qualification.\n\n9) Every writer starts in the same place on Day One: Super excited, and ready for greatness. On Day Two, every writer looks at what she wrote on Day One and hates herself. What separates working writers from non-working writers is that working writers return to their task on Day Three. What gets you there is not pride but mercy. Show yourself forgiveness, for not being good enough. Then keep going.\n\n10) Be willing to let it be easy. You might be surprised.</code><span aria-hidden=\"true\" class=\"line-numbers-rows\" style=\"white-space: normal; width: auto; left: 0;\"><span></span><span></span><span></span><span></span><span></span></span></pre></div>","frontmatter":{"date":"06 September, 2019","path":"/blog/how-to-write-well","title":"How To Write Well?"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}