{"data":{"markdownRemark":{"html":"<h1>Work in Progress</h1>\n<h2>What is Product Management?</h2>\n<ul>\n<li>People don't want to use your software. They want to lose weight, laugh, be entertained, get smarter, spend time with loved ones, go home on time, sleep adequately, eat good food, be happy.</li>\n<li>Your product is only as good as the experiences it enables people to have.</li>\n<li>Person will set overall capability vision and direction, own the quality and delivery of software products, ensure roadmap is prioritized to address market opportunities, and lead the product management discipline for the team.</li>\n<li>Product Owner is a role you play on a Scrum team. Product Manager is the job.</li>\n<li>The more experience one has building things, the less they separate ideation and implementation.</li>\n<li>Lemonis is famous for his People/Process/Product principle, where he analyzes businesses on the quality of people, excellence and relevance of product, and the best way to deliver the product.</li>\n<li>Ultimately, the best thing you can do to prepare for a career in Product Management is to build. Manage and “own” a project from inception through execution and operation. Create KPIs and measure your impact. Volunteer for stretch projects. f you have a gap in client knowledge, shadow a CSC or Product Consultant. Learn about our clients, what jobs they are trying to accomplish with our products, and what problems Morningstar is uniquely positioned to solve for them. Become an expert in Morningstar’s products.</li>\n<li>All things considered, the best way to validate your idea is to discuss it with everyone you can engage in a meaningful and constructive dialogue. People who tend to keep their ideas to themselves or not able to communicate are normally not bound to success.</li>\n<li>Questions are a product manager’s best tool. The best way to understand what’s going on or how to get better is to pose probing questions to the people you manage, and above all, to yourself. Pausing to infuse intention into every move at the outset, take a step back at key points along the way, or stop for a tune-up if you’re already further along the road is critical to leveling up as a leader — and questions are the keys that unlock the door to development.</li>\n<li>Design shrinks the gap between what a product does and why it exists. Good design builds on earlier ideas, just as in math or physics. Good design is using reason to make decisions and to solve problems. Every man-made object you use in real life is designed, from forks and desks to keyboards and grocery bags and are the culminations of many hours of thinking and many more hours of trial and error.</li>\n<li>A good product takes chaos and creates order. — Brian Nogard</li>\n<li>'Customers don't have needs, they just want to make progress within the system they belong.' Eye-opening statement from Alan Klement's book. - Jérémie Pottier @dzey</li>\n</ul>\n<h2>Product Roadmap</h2>\n<h2>Technical Requirements</h2>\n<h2>Design Requirements</h2>\n<h2>Business Development</h2>\n<h2>People Management</h2>\n<h2>Resources</h2>","frontmatter":{"date":"04 March, 2020","path":"/blog/on-product-management","title":"On Product Management"},"fields":{"readingTime":{"text":"3 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}