{"data":{"markdownRemark":{"html":"<h4>[I. Brief Summary]</h4>\n<ul>\n<li>Cal Newport’s Deep Work is about the benefits of deep work and practical steps you can take to increase productivity. He shares his thoughts on Deep Work vs Shallow Work. Deep work is a cognitively demanding task as opposed to shallow work which is non-cognitively demanding task. Deep work is valuable, rare and meaningful. The ability to quickly master hard things and the ability to produce at an elite level, in terms of both speed and quality, are two core abilities for thriving in today’s economy.</li>\n</ul>\n<h4>[II. Big Ideas]</h4>\n<h5>Deep Work vs Shallow Work:</h5>\n<ul>\n<li>Deep Work: Professional activities performed in a state of distraction-free concentration that push your cognitive capabilities to their limit.</li>\n<li>Shallow Work: Non-cognitively demanding, logistical-style tasks, often performed while distracted. These efforts tend to not create much new value in the world and are easy to replicate book assumes network tools negatively impact deep work.</li>\n</ul>\n<p><strong>High quality work = Time spent * Intensity of focus</strong></p>\n<h5>Philosophies to integrating deep work:</h5>\n<ul>\n<li>Monastic – attempts to maximize deep efforts by eliminating or radically minimizing shallow obligations.</li>\n<li>Bimodal – seek to eliminate distraction / shallowness only during certain times. During the deep time, work monastically. The minimum time to dedicate is a day.</li>\n<li>Rhythmic – argues that the easiest way to consistently start deep work sessions is to transform them into a simple regular habit.</li>\n<li>Journalistic – you fit deep work wherever you can into your schedule.</li>\n</ul>\n<h5>Four disciplines for developing deep work habits:</h5>\n<ul>\n<li>Focus on the wildly important – identify a small number of ambitious outcomes to pursue with your hours.</li>\n<li>Act on the lead measures – lag measures: describe the thing you’re trying to improve. Lead measures: the new behaviors that will drive success on the lag measures. Focus on lead measures and lag measures will follow.</li>\n<li>Keep a compelling scoreboard – create a sense of competition that drives you to focus on these measures.</li>\n<li>Create a cadence of accountability – confront your scoreboard and commit to specific actions to help improve.</li>\n</ul>\n<h5>There are 4 rules to follow if you want to do deep work:</h5>\n<ul>\n<li>Work Deeply</li>\n<li>Embrace Boredom</li>\n<li>Quit Social Media</li>\n<li>Drain the Shallows</li>\n</ul>\n<h4>[III. Quotes]</h4>\n<ul>\n<li>\"To learn hard things quickly, you must focus intensely without distraction.\"</li>\n<li>\"Your work is craft, and if you hone your ability and apply it with respect and care, then like the skilled\nwheelwright you can generate meaning in the daily efforts of your professional life.\"</li>\n<li>\"The key to developing a deep work habit is to move beyond good intentions and add routines and rituals\nto your working life designed to minimize the amount of your limited willpower necessary to transition into\nand maintain a state of unbroken concentration.\"</li>\n<li>\"Deep work is not some nostalgic affectation of writers and early-twentieth-century philosophers. It’s\ninstead a skill that has great value today.\"</li>\n<li>\"The superpower of the 21st century.\"</li>\n<li>\"I build my days around a core of carefully chosen deep work, with the shallow activities I absolutely\ncannot avoid batched into smaller bursts at the peripheries of my schedule. Three to four hours a day, five days a week, of uninterrupted and carefully directed concentration, it turns out, can produce a lot of valuable output.\"</li>\n<li>\"When you switch from some Task A to another Task B, your attention doesn’t immediately follow—a residue of your attention remains stuck thinking about the original task. This residue gets especially thick if your work on Task A was unbounded and of low intensity before you switched, but even if you finish Task A before moving on, your attention remains divided for a while.\"</li>\n<li>\"To produce at your peak level you need to work for extended periods with full concentration on a single task free from distraction.\"</li>\n<li>\"You have a finite amount of willpower that becomes depleted as you use it.\"</li>\n<li>\"Busyness as a proxy for productivity.\"</li>\n</ul>","frontmatter":{"date":"17 June, 2018","path":"/bookshelf/deepwork","title":"Deep Work by Cal Newport"},"fields":{"readingTime":{"text":"4 min read"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}